[
    {
        "comment": "7 years, 7 Fucking years",
        "label": "NEG"
    },
    {
        "comment": "Oettinger getting damn close to dipping under .900",
        "label": "NEG"
    },
    {
        "comment": "Always gotta stop the tank against the Blues, boys! I don't make the rules! Let's get this W",
        "label": "POS"
    },
    {
        "comment": "That was for the review but it was such a bad challenge they couldn't even do that.",
        "label": "NEG"
    },
    {
        "comment": "Stoppable force vs. moveable object",
        "label": "NEU"
    },
    {
        "comment": "I'm glad everybody else is coming around but I thought it would take longerdonnie suckslets go get like woodcroft or boudreau",
        "label": "NEG"
    },
    {
        "comment": "Going to the game! Go Canucks go!",
        "label": "POS"
    },
    {
        "comment": "Oh WTF 😳",
        "label": "NEG"
    },
    {
        "comment": "I missed it! What did he say?",
        "label": "NEU"
    },
    {
        "comment": "Fly at 11",
        "label": "POS"
    },
    {
        "comment": "Everyone piling on Myers…but ColePlayed horrible that shift on the game winner - play the puck behind the net instead of losing it up the boards - smh",
        "label": "NEG"
    },
    {
        "comment": "This game is a the tits",
        "label": "NEG"
    },
    {
        "comment": "Fun fact: Zibanejad did a DJ set during Lollapalooza this year during the offseason.",
        "label": "POS"
    },
    {
        "comment": "reliable source",
        "label": "NEU"
    },
    {
        "comment": "Jeez",
        "label": "NEU"
    },
    {
        "comment": "Fucking refs! That game was given away to the Cats by them.",
        "label": "NEG"
    },
    {
        "comment": "David fucking Kampf",
        "label": "NEG"
    },
    {
        "comment": "That Zelda sound effect for our player coming out of the box lmao 🤣",
        "label": "POS"
    },
    {
        "comment": "This comment could be reposted with Berube in place of Bannister's name and would be equally accurate",
        "label": "NEU"
    },
    {
        "comment": "Thanks for linking this!",
        "label": "POS"
    },
    {
        "comment": "This team has lost just 6 times in 25 games. But good lord. When they lose. They get their shit kicked in",
        "label": "NEG"
    },
    {
        "comment": "Did he just say “Jackob” lol",
        "label": "NEU"
    },
    {
        "comment": "#HOWDY",
        "label": "POS"
    },
    {
        "comment": "Looked it up. At lower levels including hockey Canada and hockey USA, the boarding major comes with the automatic misconduct. In the NHL, the misconduct is only mandatory if the major is called for boarding resulting in head or neck injury.Rule 41",
        "label": "NEU"
    },
    {
        "comment": "The truth of the matter is this: The Ottawa goalie is straight-up buttcheeks. Shoot the puck!",
        "label": "NEG"
    },
    {
        "comment": "Well Lauzon let's hope Saros can bail you out.And... He didn't",
        "label": "NEG"
    },
    {
        "comment": "Man Slaf is doing everything right but getting points. Part of that is that his shot isn't good enough but also just bad luck",
        "label": "NEG"
    },
    {
        "comment": "Why was that blown dead?",
        "label": "NEU"
    },
    {
        "comment": "It's amazing that he's still so optimistic after watching the Rangers his whole life",
        "label": "POS"
    },
    {
        "comment": "Some motherfucker threw a flamingo on the ice early I blame them",
        "label": "NEG"
    },
    {
        "comment": "This game is painful to watch",
        "label": "NEG"
    },
    {
        "comment": "Imagine not spotting them 5",
        "label": "NEU"
    },
    {
        "comment": "Ohmygod not this again",
        "label": "NEG"
    },
    {
        "comment": "Not very good.",
        "label": "NEG"
    },
    {
        "comment": "Lol, there was never anything close to this when $Bill died.",
        "label": "NEG"
    },
    {
        "comment": "Bruh c'mon I mean not against the sabres",
        "label": "NEG"
    },
    {
        "comment": "NEMO with the UNREAL offensive read to drop down into the slot like that",
        "label": "POS"
    },
    {
        "comment": "FUCK YOU MARIO TREMBLAY THE CURSE ENDS TONIGHT",
        "label": "NEG"
    },
    {
        "comment": "That was worth going to OT for",
        "label": "POS"
    },
    {
        "comment": "It's that kind of stuff that shows how he's way more than just a skill player. His instincts are so impressive.",
        "label": "POS"
    },
    {
        "comment": "He already had one, in his first game",
        "label": "NEU"
    },
    {
        "comment": "JT has some monster shifts on the forecheck",
        "label": "POS"
    },
    {
        "comment": "# We are on fire🔥🔥🔥!",
        "label": "POS"
    },
    {
        "comment": "1. score isn't 2-22. caps are bad3. rub pdb shiny head👨🏼‍🦲i'm not worried",
        "label": "NEU"
    },
    {
        "comment": "#GETTEM CARLY",
        "label": "POS"
    },
    {
        "comment": "We wilt under pressure. Teams watch film.",
        "label": "NEG"
    },
    {
        "comment": "Best xmas music man!     Not a fan of Charlie Brown?",
        "label": "POS"
    },
    {
        "comment": "Carolina Kryptonite... It's been this way since 'nam. Don't kill yourselves over it. It's just the way it is",
        "label": "NEG"
    },
    {
        "comment": "Yeah, they're just better. Oh well",
        "label": "POS"
    },
    {
        "comment": "1 period 1 point. On pace for ~~182~~ 183 points.",
        "label": "POS"
    },
    {
        "comment": "That was kinda dopey",
        "label": "NEG"
    },
    {
        "comment": "See what happens when you play with intensity?! Thank god.",
        "label": "POS"
    },
    {
        "comment": "Serious question what head coaches are on the market midseason?   Or is the plan to have Matt Ellis be the interim head coach?",
        "label": "NEU"
    },
    {
        "comment": "I swear the fastest I've gone from \"I can't stand him\" to \"I will run through a wall for you\" is Nino and ROR.",
        "label": "POS"
    },
    {
        "comment": "Yikes",
        "label": "NEG"
    },
    {
        "comment": "SIMON NEMEC IS A NEW JERSEY DEVIL",
        "label": "NEU"
    },
    {
        "comment": "He usually is bad",
        "label": "NEG"
    },
    {
        "comment": "Hopefully we don't totally fucking suck tonight. I have faith.",
        "label": "NEG"
    },
    {
        "comment": "Caps would be losing 7-0 right now if he was playing",
        "label": "NEG"
    },
    {
        "comment": "Siegenthaler, wtf are you doing bro",
        "label": "NEG"
    },
    {
        "comment": "My stream cut out, did he at least get a star? Because he damn well deserved one",
        "label": "POS"
    },
    {
        "comment": "THIS EFFING GUY!!!!Damn that's a nice goal.",
        "label": "POS"
    },
    {
        "comment": "I need some pretzels and peanut butterBut we are out of peanut butterFrick",
        "label": "NEG"
    },
    {
        "comment": "Wtf “at some point tonight we will see a penalty on Dallas” did I hear that right! What the heck announcer",
        "label": "NEG"
    },
    {
        "comment": "lol the short horn",
        "label": "NEU"
    },
    {
        "comment": "He's definitely an upgrade on Juulsen and Friedman. Probably a pretty close equivalent to Meyers and I know how well like he is around here.",
        "label": "POS"
    },
    {
        "comment": "Those posts last night sounded nice, but this one was even better!!!",
        "label": "POS"
    },
    {
        "comment": "🔔🌊!!!",
        "label": "POS"
    },
    {
        "comment": "Wow wtf is going on!",
        "label": "NEG"
    },
    {
        "comment": "Good guy Rangers - Lindgren must have asked them to take it easy on his brother tonight.Hope we come out with more fire tomorrow. That was anemic.",
        "label": "POS"
    },
    {
        "comment": "I am watching the Philly game feed. Even their announcers acknowledge that they should have been penalized before that goal.",
        "label": "NEG"
    },
    {
        "comment": "Garland and drawing penalties. Name a more iconic duo ❤️",
        "label": "POS"
    },
    {
        "comment": "I love Nico Hischier",
        "label": "POS"
    },
    {
        "comment": "If you make it 5 we also win. Stop turtling",
        "label": "NEG"
    },
    {
        "comment": "How isn't there a sensor in the puck yet too tell if it goes over the goal line or not.",
        "label": "NEG"
    },
    {
        "comment": "Crazy how two totally different games against the Kings generated exactly the same result.",
        "label": "NEU"
    },
    {
        "comment": "Yo this game is crazy",
        "label": "POS"
    },
    {
        "comment": "Knock on wood but…I don't see how this team doesn't hoist the cup at the end of this year. This is a different team than we've ever seen. It was like the 0-3 deficit was a in game challenge they wanted to see if they could overcome. Wild..",
        "label": "POS"
    },
    {
        "comment": "Let Mermis play!  Dude was a bright spot early in the year and I'd rather see him over Merril or Goose.",
        "label": "POS"
    },
    {
        "comment": "How was this supposed to be an easy win??",
        "label": "NEG"
    },
    {
        "comment": "Nemec can be a star",
        "label": "POS"
    },
    {
        "comment": "Did he underachieve? i always felt like he broke out here as he was considered a bust in Arizona",
        "label": "NEG"
    },
    {
        "comment": "what is this Guadalajara business all about",
        "label": "NEG"
    },
    {
        "comment": "Just needed that sweet sweet development time.",
        "label": "POS"
    },
    {
        "comment": "Team just giving up",
        "label": "NEG"
    },
    {
        "comment": "Fuckkkkkk",
        "label": "NEG"
    },
    {
        "comment": "So dumb wtf",
        "label": "NEG"
    },
    {
        "comment": "Honestly…I want us to go out and get a goalie just to prove to everyone that's not the issue lol. Getting one extra save a night isn't going to turn this into a contender. I just want to be here to tell you dummies I told you so",
        "label": "NEG"
    },
    {
        "comment": "Why fix glass take so long",
        "label": "NEG"
    },
    {
        "comment": "Win vs the Isles would tie it, win vs Rangers would break it",
        "label": "NEU"
    },
    {
        "comment": "So glad I get to hear about Bedards goal from two days ago",
        "label": "POS"
    },
    {
        "comment": "Those steals in OT were unreal. I did a fist bump as though we had scored when Jack took the body at the end of his first shift to recover the puck",
        "label": "POS"
    },
    {
        "comment": "Gotta say, overall they much looked better but it seemed to be that second period habit of getting away from their game plan that killed them.A rare occasion the ‘bounces' and ‘goalies' excuse is valid.",
        "label": "POS"
    },
    {
        "comment": "Bro it's been 13 Yeatts of mediocre hockey",
        "label": "NEG"
    },
    {
        "comment": "No. I was so happy to see Brady's reaction to that attempted trip on a penalty shot.",
        "label": "POS"
    },
    {
        "comment": "Hey look it's Garret Rank",
        "label": "POS"
    },
    {
        "comment": "ERod with a lazer",
        "label": "NEU"
    },
    {
        "comment": "holy shit my heart",
        "label": "POS"
    },
    {
        "comment": "Holy.shit finally",
        "label": "POS"
    },
    {
        "comment": "fleury's positioning has always been immaculate",
        "label": "POS"
    },
    {
        "comment": "I wanna see Max score a goal just so I can see Tie's reaction.",
        "label": "POS"
    },
    {
        "comment": "THE RING OF FIRE",
        "label": "POS"
    },
    {
        "comment": "I hate this narrative. What makes him a good coach for a developing team?",
        "label": "NEG"
    },
    {
        "comment": "Honestly glad to see how well Protas has been",
        "label": "POS"
    },
    {
        "comment": "I like the way you think",
        "label": "POS"
    },
    {
        "comment": "It's a great question and I think it's not super simple. He definitely seems sloooooow and just...off ... Which makes me wonder if he's nursing an injury we don't know about or if it's just being 38 years old.He's contributing with a LOT of assists but we're all waiting for him to start rippling the net again and it's just ... Not happening.  Hoping he goes on a scoring run soon",
        "label": "POS"
    },
    {
        "comment": "Yea",
        "label": "NEU"
    },
    {
        "comment": "I hate radishes.",
        "label": "NEG"
    },
    {
        "comment": "It's the Spanish inquisition line",
        "label": "NEU"
    },
    {
        "comment": "Both coming off a b2b with backup goalies starting. Should be a shootout, I'm predicting Bedard breaks his mini slump and lights us up for at least 4 points. Hopefully ovi comes alive once and for all.",
        "label": "POS"
    },
    {
        "comment": "He fucks up.",
        "label": "NEG"
    },
    {
        "comment": "I am more nervous when we play bad teams than when we play good ones.",
        "label": "NEG"
    },
    {
        "comment": "I don't think its necessarily a coincidence that we've started winning since hes been out. Severson has been very bad.",
        "label": "NEG"
    },
    {
        "comment": "I NEVER DOUBTED",
        "label": "POS"
    },
    {
        "comment": "Can we please for the love of god split Heiskanen and his anchor Suter I am begging",
        "label": "NEU"
    },
    {
        "comment": "God damn Ek! Just putting in the work!",
        "label": "POS"
    },
    {
        "comment": "Bad first period but we were able to play well and bounce back in the second and the third. Overall a win we should be proud of.",
        "label": "POS"
    },
    {
        "comment": "Fuck I wanted Bread to get that one!",
        "label": "NEU"
    },
    {
        "comment": "1 of 2 games during the season where my allegiances collide. Lets go Yotes! Take the 2 points in OT (for my own selfish reasons)",
        "label": "POS"
    },
    {
        "comment": "“2 rangers defenders scored today!”“Oh cool! Was it fox? Miller? Schneider?”“Nope Trouba and Lindgren”",
        "label": "POS"
    },
    {
        "comment": "Well at least they didnt make it 7",
        "label": "NEG"
    },
    {
        "comment": "Now he's just gotta get Igor out of his own head",
        "label": "NEG"
    },
    {
        "comment": "tbh I think he was absolutely exhausted, felt like he was out most of the OT.",
        "label": "NEG"
    },
    {
        "comment": "Who exactly was that pass too? Besides the two ottawa sticks that were right fucking there?",
        "label": "NEG"
    },
    {
        "comment": "Our D is a fucking problem. No puck protection, atrocious giveaways, cannot move the puck.  I don't trust a single one of them outside of Rielly.",
        "label": "NEG"
    },
    {
        "comment": "Dickie just got popped in the face",
        "label": "NEG"
    },
    {
        "comment": "Not your fault. Someone earlier said Hat Trick Watch for Thomas, and that put the jinx on everything.",
        "label": "NEG"
    },
    {
        "comment": "See my previous comment for why",
        "label": "NEU"
    },
    {
        "comment": "This is one of the best anthem performances ever.. wow!",
        "label": "POS"
    },
    {
        "comment": "I'd be ok going down to 4-5 defenceman rest of the game. MAYBE only deploy perunvich only in ozone faceoffs. Otherwise bye remainder of game",
        "label": "NEU"
    },
    {
        "comment": "I hate how the league and all the networks always stroke off Ratfuck, not like he's been suspended every year for the dirtiest shit",
        "label": "NEG"
    },
    {
        "comment": "This is the correct take. Frustrating as it is, we weren't matching last season this season with such a green defense.",
        "label": "NEG"
    },
    {
        "comment": "We'll be fighting the refs the rest of the game. Gotta lock in",
        "label": "NEG"
    },
    {
        "comment": "Kid was absolutely gassed already",
        "label": "POS"
    },
    {
        "comment": "8 million/yr willy. Yay!",
        "label": "POS"
    },
    {
        "comment": "Yessir",
        "label": "POS"
    },
    {
        "comment": "Finally. Of the post",
        "label": "NEU"
    },
    {
        "comment": "not even close for vitek. not even moving side to side",
        "label": "NEG"
    },
    {
        "comment": "Owen Power is absolute SHIT!",
        "label": "POS"
    },
    {
        "comment": "lol I won't even feel bad if we lose, that was a hotdog water call.",
        "label": "NEG"
    },
    {
        "comment": "That quote from Hughes pushing back against the idea that we have a lack of scoring after the draft is going to haunt my dreams",
        "label": "NEG"
    },
    {
        "comment": "Took a bad penalty -> Let the Devils extend their lead, killed momentum. Borderline B or C",
        "label": "NEG"
    },
    {
        "comment": "He put us on the list of teams he wanted to be traded to but we bowed out because we thought Vitek could be Adin Hill. I can find the source for this if you want and its from the Athletic.",
        "label": "NEU"
    },
    {
        "comment": "Yeah he's easy to scout and prepare for as he's like the only scoring threat on this team",
        "label": "POS"
    },
    {
        "comment": "Energy. That's their job. It's normal.",
        "label": "POS"
    },
    {
        "comment": "These games after an injury are always rough",
        "label": "NEG"
    },
    {
        "comment": "- Probably shouldn't allow 4 in the first period- Fucking scratch Myers ffs",
        "label": "NEG"
    },
    {
        "comment": "#PAIN",
        "label": "NEG"
    },
    {
        "comment": "The only thing missing was Voronkov taking off Tkachuk's head. I'm sure the chance will come again.",
        "label": "POS"
    },
    {
        "comment": "Borgen's assist was so good",
        "label": "POS"
    },
    {
        "comment": "Life's not that serious cupcake",
        "label": "NEG"
    },
    {
        "comment": "Where did this Adin Hill guy come from anyway? I swear he was projected to be a backup goalie at one point and all of a sudden he starts playing like a god and leads Vegas to the cup. Goalies don't make fucking sense man.",
        "label": "NEG"
    },
    {
        "comment": "Fuck not in",
        "label": "NEG"
    },
    {
        "comment": "My guy Struble does NOT want to go back to Laval",
        "label": "NEG"
    },
    {
        "comment": "A commercial, \"Drive what Bedard would drive if he could legally drive. Drive what Bedard would prefer if and when he is legally able to drive! Chevy drives Chicago!\"",
        "label": "NEU"
    },
    {
        "comment": "I'm ready to see Quick for a few games. Igor needs to figure his shit out.Defense was ass and boy was this a game we needed Chytil and Kakko.",
        "label": "NEG"
    },
    {
        "comment": "MASON MARCHMENT!!!! YOU LOVE TO SEE IT!",
        "label": "POS"
    },
    {
        "comment": "He just fell. Lost his edge on a sharp turn.",
        "label": "NEU"
    },
    {
        "comment": "Please don't let the Wild get the shutout!",
        "label": "POS"
    },
    {
        "comment": "700m is insane",
        "label": "POS"
    },
    {
        "comment": "We fucking missed out on Ministroza when he was here lol",
        "label": "POS"
    },
    {
        "comment": "Tkachuk looks like he ate lead gumballs as a kid in whatever Province would be the Alabama of Canada.",
        "label": "NEG"
    },
    {
        "comment": "Every time Forslund says 'left in regulation' it gives me hope of getting at least 1 point.",
        "label": "NEU"
    },
    {
        "comment": "It will be far too late if they wait til then. Seriously.",
        "label": "NEG"
    },
    {
        "comment": "It would have to be slowly, guy can't change direction to save his life",
        "label": "NEG"
    },
    {
        "comment": "I'm serious everyone, I really want to be optimistic about something for this team, but I'm really struggling right now. I want to be a good fan and I want to support them when they're down just as much as if they were up but they make it so very hard.",
        "label": "NEG"
    },
    {
        "comment": "shoot the fucking puck Kaprizov omfg",
        "label": "NEG"
    },
    {
        "comment": "I'll be at the Avs game.  If they keep playing like this I might not even be repping in shame.",
        "label": "NEG"
    },
    {
        "comment": "Gary is just thrilled to be on tv tonight.",
        "label": "POS"
    },
    {
        "comment": "getting goalied by a nobody like always",
        "label": "NEG"
    },
    {
        "comment": "Well…it can only get better from here, right?",
        "label": "NEG"
    },
    {
        "comment": "The top line is simultaneously so fun to watch and so frustrating, because the chance generation is electric but they're not getting those sweet, sweet points yet. But the process is good, the points should come eventually, it's just annoying in the meantime.Slafkovsky looks great, and getting the shootout winner gives him the highlight clip to ward off the people who don't watch the games and just post the stat sheet.Incredible game by Primeau, possibly his best (though he had one during the late Ducharme era that I think challenges this).Struble will not be returning to Laval.",
        "label": "POS"
    },
    {
        "comment": "Sounds like some Bones trickery.",
        "label": "NEG"
    },
    {
        "comment": "Is noted Hockey terrorist Marc Andre Fleury starting today? If so, I'm not even gonna bother.",
        "label": "NEG"
    },
    {
        "comment": "what the hell...how about a shorty?!",
        "label": "NEG"
    },
    {
        "comment": "KEVIN WHAT ARE YOU DOING",
        "label": "NEG"
    },
    {
        "comment": "Even Gregor got a shootout goal a few days ago in Toronto. Also, didn't know he was on the Maple Leafs.",
        "label": "NEU"
    },
    {
        "comment": "With that brutal 1st period, a much deserved shut out for DeSmith.",
        "label": "POS"
    },
    {
        "comment": "Think part of it is just the old school, unwritten rule thing where you don't try to run up the score in a blowout, but agreed. Was cool to see him basically double up Dewar's shifts all 3rd period.",
        "label": "NEU"
    },
    {
        "comment": "If they only knew what the future was for the Sabres would they have ever been created?",
        "label": "NEG"
    },
    {
        "comment": "So.. what we thinking about this 3rd period? Any takers for some goals?",
        "label": "NEG"
    },
    {
        "comment": "Not watching hockey games is the best way to eliminate any sort of cognitive bias from impacting your opinions on hockey games.Your eyes can be liars but the numbers will never lead you astray.",
        "label": "NEU"
    },
    {
        "comment": "Guess we'll just suffer more thanEdit: No, he's there",
        "label": "NEG"
    },
    {
        "comment": "Seriously. That could be a master class in how to dramatically draw a weak call.",
        "label": "NEG"
    },
    {
        "comment": "If they manage to come back, this will probably be the worst I've ever felt after a win",
        "label": "NEG"
    },
    {
        "comment": "He gotta shoot that shot.",
        "label": "POS"
    },
    {
        "comment": "The \"fuck it, I'll do it myself\"",
        "label": "POS"
    },
    {
        "comment": "Kyprios comes off as such an unlikable person.",
        "label": "NEG"
    },
    {
        "comment": "Say what you will about this years Flames, at least the last few weeks, this team is fun to watch again.   We havent been able to say that for almost two years.",
        "label": "POS"
    },
    {
        "comment": "Marino leaving 2 guys up front all alone comon, at least cover 1",
        "label": "NEG"
    },
    {
        "comment": "Go back to your Oilers sub",
        "label": "NEG"
    },
    {
        "comment": "We've come back from this before. Let's see some second period magic. And a preliminary BOOOOOO EICHEL just because.",
        "label": "POS"
    },
    {
        "comment": "All those power plays we were gifted and we did nothing with them. We take another needless penalty and here we are down 2-1. We need a huge response yesterday.",
        "label": "NEG"
    },
    {
        "comment": "I can't, I just can't take anymore tonight.",
        "label": "NEG"
    },
    {
        "comment": "That one's on Schmid",
        "label": "NEU"
    },
    {
        "comment": "Granlund is elite",
        "label": "POS"
    },
    {
        "comment": "Jones' decisionmaking with the puck behind the redline has been perfectevery pass he's made has resulted in a clean zone entry and possession with the puck in the OZ",
        "label": "POS"
    },
    {
        "comment": "Struble next",
        "label": "NEU"
    },
    {
        "comment": "I'm ready for more pain",
        "label": "NEG"
    },
    {
        "comment": "We didn't want to give Danault 5.5m -> preceded to give major assets to give an infinitely worse player 4.5m.",
        "label": "NEG"
    },
    {
        "comment": "Is it a law the Devils have to give up the first goal?",
        "label": "NEG"
    },
    {
        "comment": "NEVER IN DOUBT!",
        "label": "POS"
    },
    {
        "comment": "Elvis is such a spicy one lol. He gets away with the best slashes. Dawg.",
        "label": "POS"
    },
    {
        "comment": "Sometimes all you can do is laugh",
        "label": "NEG"
    },
    {
        "comment": "THE FUCK ARE WE DOING",
        "label": "NEG"
    },
    {
        "comment": "WE ARE THE BEST TEAM IN THE LEAGUE I WILL TAKE NO QUESTIONS",
        "label": "POS"
    },
    {
        "comment": "Listening rather than watching to games, I swear we hit a crossbar at least once per match. You can hear the ping noises!",
        "label": "POS"
    },
    {
        "comment": "🤌🤌🤌🤌",
        "label": "POS"
    },
    {
        "comment": "OMFG.   I'm shutting the game off now.",
        "label": "NEG"
    },
    {
        "comment": "Oh sorry that's all screwed up.That's team defense? NO, shots allowed in the slot!",
        "label": "NEG"
    },
    {
        "comment": "Quinn Hughes can ruin my life",
        "label": "POS"
    },
    {
        "comment": "Last night our lines looked quite Vegas like in that there's no real top line. Each line has a top 6 winger and a bottom 6 winger. Kinda crazy to think about. I do think that if Kuzmenko plays like he did yesterday and scores a few more he'll end up on Petey's line again cuz Lafferty has gone kinda quiet as of late. It was never a long term plan to have Lafferty playing in the “top 6”.",
        "label": "NEU"
    },
    {
        "comment": "The dmen are activating a lot again. We had mostly put a stop to that during the November struggles.",
        "label": "NEG"
    },
    {
        "comment": "Can't wait to get Ullmarked again",
        "label": "NEU"
    },
    {
        "comment": "As many holdings too so maybe?",
        "label": "NEU"
    },
    {
        "comment": "Baby Dunner on da ice! Looking good so far",
        "label": "POS"
    },
    {
        "comment": "Tocchett is doing everything he can. He even took JT's line off the match-up against Eichel when he couldn't handle it anymore. It's evident the Canucks have shallow depth throughout the lineup. When Garland's line is the one sparking offense and having a positive corsi, the rest of the team needs to get a hint. Petey's line got crushed and we're talking about a guy who wants $12M.",
        "label": "NEG"
    },
    {
        "comment": "*chef's kiss*",
        "label": "POS"
    },
    {
        "comment": "Ylönen is going to force MSL to put him on the 2nd line. His skill level is so much higher than guys like Anderson and Gallagher. I really like what I'm seeing from him. Probably not skilled enough for the top6 on a playoff team but will probably be a really skilled 3rd line guy when the dust settles.",
        "label": "POS"
    },
    {
        "comment": "Pretty telling that when it was 4-1, I still felt they'll need to score a couple of more....",
        "label": "POS"
    },
    {
        "comment": "Wholy shit. I tune out for the second period and Boes scores twice. Guess I'm calling out for the rest of the game",
        "label": "NEG"
    },
    {
        "comment": "People were puzzled when we signed Jones and asked why get another goalie. This is why. We have a goalie out for a while now and I am not terrified of our backup getting games in net going forward.",
        "label": "POS"
    },
    {
        "comment": "Tickpick is always the move! Gf and I went to a game 3 hours before Puck drop and snagged seats in section 21 row 16 for like $80 all in.",
        "label": "POS"
    },
    {
        "comment": "It sends the right message though. Maybe Staios and Andlauer would be embarrassed enough to finally can DJMy time is worth a lot more than a jersey, and this organization is perfectly content wasting it year after year lol",
        "label": "NEG"
    },
    {
        "comment": "Holy fuck i'm so baffled that Gary Galley still commentates these days. Dude is a dumb as a fucking rock.",
        "label": "NEG"
    },
    {
        "comment": "Came here to say this",
        "label": "NEU"
    },
    {
        "comment": "Definitely but that's the make up call.",
        "label": "POS"
    },
    {
        "comment": "We need to do a fire DJ billboard campaign. I feel like it's the only way this clown gets fired",
        "label": "NEG"
    },
    {
        "comment": "Feels like the Leafs deserve a goal or 2 here... Definitely the universe restoring balance after they very undeservingly won in Ottawa",
        "label": "POS"
    },
    {
        "comment": "PAPI STARTING OFF STRONG😏",
        "label": "POS"
    },
    {
        "comment": "I still think we do better there if we have our best finishers in the shootout roster. Lebanc is not an inspiring opener",
        "label": "NEG"
    },
    {
        "comment": "Petterson just had to dive on the ice there before his shift was over lol",
        "label": "NEU"
    },
    {
        "comment": "Mrazek reminded me of Crow there for a bit. I miss Crawford :(",
        "label": "NEG"
    },
    {
        "comment": "Still feels strange not seeing Jim Ramsey",
        "label": "NEU"
    },
    {
        "comment": "Shameless wanted an empty netter. Leave with some feel good after the #4 fuck up",
        "label": "NEG"
    },
    {
        "comment": "It's not Galley on commentary tonight guys. Yes, fuck him anyway, but it's somebody else with the brain dead take on the boarding play.",
        "label": "NEG"
    },
    {
        "comment": "What a pass by Timmins.",
        "label": "POS"
    },
    {
        "comment": "Right now, Brodzinksi should be taking his spot in the lineup. You can tell he wants it. Wheeler seems so slow out there.",
        "label": "POS"
    },
    {
        "comment": "Here's to a new, better future!",
        "label": "POS"
    },
    {
        "comment": "Cuylle is a possession monster",
        "label": "POS"
    },
    {
        "comment": "He wasn't even looking at the net while in the zone",
        "label": "NEG"
    },
    {
        "comment": "DICKS ON THE ICE, BOYS. DICKS DOWN, PUCKS UP.",
        "label": "POS"
    },
    {
        "comment": "Dylan Strome is the Capitals leading goal scorer right now at 10 goals. It still baffles me Colliton's hatred of him .",
        "label": "POS"
    },
    {
        "comment": "YAMS N GOURDS! still in season!!!",
        "label": "POS"
    },
    {
        "comment": "Superer Mario",
        "label": "POS"
    },
    {
        "comment": "Damn right he's hot 🥵🥵🥵",
        "label": "POS"
    },
    {
        "comment": "Hell yeah, go Jackets",
        "label": "POS"
    },
    {
        "comment": "They shouldn't have gotten an o zone faceoff for an offside.",
        "label": "NEU"
    },
    {
        "comment": "Yeah…it looked like he fell in the tunnel?",
        "label": "NEU"
    },
    {
        "comment": "Well. That was profoundly stupid",
        "label": "NEG"
    },
    {
        "comment": "This team has heart - no doubt. It's too bad they end up in positions where they need to rely on it so often.",
        "label": "NEG"
    },
    {
        "comment": "They weren't realy but one thing you have to remember is when you play in an arena with so many fans for each team it affects the players. They feel the emotion from each side. The games usually feel extra intense in Ottawa, though this one didn't really IMO",
        "label": "NEG"
    },
    {
        "comment": "Fucking \"Rat Face\"",
        "label": "NEG"
    },
    {
        "comment": "Reaves grabs Mcdonagh when he gets out of the box right?",
        "label": "NEG"
    },
    {
        "comment": "Love the pressure as well, creates great opportunities and powerplays",
        "label": "POS"
    },
    {
        "comment": "slaf dummying them with his dump truck ass",
        "label": "POS"
    },
    {
        "comment": "This team is so fucking good. Their ability to put the pressure on in the 3rd is unreal.",
        "label": "POS"
    },
    {
        "comment": "That's the key thing. Vegas has 5 loser points in extra time. Los Angeles has 3 loser points in extra time.",
        "label": "NEU"
    },
    {
        "comment": "Pure unadulterated make-up call.",
        "label": "NEG"
    },
    {
        "comment": "🎢",
        "label": "NEU"
    },
    {
        "comment": "Schmid is everything VV is not.",
        "label": "POS"
    },
    {
        "comment": "the amount of interference is insane",
        "label": "NEG"
    },
    {
        "comment": "I never have to get mad at kreider because he's even angrier at himself. That miss is gonna motivate him.",
        "label": "NEU"
    },
    {
        "comment": "That pk sequence from McNabb was beautiful",
        "label": "POS"
    },
    {
        "comment": "Desmith bailed us out in the first and the Canucks dominated the next 40 minutes. Solid win despite the slow start. Now let's go on a win streak. Enough of this win one lose one habit.",
        "label": "POS"
    },
    {
        "comment": "Glenny, we were friends!",
        "label": "POS"
    },
    {
        "comment": "I'm tired, this hurts. See you all Saturday 😔",
        "label": "NEG"
    },
    {
        "comment": "NAK made quick work of that lmao i am at the game and we went from gloves off to rangers guy getting pinned in what felt like three seconds",
        "label": "POS"
    },
    {
        "comment": "Another big game coming for boeser tonight, hockey fights cancer night means so much to him.",
        "label": "POS"
    },
    {
        "comment": "5 guys standing around. Pathetic",
        "label": "NEG"
    },
    {
        "comment": "We're doing that same thing again where we are just playing defense. One of the most frustrating things to ever see for any team. You need to press. The only way to get back in it.",
        "label": "NEG"
    },
    {
        "comment": "Well at least we can comfort ourselves that Detroit has only gotten 5 past the boys with half of their top 6 missing.",
        "label": "NEG"
    },
    {
        "comment": "They're feeling the intensity on the ice too",
        "label": "POS"
    },
    {
        "comment": "I'm SO sick of this ESPN+ commercial.",
        "label": "NEG"
    },
    {
        "comment": "I don't fucking get it",
        "label": "NEG"
    },
    {
        "comment": "10! 10! 10!",
        "label": "POS"
    },
    {
        "comment": "Are these commentators for real man, I swear Steve Dangle was less biased on those YouTube \"Watch a Leaf Game\" videos he used to do.",
        "label": "NEG"
    },
    {
        "comment": "I think he just misses the game and likes to reminisce.",
        "label": "NEU"
    },
    {
        "comment": "Nabbed by the nabber baby!!!",
        "label": "POS"
    },
    {
        "comment": "We are shitting on them so hard",
        "label": "POS"
    },
    {
        "comment": "Honestly I have loved this team for more than 20 years but that effort in the 3rd period was embarassing. From a hockey player standpoint both teams looked like they didn't give a shit but one team gave a shit more. On to the next one I guess",
        "label": "NEG"
    },
    {
        "comment": "Cole what are you doing there man",
        "label": "NEG"
    },
    {
        "comment": "I think it's been pretty clear that their cup contending days from around 2015-2019 are long gone. Which is fine because no team stays competitive forever and usually no team sucks forever. I just want the rebuild to start now so the team can go back to being considered a cup contender. Let's get the rebuild pain over with instead of middling in between.",
        "label": "NEG"
    },
    {
        "comment": "LOVE YOU LOGAN",
        "label": "POS"
    },
    {
        "comment": "Whoa wtf?? What the hell happened to Hill everyone??",
        "label": "NEG"
    },
    {
        "comment": "Cmon refs it's not his fault he's so fucking massive",
        "label": "NEG"
    },
    {
        "comment": "Hey, I just hope both teams have a lot of fun out there tonight!",
        "label": "POS"
    },
    {
        "comment": "I was so mad when in 2020, I heard “With the 5th pick, the Senators are proud to select, from the University of North Dakota, Jake Sanderson” but man am I glad to be totally wrong.",
        "label": "POS"
    },
    {
        "comment": "Kuzmenko almost had it. Sophomore slump is real.",
        "label": "NEG"
    },
    {
        "comment": "That's my honey badger",
        "label": "POS"
    },
    {
        "comment": "Guys, I did it! Game number 11 and I finally saw a kraken win live!! The curse is broken!",
        "label": "POS"
    },
    {
        "comment": "Hahah",
        "label": "POS"
    },
    {
        "comment": "Gruuuuu",
        "label": "NEU"
    },
    {
        "comment": "NO FUCK NO",
        "label": "NEG"
    },
    {
        "comment": "I'm down man. No shame.",
        "label": "NEG"
    },
    {
        "comment": "This team is either getting embarrassed or doing the embarrassing, there feels like there is no in between at times",
        "label": "NEG"
    },
    {
        "comment": "This is just fantastic fellas, fantastic.That Batherson to king Strudel play was unbelievable.",
        "label": "POS"
    },
    {
        "comment": "Those play now ads are absolutely disgusting, \"know what the puck is, you're ready to bet.\" Aqua can go to hell, fucking slumlord",
        "label": "NEG"
    },
    {
        "comment": "VO is on nice point streak, if there is a decision about his future to be made, it's time to trade him now.",
        "label": "POS"
    },
    {
        "comment": "ANOTHER BREAKAWAY HAHAHHA WE SUCK",
        "label": "NEG"
    },
    {
        "comment": "Are you fucking kidding me 😂😂😂",
        "label": "NEG"
    },
    {
        "comment": "I think I have a new favourite Leaf.",
        "label": "POS"
    },
    {
        "comment": "Effortless game.  No effort by anyone.  Will probably be a blowout.  Lazy play is inexcusable.",
        "label": "NEG"
    },
    {
        "comment": "We are really in a puck luck situation here. Someone's dad needs to go to bed or the husband back napping. Maybe a misprint shirt again. Someone do something!",
        "label": "POS"
    },
    {
        "comment": "please be okay Lazar",
        "label": "POS"
    },
    {
        "comment": "He's our sweet cheese, our good-time boy.",
        "label": "POS"
    },
    {
        "comment": "Oh. My. God",
        "label": "POS"
    },
    {
        "comment": "Lindy changes the offensive strat to \"crash the net\"",
        "label": "NEU"
    },
    {
        "comment": "So Zadorov best out of the three. Not bad for a 3rd and a 5th.",
        "label": "POS"
    },
    {
        "comment": "Well that's not ideal",
        "label": "NEG"
    },
    {
        "comment": "They went bankrupt last year and they're being propped up until the season is over so it's pretty much just enough of a crew to keep the lights on.  Barely.",
        "label": "NEG"
    },
    {
        "comment": "Is it a slump?  We won 10 of our last 12.",
        "label": "POS"
    },
    {
        "comment": "Noah Juulsen got lucky there",
        "label": "POS"
    },
    {
        "comment": "Love to see Slaf skate that in himself. He's getting that confidence. He needs to play with Suzuki",
        "label": "POS"
    },
    {
        "comment": "Man this team is awesome",
        "label": "POS"
    },
    {
        "comment": "You heard it here folks!",
        "label": "POS"
    },
    {
        "comment": "pain",
        "label": "NEG"
    },
    {
        "comment": "But we're apparently on par with San Jose because of Wins in Regulation lol. The hate for this team and the lack of critical thinking applied (from inside and out) is ridiculous.",
        "label": "NEG"
    },
    {
        "comment": "Looks like Miro is tired of losing...time to carry his team",
        "label": "POS"
    },
    {
        "comment": "Would've liked to see someone board the fuck out of him or crosscheck every chiclet he's got right down his stupid fucking mouth.",
        "label": "NEG"
    },
    {
        "comment": "Lots of diving by Chicago. Do they know they aren't any better at the power play than we are?",
        "label": "NEG"
    },
    {
        "comment": "I came back to the 3rd with them having a PP. I check back in and they have another PP. Ugh. They gotta do better.",
        "label": "NEG"
    },
    {
        "comment": "Ahhh shit, it's being reviewed",
        "label": "NEG"
    },
    {
        "comment": "Holy crap. Garland shaved his stache and became Tanner Pearson.",
        "label": "NEG"
    },
    {
        "comment": "A Devils W while I'm in Disney means I must remain in Disney",
        "label": "POS"
    },
    {
        "comment": "Coyotes losing is good",
        "label": "POS"
    },
    {
        "comment": "Whyyy does it feel so impossible to score and when we do it gets called back 😭",
        "label": "NEG"
    },
    {
        "comment": "It wouldn't be a loss without him throwing a fit and getting ejected",
        "label": "NEG"
    },
    {
        "comment": "NICEEEEEEEEEEE Boldy is back ladies and gentlemen",
        "label": "POS"
    },
    {
        "comment": "Mangiapane getting paid almost 6 mill to fall down like a 4yr old at public skating",
        "label": "NEG"
    },
    {
        "comment": "He's a great kid, every press interview I've seen of him is amazing. I can't imagine being *that* talented and still being so humble and a team player",
        "label": "POS"
    },
    {
        "comment": "WE ARE SO FUCKING BACK THANK YOU LINDSTROM",
        "label": "POS"
    },
    {
        "comment": "Good. They missed a blatant hold on the breakout. So glad we didn't get the useless PP now",
        "label": "NEG"
    },
    {
        "comment": "What the hell is going on?!",
        "label": "NEG"
    },
    {
        "comment": "Slaffffff ❤️❤️❤️❤️❤️❤️",
        "label": "POS"
    },
    {
        "comment": "If you said before the game that the Devils would have 48 SOG, 30 more than the Sharks and not go to the box I'd say that's an excellent clean game and a 5-2 win at worst 4 in a row going on the road trip and would feel very good despite a mediocre position..... the defense is ATROCIOUS!!!!!!!!!!!!!!!!!!!!!!!!!! Ruff must go! No more excuses!",
        "label": "NEG"
    },
    {
        "comment": "Really making Demko earn his pay check there",
        "label": "POS"
    },
    {
        "comment": "lol when Vinny won that last faceoff the ref got his skate in the way and led to preds recovering. They are so bad today.",
        "label": "NEG"
    },
    {
        "comment": "Let's get a goal or 2 more to compensate getting scored on",
        "label": "POS"
    },
    {
        "comment": "I'm honestly a little pissed at Staios right now. No coaching change because the players want \"stability\".Why is the POHO/acting GM listening to players when it comes to management decisions?",
        "label": "NEG"
    },
    {
        "comment": "Not an argument, CBJ have been rebuilding.",
        "label": "NEU"
    },
    {
        "comment": "Sometimes I wouldn't mind a synced up the feed with O'Donnell and Tom",
        "label": "POS"
    },
    {
        "comment": "BRICK WOLL!!!",
        "label": "POS"
    },
    {
        "comment": "Good evening everyone! I see Oleksiak is already delivering",
        "label": "POS"
    },
    {
        "comment": "Good hearty, ballsy win.",
        "label": "POS"
    },
    {
        "comment": "ITS A POWER PLAY GOAL",
        "label": "POS"
    },
    {
        "comment": "I get that. But the coaches also have a responsibility too. Tocchet needs to work with Kuzmenko cause benching him isn't the solution. Maybe Kuz isn't a fit with the system that Tocchet wants to play. And that's fine. But if that's the case then management has to trade him somewhere else. But if you trade him now. It'll be at a huge loss.",
        "label": "NEU"
    },
    {
        "comment": "Well at least we were good for the first 9 minutes",
        "label": "POS"
    },
    {
        "comment": "Yea stop trying to win games get a top 5 pick",
        "label": "POS"
    },
    {
        "comment": "Hockey needs a taunting penalty.",
        "label": "NEU"
    },
    {
        "comment": "Dang it! I wish we could do comebacks like that",
        "label": "POS"
    },
    {
        "comment": "Just- Fuck",
        "label": "NEG"
    },
    {
        "comment": "Eh. It was a back to back for Vegas and they're missing multiple top dmen. And Vegas still came back and tied it late. Shootout nonsense",
        "label": "NEG"
    },
    {
        "comment": "THE COMMENTARY CURSE",
        "label": "POS"
    },
    {
        "comment": "alright there they go 🤝",
        "label": "NEU"
    },
    {
        "comment": "Willy peaked in Sweden.",
        "label": "NEU"
    },
    {
        "comment": "Yep, that's the Toronto we all know",
        "label": "NEU"
    },
    {
        "comment": "Maybe he doesn't believe in this roster.Ottawa's core is Stützle, Tkachuk, Chabot, and Sanderson. Everyone else is fair game, and it's very possible he has a different vision in mind than Dorion, who let's face it, wasn't exactly a hockey genius.",
        "label": "NEG"
    },
    {
        "comment": "This game brought to you by bad goaltending and bad coaching, like every other game this season.",
        "label": "NEG"
    },
    {
        "comment": "Corrupt referees. There are no other options, only court!Still need to fire Ruff.",
        "label": "NEG"
    },
    {
        "comment": "That was a Bryan McCabe throwback slapper",
        "label": "POS"
    },
    {
        "comment": "Wolf is so composed it's ridiculous. Also the refs tonight are a total fucking joke.",
        "label": "POS"
    },
    {
        "comment": "Brock Faber is already a top 50 defender in the NHL.**Not weird. Wild.**",
        "label": "POS"
    },
    {
        "comment": "Man, I'd love to see a Johnny - Fantilli - KJ line",
        "label": "POS"
    },
    {
        "comment": "I remember when the Sedins were still playing our November results were always meh and then they destroy in Dec. I for one think this is what's happening. Because I must keep the good vibes",
        "label": "POS"
    },
    {
        "comment": "We need to get #firegarrygalley trending for his condoning of this behaviour.  This is embarrassing and terrible for hockey.",
        "label": "NEG"
    },
    {
        "comment": "lol just saw DJs presser and again “can't fault the effort, thought we did enough to win, bad breaks”Shut the fuck up man, lay into the guys for once in your coaching career. Fucking useless.",
        "label": "NEG"
    },
    {
        "comment": "*Opposing player gets a clean high chance great scoring opportunity from one of the best places to shoot from on the ice*This Sub:\"IgOr sO bAaAd\"",
        "label": "NEG"
    },
    {
        "comment": "Exactly. I get buch isn't an experienced center but what the fuck happened. It wasn't even shown live.",
        "label": "NEG"
    },
    {
        "comment": "If it wasn't for the shut out I thought Willy was player of the night",
        "label": "NEU"
    },
    {
        "comment": "Putting Myers and Zadorov out there after the tying goal ruined any momentum we had. That pairing is so shakey.",
        "label": "NEG"
    },
    {
        "comment": "Yeah, would have been the difference Vegas.      ...or at least the refs would have had to given them a few more power plays.",
        "label": "NEU"
    },
    {
        "comment": "How the fuck wasn't that a trip?",
        "label": "NEG"
    },
    {
        "comment": "Aaaaaaaannnnd it's waived off",
        "label": "NEG"
    },
    {
        "comment": "He got fuckin pumped up watching that Lu tribute on the big screen before the game.",
        "label": "POS"
    },
    {
        "comment": "Petey looking good.",
        "label": "POS"
    },
    {
        "comment": "POWERPLAY GOALLLL",
        "label": "POS"
    },
    {
        "comment": "Start the game on time and we don't have to chase every single game",
        "label": "NEG"
    },
    {
        "comment": "Jet Greaves might be our best goalie right?",
        "label": "POS"
    },
    {
        "comment": "My my my, how the turn tables. Lol",
        "label": "POS"
    },
    {
        "comment": "This is what I find fascinating about North American sports. Were this a soccer match between a traditional club and some lesser team, the club offices would be on fire by now, and the coach would be relieved from his duties mid game. As T'Challa would say: We don't do that here.",
        "label": "NEG"
    },
    {
        "comment": "Someone put an APB out on Paul Marner! Man must've been fuming when Matty potted his 2nd of the night and got 5v6 time before Mitch",
        "label": "NEG"
    },
    {
        "comment": "It blows my mind people were so quick to give up on him after last year. This is his third season already and he's younger than KJ ffs.",
        "label": "POS"
    },
    {
        "comment": "#Dammit to hell",
        "label": "NEG"
    },
    {
        "comment": "We really cant play against the kings they shut us down completely",
        "label": "NEG"
    },
    {
        "comment": "somebody find it",
        "label": "NEU"
    },
    {
        "comment": "Could be free and instant teleport and I'd still debate if it was worth my time",
        "label": "NEG"
    },
    {
        "comment": "Can this period just end pls",
        "label": "NEG"
    },
    {
        "comment": "Stolarz did great on the PPK",
        "label": "POS"
    },
    {
        "comment": "THERES NO FUCKING WAY",
        "label": "NEG"
    },
    {
        "comment": "Bedard is awesome.",
        "label": "POS"
    },
    {
        "comment": "Refs put up a hell of a fight, but the boys got it done.",
        "label": "POS"
    },
    {
        "comment": "All time game. Would've been something if we won. OT is 100% a systems issue. I've never seen a team give up more odd man rushes than us. The Brodie regression is obvious. I'm not sure when this sub will acknowledge it, but if he's on your shutdown pair you're not winning a cup. And at 5M you can't afford to not have him on your shutdown pair.",
        "label": "NEG"
    },
    {
        "comment": "It's so crazy to me how much national announcers mispronounce stars players names. Like I'm just a regular dude and I'd do a much better job pronouncing other teams player's names",
        "label": "NEG"
    },
    {
        "comment": "Komisarek looked good because of Markov. So good in fact Toronto signed Mike to a big contract. He wasn't the same player in Toronna because no Markov.",
        "label": "POS"
    },
    {
        "comment": "I hope the Hawks are able to score more goals today than the Jets",
        "label": "POS"
    },
    {
        "comment": "I'm not gonna be one of the people saying Igor sucks or anything because I'm a huge fan of him, but I do think he's been looking different since his injury",
        "label": "NEG"
    },
    {
        "comment": "Bro that's the most popular opinion probably as popular as poutine in Québec",
        "label": "POS"
    },
    {
        "comment": "I've been saying this all season long. It was the same last season with Jones. It seems like every goal against us is Grubauer's fault while Daccord gets a free pass. I like Joey a lot and I think he has a bright future in front of him, but there has to be a little more criticism sent his way and a little less sent Grubauer's way. For some reason some Kraken fans like to hate Grubauer.",
        "label": "NEG"
    },
    {
        "comment": "The Wings are so fucking soft",
        "label": "NEG"
    },
    {
        "comment": "See what happens when you *SHOOT* take notes Huberdeau",
        "label": "POS"
    },
    {
        "comment": "He's a smart player in too small and weak of a body",
        "label": "NEU"
    },
    {
        "comment": "It would be pretty sweet to have another second period where we put up 4. But ya know....just keeping up what we're doing right seems to work as well.",
        "label": "POS"
    },
    {
        "comment": "I few in from Syracuse to Vegas for the game now. I hate how Vegas has embraced Eichel that whiny ass bitch. Go Sabres fuck the leafs fuck philly and fuck eichel.",
        "label": "NEG"
    },
    {
        "comment": "What is it about Arizona that stymies the Blues so much? It is so frustrating. Of course, this team has been the proverbial Jekyll and Hyde this year. smh",
        "label": "NEG"
    },
    {
        "comment": "Mang should be benched for the rest of the game after how he's played so far",
        "label": "NEG"
    },
    {
        "comment": "goodnight everyone but the stars",
        "label": "POS"
    },
    {
        "comment": "I'm hoping this is what the 4th line looks like next year with Jost on the other wing.",
        "label": "POS"
    },
    {
        "comment": "He might not be good with names and numbers. But goddamn he knows his shapes.",
        "label": "POS"
    },
    {
        "comment": "I know that Ben's cross check on Larkin was a BFD, and a big fat fucking no no. But it sure does interest me that apparently Joseph has now hit Larkin twice in the head, and Benn still winds up being the bad guy.",
        "label": "NEG"
    },
    {
        "comment": "Stars are full of pussies smh",
        "label": "NEG"
    },
    {
        "comment": "Vladar was solid. The trade for Toffoli is the trade that keeps on giving. The Wild?  Goonish",
        "label": "POS"
    },
    {
        "comment": "Nice stuff from Struble",
        "label": "POS"
    },
    {
        "comment": "Oh huby",
        "label": "POS"
    },
    {
        "comment": "Fil wanted that one. Could really tell during OT",
        "label": "POS"
    },
    {
        "comment": "I laugh at every single Lav victory story line because I used to shit on Gallant for so long and people down voted because the team was winning. We were winning in spite of his ineptitude... Now we are winning the games that we would have lost and he would be on the post game talking about how \"we just didn't get the bounces\" or \"the other team played tough tonight\"... Suuuuure....",
        "label": "POS"
    },
    {
        "comment": "Tell em it's like soccer but even more flamboyant. They play on ice, hold sticks, and the boys can touch each other",
        "label": "NEU"
    },
    {
        "comment": "Our team is unrecognizable.",
        "label": "NEG"
    },
    {
        "comment": "Bought lower bowl tickets to tonight's game like a month ago, interested to see how the vibe will be. Can't say I've ever been to a game right after they fire their coach, in any sport lol",
        "label": "NEU"
    },
    {
        "comment": "Da, I cheer for blue telogreika of Ohio oblast, how can you tell?Just saying if any other promising young Russian skaters want to start a new adventure and maybe avoid potential drafts, I wouldn't be opposed...",
        "label": "POS"
    },
    {
        "comment": "Let's not overlook the massive impact my opting to not watch the Canucks game to break the hex had in the renewal here. 🤣",
        "label": "NEU"
    },
    {
        "comment": "He's back baby!",
        "label": "POS"
    },
    {
        "comment": "I know that I am oversimplifying things here, but we have not only horrible puck luck, but also there have been at least 5 games we should have won but the Opp goalie is playing OUT OF HIS MIND... sometimes we get outgoalied (and that's most of the time).  but I have said this since the Preseason, thank GOD we called up Nemec...  also Timo is playing like dogshit... he should get back in the groove but the man is -14 right now..",
        "label": "NEG"
    },
    {
        "comment": "Kings falling apart - finally a team not playing their absolute very best hockey against us",
        "label": "POS"
    },
    {
        "comment": "Trying to take out Mrazek Hasek who is one of our only good players this season!?",
        "label": "NEG"
    },
    {
        "comment": "Let's focus on the positives. We didn't get shut out. We got another shorty. The yotes and the perds lost. Bedard didn't score. We're still .500. Nobody got hurt. Panger was happy and is probably drinking with JK right now. My dog looked so sweet in her Furocious Blues Fan bandana. The Hawks are still in last. We're watching Blues hockey and have lots of hockey left. The negatives. We're watching Blues hockey and have lots of hockey left.",
        "label": "POS"
    },
    {
        "comment": "Hoglander is starting to remind me of Jannik Hansen.",
        "label": "NEU"
    },
    {
        "comment": "Did Butch say anything on how long he'll be out? I could look up on Twitter but I'm scared.",
        "label": "NEG"
    },
    {
        "comment": "Treliving didn't want to include Valimaki in the trade, only to give him away for free a few years later. Could have made a super deep run if he pushed all his chips in that year...",
        "label": "NEU"
    },
    {
        "comment": "Well, we do get a lovely participation ribbon... \\*cough\\*",
        "label": "NEG"
    },
    {
        "comment": "Well dammit. I forgot it's a blacked out game from me because I live in the Bay Area despite owning ESPN+ and I'm too cheap to get a vpn. You know what time it is.",
        "label": "NEG"
    },
    {
        "comment": "If they don't call the blatant attack on zub as well I will be livid.",
        "label": "NEG"
    },
    {
        "comment": "Nice to know I don't have to watch this game now. They don't win unless they score first. This team is trash",
        "label": "NEG"
    },
    {
        "comment": "That's not ideal",
        "label": "NEG"
    },
    {
        "comment": "That shot to the knee gave him his speed back",
        "label": "POS"
    },
    {
        "comment": "What a fucking brainless giraffe. FFS.",
        "label": "NEG"
    },
    {
        "comment": "Just got out of that one. Offense was asleep majority of the game but our defense made some key plays and Schmid is the man. He's the goalie going foward (except for back to backs). Rocking a cool .974 SV%. On to Calgary.",
        "label": "POS"
    },
    {
        "comment": "Can you buy feathered Blasty?",
        "label": "NEU"
    },
    {
        "comment": "Blue jackets masterclass",
        "label": "POS"
    },
    {
        "comment": "HES BACK",
        "label": "POS"
    },
    {
        "comment": "FUCKIN EH!!! Huby and KADS LETS GOOO",
        "label": "POS"
    },
    {
        "comment": "That third goal was Jacks fault. He's fucking with the puck in the neutral zone on the blue line and turning it over.2 goals on 3 shots that period. What the fuck.",
        "label": "NEG"
    },
    {
        "comment": "Goal song good.",
        "label": "POS"
    },
    {
        "comment": "Point shots that get blocked are so dangerous in todays game",
        "label": "NEG"
    },
    {
        "comment": "Wolf is so damn quick man",
        "label": "POS"
    },
    {
        "comment": "Looks like Boldy is back! League fucked",
        "label": "POS"
    },
    {
        "comment": "That. Was. Awful.",
        "label": "NEG"
    },
    {
        "comment": "Joshua has been so good this season. Size and toughness will always have a place in the game, especially when they can skate decently.",
        "label": "POS"
    },
    {
        "comment": "##CAPTAIN DAD IS BACK I'M HAVING SO MUCH FUN NOW",
        "label": "POS"
    },
    {
        "comment": "Zary gets his first hat trick",
        "label": "POS"
    },
    {
        "comment": "Exactly where you want a retooling team to be. You can build around the young guys who are exciting and fun to watch, which may invigorate the old guys you can't get rid of.",
        "label": "POS"
    },
    {
        "comment": "That's why he's in the lineup after all, we pay him the big bucks for multilingual chirps and nothing else",
        "label": "POS"
    },
    {
        "comment": "Full lehner mode lmao",
        "label": "POS"
    },
    {
        "comment": "Post, thankfully",
        "label": "POS"
    },
    {
        "comment": "Leave Vincent in Toronto. And Jarmo too. I'm serious.",
        "label": "NEG"
    },
    {
        "comment": "**EICHEL FRIES**🍟",
        "label": "NEU"
    },
    {
        "comment": "Lmao one of those nights because how did that not go in",
        "label": "NEG"
    },
    {
        "comment": "We suck again",
        "label": "NEG"
    },
    {
        "comment": "Happy birthday",
        "label": "POS"
    },
    {
        "comment": "I hate this take. Can't people express their frustration when we are losing/playing bad?",
        "label": "NEG"
    },
    {
        "comment": "Who's throwing parachutes in the stands?",
        "label": "NEU"
    },
    {
        "comment": "Hmm. So Playnow paid out the boosted odds bet of “JT Miller scoring a goal and canucks winning.” With 4.7 odds",
        "label": "NEU"
    },
    {
        "comment": "That was nasty",
        "label": "POS"
    },
    {
        "comment": "all i want for christmas is for boeser to work with quinn's skating coach",
        "label": "POS"
    },
    {
        "comment": "Piss poor passing and puck handling",
        "label": "NEG"
    },
    {
        "comment": "I'm not a mathmagician, but should they not have whistled the play down, like, five seconds before they did?",
        "label": "NEG"
    },
    {
        "comment": "Wtf are you talking about Sens have had a ton of high danger chances",
        "label": "NEG"
    },
    {
        "comment": "Fucking right Willy. Huge.",
        "label": "POS"
    },
    {
        "comment": "Trouba is our 3rd best goalie.",
        "label": "POS"
    },
    {
        "comment": "Omph. -1MM off that next Nylander contract with that blunder",
        "label": "NEG"
    },
    {
        "comment": "How awful of a 1st period can you get Jesus",
        "label": "NEG"
    },
    {
        "comment": "Once again, the eyes of the nation have turned here to this... tiny city in central Ohio with the lead heading into the 3rd period. Blah, blah, blah, blah! There is no way that this period is *ever* going to end with a win as long as this team keeps doing their turtling. I don't see any other way out. They gotta be stopped.",
        "label": "NEG"
    },
    {
        "comment": "Fuck me. We gotta wait till Saturday for the next fucking game? Christ that's agonizing",
        "label": "NEG"
    },
    {
        "comment": "Refs let it get outta hand",
        "label": "NEG"
    },
    {
        "comment": "What good D coverage by Chinny",
        "label": "POS"
    },
    {
        "comment": "so any time we inadvertently trip someone it gets called tripping or kneeing...but when it happens to us there is no call... glad to see some consistency",
        "label": "NEG"
    },
    {
        "comment": "All he has to do is stand around and wait, and he's getting good at that.",
        "label": "NEG"
    },
    {
        "comment": "Let's go!",
        "label": "POS"
    },
    {
        "comment": "JT trying real hard to keep it in the zone",
        "label": "NEG"
    },
    {
        "comment": "I love that I pay for like three different services to watch hockey and STILL am locked out of this game. The entire country is between me and NJ and I'm blacked out for what??",
        "label": "NEG"
    },
    {
        "comment": "I'd ask how, but I'm a Canucks fan.I know the how, is because it can.Murphys Law baby, that's Canucks hockey.",
        "label": "POS"
    },
    {
        "comment": "He hasn't been good for years.  Would rather see someone from Hershey.",
        "label": "NEG"
    },
    {
        "comment": "Demko was rough, happy to get the W",
        "label": "POS"
    },
    {
        "comment": "- FUCK THE REFS- FUCK THE FLYERS- HAIL AKIRA- HAIL 2 POINTS- HAIL THE HUGHES'- I WILL SEE YOU TOMORROW",
        "label": "NEG"
    },
    {
        "comment": "The only thing the Flames org could do to get me to follow another team is Sign Maroon.",
        "label": "NEG"
    },
    {
        "comment": "Fuck yes",
        "label": "POS"
    },
    {
        "comment": "I'd love to know the Blackout algorithm just so I can rationalize this seemingly random punishment. Thou shall not watch.",
        "label": "NEG"
    },
    {
        "comment": "That might have been the worst first period for the Kings so far this season.",
        "label": "NEG"
    },
    {
        "comment": "MacDonald has been playing as a forward so they haven't been counting his.",
        "label": "NEU"
    },
    {
        "comment": "He's pretty bad",
        "label": "NEG"
    },
    {
        "comment": "Waiting for the boos, that's it",
        "label": "NEG"
    },
    {
        "comment": "Goose, thats just stupid",
        "label": "NEG"
    },
    {
        "comment": "Wtf was Fabbro doing? Just standing there while his back was turned setting the play up",
        "label": "NEG"
    },
    {
        "comment": "*sigh*Here we go again.",
        "label": "NEG"
    },
    {
        "comment": "lol. Spectacular game management",
        "label": "POS"
    },
    {
        "comment": "Pucks on net. This goalie is doodoo",
        "label": "NEG"
    },
    {
        "comment": "Myers with the giveaway and Zadorov is lost lol",
        "label": "NEG"
    },
    {
        "comment": "I'm looking forward to the day that a big save from wolf gets an automatic AWOOO cheer",
        "label": "POS"
    },
    {
        "comment": "Downvote me but I think skinner may be my least favorite Sabres player in a long time ughhhhh",
        "label": "NEG"
    },
    {
        "comment": "I don't recall that one.  Must not have scored a lot that year.  🤣",
        "label": "NEG"
    },
    {
        "comment": "Yikes. Falling asleep here",
        "label": "NEG"
    },
    {
        "comment": "wtf was that???? so late",
        "label": "NEG"
    },
    {
        "comment": "That's just the worst. Been struggling trying to get some family members away from all that. Shit is a straight downward spiral of lies.",
        "label": "NEG"
    },
    {
        "comment": "Well fuck winning I guess.",
        "label": "NEG"
    },
    {
        "comment": "Why the fuck would we need a goalie when we have a D1 wiz kid? Fire GMKA.",
        "label": "NEG"
    },
    {
        "comment": "flames goalies and being hung out to dry",
        "label": "NEG"
    },
    {
        "comment": "I'm so fucking sick of these backward passes",
        "label": "NEG"
    },
    {
        "comment": "GI penalties that far out of the paint are total BS man. Should be a trip on Seattle if this league had any balls",
        "label": "NEG"
    },
    {
        "comment": "THATS MY FUCKING CAPTAIN",
        "label": "POS"
    },
    {
        "comment": "Hell yeah. Glad that was called properly.",
        "label": "POS"
    },
    {
        "comment": "I would give almost anything to have a beer with connie",
        "label": "POS"
    },
    {
        "comment": "Hard agree.",
        "label": "POS"
    },
    {
        "comment": "Nice win. Columbus sucks so bad their scoreboard gave up",
        "label": "POS"
    },
    {
        "comment": "🍞🍞🍞 In the dirty area! Don't sleep on Artemi Panarin!!!Shocked Quinn face",
        "label": "POS"
    },
    {
        "comment": "Good God this is a quiet crowd..",
        "label": "POS"
    },
    {
        "comment": "Back to real .500 again hell fucking yeah bjugstad is a legend",
        "label": "POS"
    },
    {
        "comment": "Two quick whistles and twice Bob has dropped his mask real fast…",
        "label": "NEU"
    },
    {
        "comment": "No one saw another Marchand can opener on Timmins that caused the 2 on 1??",
        "label": "NEU"
    },
    {
        "comment": "Shooooooot. Fuck",
        "label": "NEG"
    },
    {
        "comment": "There is absolutely ZERO structure. It's every man for themselves. No one knows where to be at any given time.",
        "label": "NEG"
    },
    {
        "comment": "Juulsen nearly pissed the game away, but thankfully, Vancouver was able to hold on here. Overall, a solid road win against a division opponent.",
        "label": "POS"
    },
    {
        "comment": "Tired and numb. Goodnight everyone.",
        "label": "NEG"
    },
    {
        "comment": "Worst third period team? Blues got the solution for you! They can end even the most stubborn of trends!",
        "label": "NEG"
    },
    {
        "comment": "Why don't the Sabres simply trade for a free player from every team before every game?",
        "label": "NEU"
    },
    {
        "comment": "Did...did I just hear that?",
        "label": "NEU"
    },
    {
        "comment": "Worst thing to come out of the Ohtani news is that SN is going to keep NHL rights :(",
        "label": "NEG"
    },
    {
        "comment": "Sunny is a Scandinavian of olde. He'll be back",
        "label": "POS"
    },
    {
        "comment": "Excellent point",
        "label": "POS"
    },
    {
        "comment": "Garbage ass power play",
        "label": "NEG"
    },
    {
        "comment": "We can't get any points in these close games…. That adds up over the course of a season",
        "label": "NEG"
    },
    {
        "comment": "I was starting to be bummed that we were going to see four losses for the upcoming Canada roadtrip, but now I'm excited to hopefully see some fun games in the next week!",
        "label": "POS"
    },
    {
        "comment": "I'm stone sober and tired from work and I like this score",
        "label": "POS"
    },
    {
        "comment": "I was baked outta my mind watching clowncore during the 3rd period. It made the game much less painful😅",
        "label": "NEG"
    },
    {
        "comment": "Okay just Domi then but the point stands. Nylander could've waited for a full change instead of trying to drive through by himself. Why force it there?",
        "label": "NEG"
    },
    {
        "comment": "I mean, Tuesday's was pretty good too. Lol. We've had a good week.",
        "label": "POS"
    },
    {
        "comment": "#ROSSEE PLAYS HOCKEE",
        "label": "POS"
    },
    {
        "comment": "Fuck!",
        "label": "NEG"
    },
    {
        "comment": "On the day we trade big Z, 3 D score, you couldn't have written it any better",
        "label": "POS"
    },
    {
        "comment": "Oh don't worry I touched on that in this one higher up or lower or in the other thread lmao",
        "label": "NEU"
    },
    {
        "comment": "I stood up in my living room and clapped",
        "label": "POS"
    },
    {
        "comment": "vegas blows!",
        "label": "NEG"
    },
    {
        "comment": "Cmon boys get one here",
        "label": "POS"
    },
    {
        "comment": "We'll just pretend that didn't happen, luke. Lol",
        "label": "NEG"
    },
    {
        "comment": "Atta boy Jeremy Jingleheimer",
        "label": "POS"
    },
    {
        "comment": "God this team is just not fun to watch. The way they scramble in their zone and lose coverage is astounding, and they are so predictable on offence too I don't feel like they are very dangerous",
        "label": "NEG"
    },
    {
        "comment": "I'm so pissed, I had Timo to score with Nico and bratt to win $400",
        "label": "NEG"
    },
    {
        "comment": "not much creativity to lose really",
        "label": "NEG"
    },
    {
        "comment": "Love seeing China stand up for himself. Stützle can sell anything though so that certainly doesn't help",
        "label": "POS"
    },
    {
        "comment": "Damn, Spurgeon with the spicy stick.",
        "label": "POS"
    },
    {
        "comment": "2011, still hits the feels.",
        "label": "POS"
    },
    {
        "comment": "That 10-11-20 rush was a weird symphony of backhand only plays",
        "label": "NEG"
    },
    {
        "comment": "Kesselring!!",
        "label": "POS"
    },
    {
        "comment": "Daccord has been on fire",
        "label": "POS"
    },
    {
        "comment": "I don't have a problem with the crowd laying into kyrou tonight. Everyone's emotional right now and he didn't do himself any favors. Get it out of their systems and the move on and rally.",
        "label": "NEG"
    },
    {
        "comment": "thats like the 5th time laf has juuuust missed picking a top corner on those cross ice passes",
        "label": "NEG"
    },
    {
        "comment": "Sharks trying to milk their PK%, I love it",
        "label": "POS"
    },
    {
        "comment": "Is it just me, or is the ice VERY loud",
        "label": "NEU"
    },
    {
        "comment": "Nah he'll take Saturdays game into account for sure he doesnt react to strongly to one loss",
        "label": "NEU"
    },
    {
        "comment": "Jesus fuck",
        "label": "NEG"
    },
    {
        "comment": "Yea very true and there was definitely a lot of puck luck haha but it's all about the stats at the end of the night ☝️",
        "label": "POS"
    },
    {
        "comment": "This just demonstrates that the other guys need to step up and we can't just rely on Wheeler to carry us through every game.",
        "label": "NEG"
    },
    {
        "comment": "Referee here, it is a thankless job, it is way harder than most people think. The game is so fast. A lot of fans don't actually know the rulebook…All that being said, referees fuckin missed that boarding so bad. Brodin had the puck. Referee was staring right at it. Hit to the numbers, driving him into the boards. Results in an injury. No defending that missed call.",
        "label": "NEG"
    },
    {
        "comment": "We didn't concede 10 goals in the first 2 minutes so I'm pretty confident",
        "label": "POS"
    },
    {
        "comment": "Ralph Kreuger. That is all.",
        "label": "POS"
    },
    {
        "comment": "'horseshit' practice has spilled over into our play tonight",
        "label": "NEG"
    },
    {
        "comment": "The Leafs seem to always manage to lose when something momentous happens?Auston 4-goal NHL debut? Lose in OTTavares scores his 999th and 1000th point against his former team? Lose in OTCome back from a 5-goal deficit for the first time since 1989? Lose in OTNot to mention *it was 4-1*",
        "label": "NEG"
    },
    {
        "comment": "LETS GOOOOOO",
        "label": "POS"
    },
    {
        "comment": "That waa fuckin embarrasing",
        "label": "NEG"
    },
    {
        "comment": "HAHAHA“The fuck are we doing”",
        "label": "NEG"
    },
    {
        "comment": "Its actually insane how many games we've played already this year. LA is 4 games behind us like wtf is that scheduling",
        "label": "NEU"
    },
    {
        "comment": "Think those two shitheads got to the locker room in time to see that?",
        "label": "NEG"
    },
    {
        "comment": "Shoot the puck at the net.  Fucking stupid ass caps.",
        "label": "NEG"
    },
    {
        "comment": "Me, “Hmmmmm Vitek has been looking locked tonight.”*literally two seconds later Boston scores after VV fails to catch that*Sigh",
        "label": "NEG"
    },
    {
        "comment": "Seriously, every PP I felt like I was having major deja vu. It's the same set up, strategy every time. And it doesn't even work!!",
        "label": "NEG"
    },
    {
        "comment": "I don't know who gave our boys a pep talk, but goddamn.. it's working.",
        "label": "POS"
    },
    {
        "comment": "LaPanta dunking on the NHL scheduling",
        "label": "NEG"
    },
    {
        "comment": "“Goalie too good” is sometimes an excuse but that ship has long sailed for this team.",
        "label": "NEG"
    },
    {
        "comment": "I wish we still had him. And got Swayman too, you don't separate those two.",
        "label": "NEU"
    },
    {
        "comment": "Would it kill Alexa to be a little less chipper when the team is getting embarrassed?",
        "label": "NEG"
    },
    {
        "comment": "We need another. No turtling",
        "label": "NEG"
    },
    {
        "comment": "Nice goal by Keller!",
        "label": "POS"
    },
    {
        "comment": "Fuck off",
        "label": "NEG"
    },
    {
        "comment": "Lol I am counting this one as extra special since they didn't have to score any more goals to win",
        "label": "POS"
    },
    {
        "comment": "Damn, think Otter even got the actual shot then it bounced 5 hole",
        "label": "POS"
    },
    {
        "comment": "PANTS. OFF.",
        "label": "NEU"
    },
    {
        "comment": "MONTEMBEAULT!",
        "label": "POS"
    },
    {
        "comment": "0-1-1.  Give em some credit.",
        "label": "NEU"
    },
    {
        "comment": "The other day, I found a $20 in an old coat pocket. My plans changed. Instead of ordering one Hawks win, I ordered two. In a row. With guacamole.",
        "label": "POS"
    },
    {
        "comment": "Nothing is easy.  Fuck.",
        "label": "NEG"
    },
    {
        "comment": "Ouch good stat.Ice crew took less time to change that glass then the canucks did getting their first shot",
        "label": "NEG"
    },
    {
        "comment": "Sharks are coming for that spot",
        "label": "NEU"
    },
    {
        "comment": "Pascal has the biggest load in his pants",
        "label": "POS"
    },
    {
        "comment": "At least when you're at rock bottom the only place you can go is up right? ………………………….………………………….………………………….………………………….………………………….…………………………. Right?",
        "label": "NEG"
    },
    {
        "comment": "This game will give me a stroke warning",
        "label": "NEG"
    },
    {
        "comment": "What are the full list of lines tonight? I know Hoglander is slotting into the Miller line for Kuz, PDG is in for Karlsson.",
        "label": "NEU"
    },
    {
        "comment": "Now we win every game straight to the Stanley Cup, LFGGGG 🦑🦑🦑🦑🦑",
        "label": "POS"
    },
    {
        "comment": "Collapsing again, this time just before the third period",
        "label": "NEG"
    },
    {
        "comment": "Harleyyyyyyy",
        "label": "NEU"
    },
    {
        "comment": "I feel like that was Yamamotos goal",
        "label": "NEU"
    },
    {
        "comment": "so his legs are facing the opposite direction when he got pushed.  Then he clearly get's his blades dug in and swings his legs into the goalie.  that is some fucking bullshit.  I honestly think if it was a Flames player going in, it would be overturned",
        "label": "NEG"
    },
    {
        "comment": "Good start",
        "label": "POS"
    },
    {
        "comment": "The rangers are a bunch of men with good cheekbones",
        "label": "POS"
    },
    {
        "comment": "i need the leafs to win to fill an ohtani sized hole in my heart",
        "label": "POS"
    },
    {
        "comment": "GET RID OF MYERS HOLY FUCK",
        "label": "NEG"
    },
    {
        "comment": "Bullshit penalty on Mika",
        "label": "NEG"
    },
    {
        "comment": "I don't like zadorov at all",
        "label": "NEG"
    },
    {
        "comment": "Chinakhov earned PV's trust tonight lol",
        "label": "POS"
    },
    {
        "comment": "Who just called that?!?!!",
        "label": "NEG"
    },
    {
        "comment": "Timo def not skating like he can. Seems slower. Probably still hurt id guess",
        "label": "NEG"
    },
    {
        "comment": "On the road watching the Blues feed, they've been going on and on about how the new coach is uplifting their team.So, there's that",
        "label": "POS"
    },
    {
        "comment": "Miller looked pissed about it",
        "label": "NEG"
    },
    {
        "comment": "I looked at my phone 5-3 with no time left in the third. Look again it's 5-5. I'm so lucky I'm a Crew fan as well. At least one of my teams loves me the way I love them :(",
        "label": "NEG"
    },
    {
        "comment": "Yes the singing is bad but at least she's getting it over quickly",
        "label": "NEG"
    },
    {
        "comment": "LETS GOOO! Super proud of KJ!! He got bullied all night and still came in clutch.",
        "label": "POS"
    },
    {
        "comment": "Breadman is almost uncontainable at this point. Just doing whatever he wants out there.",
        "label": "POS"
    },
    {
        "comment": "How many wake up call games do we need to, you know, actually play a full 60 minutes",
        "label": "NEG"
    },
    {
        "comment": "Please.. no more long breaks..",
        "label": "NEG"
    },
    {
        "comment": "Kings roll the habs 4-0… wait I'm having deja vu Awesome game all around. Talbot earned that shutout!!",
        "label": "POS"
    },
    {
        "comment": "Both Marchy's and Eichel's respective goals tonight are their 10th goals this season, only one each behind Karlsson (11)",
        "label": "POS"
    },
    {
        "comment": "Besides calling up Othmann, what can Drury actually do? He doesn't have a ton of cap space to work with. LTIR goes away once Chytil & Kakko come back. Any trades would have to be for guys with VERY low salaries.",
        "label": "NEG"
    },
    {
        "comment": "Sullivan signed a 4 year extension last year that hasn't even started yet and the Penguins owners love him, he isn't getting fired.",
        "label": "POS"
    },
    {
        "comment": "Thank you post!",
        "label": "POS"
    },
    {
        "comment": "Matthews also has the rapport to have bad weeks cause Hes literally scored 60 fuckin goals? Pettersson over the past 3 seasons including this one has had multiple stretches of several weeks where he has done almost nothing.",
        "label": "NEG"
    },
    {
        "comment": "That's the grimy goal I like",
        "label": "POS"
    },
    {
        "comment": "I guess it was Woll's fault. He should have stopped a 2 man breakaway then cleared the puck up to Tavares and Nylander at the Boston blue line. They were waiting for the pass that never came.",
        "label": "NEG"
    },
    {
        "comment": "It's 10 pm, do you know where your Duffer is?",
        "label": "NEU"
    },
    {
        "comment": "im in a blackout area so i have to watch the blackhawks coverage tonight😭 pray for me. ive already heard \"connor bedard\" 15 times and i just tuned in",
        "label": "NEG"
    },
    {
        "comment": "What a weak ass call",
        "label": "NEG"
    },
    {
        "comment": "You re right. My memory was off",
        "label": "NEU"
    },
    {
        "comment": "Think the refs have realized they have no idea what is and isnt a penalty, so they're just not going to call anything.",
        "label": "NEG"
    },
    {
        "comment": "God our team was stacked 😭",
        "label": "POS"
    },
    {
        "comment": "Just need Woll for playoffs, hopefully not that bad.",
        "label": "NEU"
    },
    {
        "comment": "Eklund lost his stick behind the net. As he went to grab it, Seider stepped on it and fell.",
        "label": "NEU"
    },
    {
        "comment": "Boqvist wasn't bad but man he was pushed around and off the puck more than Johnson. He was getting rag dolled in front of the net.",
        "label": "NEG"
    },
    {
        "comment": "Ok here's my theory : It isn't Petry who sold his soul for the finals run, but Anderson who actually sold Petry's soul. The curse is therefore on Anderson, and so we have to get rid of him to break the curse.",
        "label": "NEU"
    },
    {
        "comment": "Bruh that was blatant interference",
        "label": "NEG"
    },
    {
        "comment": "ROBO CHUBBS ROOPE!!!",
        "label": "POS"
    },
    {
        "comment": "Zadarov showing up twice in Backlunds after hour interview 💀",
        "label": "NEU"
    },
    {
        "comment": "Hey, it's Rene Bourque. That's cool",
        "label": "POS"
    },
    {
        "comment": "It is unreal how good this team is. Bring on the record-breaking celebration dance!",
        "label": "POS"
    },
    {
        "comment": "Yikes.",
        "label": "NEG"
    },
    {
        "comment": "He won a faceoff that one time... ? Idk.",
        "label": "NEU"
    },
    {
        "comment": "Key's shot has been lethal lately",
        "label": "POS"
    },
    {
        "comment": "Can only dream….but he likes the parity it creates",
        "label": "POS"
    },
    {
        "comment": "Dunno how to feel about this one, good win and pushback But we got totally worked for 75% of this game and really only got let back into it by bad goaltending, still though nice that they didn't quit",
        "label": "NEG"
    },
    {
        "comment": "You know how you can almost get whatever you want in Vegas so long as you have enough money?….why can't I get a game thread that sorts by new comments first? What would it take?",
        "label": "NEG"
    },
    {
        "comment": "Joey's got the footwork down.",
        "label": "POS"
    },
    {
        "comment": "Deja Vu!!!!!!",
        "label": "POS"
    },
    {
        "comment": "Mang? Need a shot man",
        "label": "NEG"
    },
    {
        "comment": "I at least hoped PLD would come out with some extra fire tonight :-/",
        "label": "NEG"
    },
    {
        "comment": "I blame myself for having hope",
        "label": "NEG"
    },
    {
        "comment": "Goaltending is very bad",
        "label": "NEG"
    },
    {
        "comment": "I bet you're real fun at parties.",
        "label": "POS"
    },
    {
        "comment": "Unless we win",
        "label": "NEU"
    },
    {
        "comment": "Cozens said it… lol.  “We're way to soft this year”.  No shit.  Go do something about it",
        "label": "NEG"
    },
    {
        "comment": "Ekker baby!",
        "label": "POS"
    },
    {
        "comment": "Guys I know it's hard to believe but there are two women talking tonight - Leah and Cassie CampbellMost of the time you're hating on Leah it's actually Cassie",
        "label": "NEU"
    },
    {
        "comment": "Nice pass Garls!!! Guy needs some points love to see it. Awesome pass",
        "label": "POS"
    },
    {
        "comment": "BOLDY IS MORE ON FIRE THAN ACTUAL FLAMES",
        "label": "POS"
    },
    {
        "comment": "I agree. It was a frustrating loss but not our worst game. They can turn it on when they need it but offensively there's still struggle",
        "label": "NEG"
    },
    {
        "comment": "If you don't get it just rewatch last year's playoffs. Playing borderline is a skill that is annoying to play against and he can score some pretty big goals",
        "label": "NEG"
    },
    {
        "comment": "I don't mind losing to the kings. But I do mind losing to those gross chrome buckets",
        "label": "NEG"
    },
    {
        "comment": "If the defensemen are supposed to help on offense, offensemen gotta help on defense.",
        "label": "NEU"
    },
    {
        "comment": "I can't wait for The Hockey Guy's breakdown on this game lol",
        "label": "POS"
    },
    {
        "comment": "That's a goal, we deserve it. Bodies at the net and a dirty rebound? Yes please",
        "label": "POS"
    },
    {
        "comment": "Was at the game, last one following the sharks, so hyped",
        "label": "POS"
    },
    {
        "comment": "It's.Been.So.Long.",
        "label": "POS"
    },
    {
        "comment": "Couple of young whipper snappers chatting it up on the bench.. probably talking about scoring goals.. idk",
        "label": "NEU"
    },
    {
        "comment": "Benn eats all the shrimp at Christmas, before anyone else gets a chance to have one...",
        "label": "NEG"
    },
    {
        "comment": "Good first, hope they keep it up, so much fun to watch when they're full energy.",
        "label": "POS"
    },
    {
        "comment": "Did we watch the same game?  The 4th Vegas goal was incredibly soft.He probably wants the third one back too.",
        "label": "NEG"
    },
    {
        "comment": "refs wont call a penalty on a team one goal down this late unless they take off a head it seems",
        "label": "NEG"
    },
    {
        "comment": "His play is by far the most disappointing part of this season. I had no hopes for the team as whole, but I was hoping and expecting him to look good. I was very wrong.",
        "label": "NEG"
    },
    {
        "comment": "Nice hustle by Willy.",
        "label": "POS"
    },
    {
        "comment": "jesus christ, why don't you get down on the ice and suck geekie off bro",
        "label": "NEG"
    },
    {
        "comment": "YES WHAT A GOAL GOOD TIP!!!",
        "label": "POS"
    },
    {
        "comment": "Anyone have a clip of the Watson bush league moment? Didn't watch that part of the game",
        "label": "NEU"
    },
    {
        "comment": "The lengths people go to not criticize willy is fucking laughable smh",
        "label": "NEG"
    },
    {
        "comment": "Everyone except fantilli needs to be gone as soon as possible. Start over completely",
        "label": "NEG"
    },
    {
        "comment": "I do, it was pretty over the top RIGHT in front of the ref watching. But Zadorovs \"hit\" wasn't exactly the cleanest into the boards there by any means....Is that good officiating at the very end of a game? Of course not.. but yeah.",
        "label": "NEG"
    },
    {
        "comment": "Sick game management non-callDoubling down: I did not see a toe pick",
        "label": "NEG"
    },
    {
        "comment": "6 defensemen tonight and Hamonic has only played 5 minutes. Guessing he's the odd man out once Chabot comes back.",
        "label": "NEU"
    },
    {
        "comment": "The Wings Sharks game is pure entertainment! But now it's time to focus on Hawkey <3",
        "label": "POS"
    },
    {
        "comment": "I'm going to two games this week and I'm kind of dreading it. Taking some people for their first games and I know it's gonna suck lol.",
        "label": "NEG"
    },
    {
        "comment": "There'll be another at least 15 stinkers they put out this regular season it's just the way it goes in this sport",
        "label": "NEU"
    },
    {
        "comment": "Even the Flyers GDT was calling that a bad call",
        "label": "NEG"
    },
    {
        "comment": "Few flakes of the devil's dandruff?",
        "label": "NEG"
    },
    {
        "comment": "LETS GO BOYS FUCK YA PAVS",
        "label": "POS"
    },
    {
        "comment": "Nylander is on another point streak. 6 games.",
        "label": "POS"
    },
    {
        "comment": "I don't care we lost.OT is such a shit format and isn't indicative of what teams can do on the ice.Way to steal that point.",
        "label": "NEG"
    },
    {
        "comment": "God I miss the raiders :(I hate them now that they're gone, but am obligated to like them because I work for AllegiantWon't stop me from hating the Knights though",
        "label": "NEG"
    },
    {
        "comment": "Even I hate it. And I'm a rangers fan",
        "label": "NEG"
    },
    {
        "comment": "This sub is way to serious sometimes.",
        "label": "NEU"
    },
    {
        "comment": "That's a goal sir",
        "label": "POS"
    },
    {
        "comment": "It feels like we have been dominated and scored on every shot. Nice to be on the other side of this after last year.",
        "label": "NEG"
    },
    {
        "comment": "Anyone feel that was not a penalty but a great play?",
        "label": "POS"
    },
    {
        "comment": "The Offense officially runs through Eichel",
        "label": "POS"
    },
    {
        "comment": "***MACCCCCCCCCCELLLLLLIIIIIIIII!!!!!!!***",
        "label": "POS"
    },
    {
        "comment": "I don't know how to make the boys play tougher, so I'm just wearing my navy blue John Scott jersey. I feel like its working?",
        "label": "POS"
    },
    {
        "comment": "That…didn't hit him in the face lol? That's an embellishment if I've ever seen it",
        "label": "NEG"
    },
    {
        "comment": "HAHAHAHAHAHA",
        "label": "POS"
    },
    {
        "comment": "**Yes he McCann!!!**",
        "label": "POS"
    },
    {
        "comment": "Thomas being in his off wing for the PP is immediate improvement for me tbh",
        "label": "POS"
    },
    {
        "comment": "I can't wait to see the team with both Pinto and Greig in the lineup 😬",
        "label": "POS"
    },
    {
        "comment": "I'm sorry wheeler I wasn't familiar with your game",
        "label": "POS"
    },
    {
        "comment": "I fucking hate fluke goals so much. Wtf was that bs lol wow",
        "label": "NEG"
    },
    {
        "comment": "Nope. Still like to see the boys pot some goals even if I didn't think they'd win.",
        "label": "POS"
    },
    {
        "comment": "Correct ...centers play a 200 ft game....and support the defense in the defensive zone.  Where was the center support on that play?",
        "label": "NEU"
    },
    {
        "comment": "Gunna miss the entirety of this game. ☹️",
        "label": "NEG"
    },
    {
        "comment": "CAN YOU TAKE ME HIGHER",
        "label": "POS"
    },
    {
        "comment": "Two more goals from Dvorsky today. Now up to 18g 16a +10 in 20 games.  [",
        "label": "POS"
    },
    {
        "comment": "never in doubt.lol remember winning without the heart palpitations?",
        "label": "POS"
    },
    {
        "comment": "Real fucking skunt",
        "label": "NEG"
    },
    {
        "comment": "Did Durzi look okay? I missed him getting up",
        "label": "NEG"
    },
    {
        "comment": "Comeback kids are back?",
        "label": "POS"
    },
    {
        "comment": "Hope Otter isn't anything serious. We need our elite GOAT to rest up and heal before seasons end",
        "label": "POS"
    },
    {
        "comment": "Schneider always on the ice for goals. Really surprised he's not a -25 already.",
        "label": "NEU"
    },
    {
        "comment": "Oof. That's getting called back, damn.",
        "label": "NEG"
    },
    {
        "comment": "The Central division race is really tight right now. The Coyotes are only 3 points below us with the same amount of games played. If the Jets win and we don't, the Jets overtake us for second in the Central, but then the Jets need to win so that Colorado doesn't get any further away from the Stars. Colorado is 3 points up with 1 more game played. The Blues are 4 points below with 1 more game played.",
        "label": "NEU"
    },
    {
        "comment": "Another embarrassing loss",
        "label": "NEG"
    },
    {
        "comment": "We are cooked",
        "label": "NEG"
    },
    {
        "comment": "I'd give up a pick up make him gone.",
        "label": "NEG"
    },
    {
        "comment": "Great job lankinen, but we really need a good couple of shots",
        "label": "POS"
    },
    {
        "comment": "With the fucking bow what an ending",
        "label": "POS"
    },
    {
        "comment": "What a fucking pass Nico",
        "label": "POS"
    },
    {
        "comment": "this team is not serious. give your fucking heads a shake",
        "label": "NEG"
    },
    {
        "comment": "A Dub nonetheless. Unleash the 🐀",
        "label": "POS"
    },
    {
        "comment": "Really is :/ smh",
        "label": "NEG"
    },
    {
        "comment": "Wings fan here, I come in violence. Feels like the Wings sub is real hostile about your jerseys, was wondering what y'alls take is? They're not typical for sure, but I don't mind them at all.",
        "label": "NEU"
    },
    {
        "comment": "…we just need a pissed off jeff skinner hat trick 😵‍💫",
        "label": "NEG"
    },
    {
        "comment": "Yo this is pathetic wtf?",
        "label": "NEG"
    },
    {
        "comment": "Would he even come up to Voronkov's ribcage? I'd like to see that goblin bounce off a brick wall.",
        "label": "NEG"
    },
    {
        "comment": "RIP to me for having to watch the TNT coverage of this game tonight. Purposefully missing the pregame and intermission coverage to avoid Biz and his smooth brained analysis.",
        "label": "NEG"
    },
    {
        "comment": "Dude tried the exact same play twice in a row and it failed twice in a row, 2nd one directly leading to a goal. Pathetic.",
        "label": "NEG"
    },
    {
        "comment": "Haha I'll be there looking for the shirt. Make sure to attend the Displaced Sabres Fans (on Twitter) photo op between periods",
        "label": "NEU"
    },
    {
        "comment": "Insane backcheck from Kovs",
        "label": "POS"
    },
    {
        "comment": "Perfect placement from Norris. What a shot from him.",
        "label": "POS"
    },
    {
        "comment": "how goddamned lucky did we get with jesper bratt. one of the better draft steals of all time already i reckon",
        "label": "POS"
    },
    {
        "comment": "Hahaha love it!",
        "label": "POS"
    },
    {
        "comment": "Soderblom.  Nope.  Sorry dude, I want you to do well, but you just don't have it bro.",
        "label": "NEG"
    },
    {
        "comment": "Evangelista, spreading the Gospel of the Preds in every arena, one goal at a time.",
        "label": "POS"
    },
    {
        "comment": "Do you really think they were shitting the bed for the entire game bar 30 seconds",
        "label": "NEG"
    },
    {
        "comment": "Bratt said fuck the refs I'll do it myself",
        "label": "NEG"
    },
    {
        "comment": "That's the issue with blaming anyone. Does our defense need to step up and stop allowing grade A chances? Absolutely! However, Comrie is not exonerated from blame here. I know we have huge defensive problems, but is it too much to ask him to make an occasional big save?",
        "label": "NEG"
    },
    {
        "comment": "Fabian Fucking Zetterlund I knew he was gonna be the future. Everyone in here was ready to write this kid off after last year but they still had those Timo goggles on. What a steal by GMMG.",
        "label": "POS"
    },
    {
        "comment": "GET FUCKED BUFFABLOW",
        "label": "POS"
    },
    {
        "comment": "Dumba wtf",
        "label": "NEG"
    },
    {
        "comment": "Both have been MIA past couple weeks, funnily. Matthews kind of broke out of it tonight but neither are playing like 10M+ players at the moment. If Pettersson wants 12M he needs to show that he can play like one",
        "label": "NEU"
    },
    {
        "comment": "Think the \"it completes the DMV\" was a prescribed talking point or did they come up with it on their own",
        "label": "NEU"
    },
    {
        "comment": "Bread grew up with a reverse shooter tutor: corners blocked off with plywood and middle of the net wide open.",
        "label": "NEU"
    },
    {
        "comment": "That's a BIG stop",
        "label": "POS"
    },
    {
        "comment": "one of his best passes all year",
        "label": "POS"
    },
    {
        "comment": "Hahahahaha Shorty joins the Cousins slander lmao",
        "label": "NEU"
    },
    {
        "comment": "40k a daily cap hit..",
        "label": "NEU"
    },
    {
        "comment": "So their missing 2 of their top 4D and their (league leading) starting goalie…and its 3-1 and only 6 SOGOtter now 23rd in SV %",
        "label": "POS"
    },
    {
        "comment": "Sucks having to settle for a loser point after that comeback but considering at the start of the third I was expecting them to get shutout finally I guess I can't be too mad lol.",
        "label": "NEG"
    },
    {
        "comment": "Couldn't have said it better myself 🙏",
        "label": "POS"
    },
    {
        "comment": "This game is nuts",
        "label": "POS"
    },
    {
        "comment": "Yeeessss! Finally Breaking Free live!!!",
        "label": "POS"
    },
    {
        "comment": "Good game tonite...games like tonite are what is going to make it hard to make playoffs......Make Beliefs Goalie > Our Goalie tonite",
        "label": "POS"
    },
    {
        "comment": "Yeah in the post game. All I remember was Leetch and Patrick",
        "label": "NEU"
    },
    {
        "comment": "Most encouraging game of the season. More of that please. I actually really liked how all the D-Pairings were deployed tonight. Go Sens Go baby do this against Toronto now",
        "label": "POS"
    },
    {
        "comment": "Rossi Bedard fight",
        "label": "NEU"
    },
    {
        "comment": "500 team over the last 12 now. Roster problems are becoming glaring",
        "label": "NEG"
    },
    {
        "comment": "Welcome to the big leagues Simon",
        "label": "POS"
    },
    {
        "comment": "I'm gonna need some more energy from Jeff and Jody, it barely even feels like a home broadcast",
        "label": "NEG"
    },
    {
        "comment": "Incredibly soft penalty, but it was 3-0 us before that, so refs gonna ref",
        "label": "NEG"
    },
    {
        "comment": "My god sharongovich is a sniper",
        "label": "POS"
    },
    {
        "comment": "15th draft pick here we come!!!",
        "label": "POS"
    },
    {
        "comment": "That duclair zett line has been buzzing the last few weeks.",
        "label": "POS"
    },
    {
        "comment": "I agree. The years make more sense than the money. Who made the call with Miller over Bo. I couldn't accept it at the time but it was the correct one (not that Bo is terrible but his contract is) I guess there isn't an either or option with Petey but I wouldn't be surprised if the team plays it tight and doesn't rush in to a decision.",
        "label": "NEU"
    },
    {
        "comment": "Turn the page and move on. Nothing else you can do.  Stars are still in a good spot",
        "label": "POS"
    },
    {
        "comment": "The good news is there plenty of time for guys to find form for the important part of the season.",
        "label": "POS"
    },
    {
        "comment": "Fuckkkkkk",
        "label": "NEG"
    },
    {
        "comment": "Reichel needs to have a more shoot first mentality",
        "label": "NEU"
    },
    {
        "comment": "At was me too. No biggie. Have a laugh",
        "label": "NEU"
    },
    {
        "comment": "Big brain move letting Shitcago get one first so it's literally impossible to go up 2-0.",
        "label": "NEG"
    },
    {
        "comment": "Dougie got surgery on his pec, so he'll be out at least until playoff time is my guess.",
        "label": "NEU"
    },
    {
        "comment": "Well, at least it can't be 2-0 now!",
        "label": "NEU"
    },
    {
        "comment": "But he's getting so pissed off that *we're* feeling bad for him. We're feeling bad watching the only good thing about this team!",
        "label": "NEG"
    },
    {
        "comment": "Fucking catch the puck my guy",
        "label": "NEG"
    },
    {
        "comment": "I literally just started getting into hockey this past month. My first ever NHL/LA kings game was against the islanders, and since then we've been losing. I'm pretty sure I'm bad luck or somethingAll joking (maybe not really) aside, with my incredibly limited knowledge of hockey, I have noticed that we've been regressing since the Islanders game, with this last one against the Jet's just being sloppy in the second and third periods.Def sucked seeing Gavrikov getting injured during the Rangers game",
        "label": "NEG"
    },
    {
        "comment": "I like that thomas gave him an elbow back.",
        "label": "POS"
    },
    {
        "comment": "Ebs I love ya but I don't think that side of the goal thing you've tried four times this game is gonna work",
        "label": "NEG"
    },
    {
        "comment": "This is what I'd try to do. Wheeler has been given a great chance to produce. I don't think he's got it in him. He looks very slow out there too. Keep Brodzinski up and deal Wheeler.",
        "label": "NEG"
    },
    {
        "comment": "Yup. And he's the only person who will get us the upgrade in goaltending or defence we needs we can score without him. Any better suggestions or you all in the wait it out it'll get better crowd?",
        "label": "NEU"
    },
    {
        "comment": "Sucks OT in the reg season is a bullshit coinflip. No one thought this was a win in the \"we give BJ's\" locker room tonight. Loved the huge ability to push against a dog shit defensive team. That level of effort is the 1 or 2 you need from behind to take a game in the playoffs.",
        "label": "NEG"
    },
    {
        "comment": "We did",
        "label": "NEU"
    },
    {
        "comment": "2 mins for doing your job",
        "label": "NEU"
    },
    {
        "comment": "I haven't had this feeling about this team in a long time. Let's fucking go",
        "label": "POS"
    },
    {
        "comment": "Russian horse meat ftw",
        "label": "NEU"
    },
    {
        "comment": "ROR and Fors such beauties",
        "label": "POS"
    },
    {
        "comment": "Mcleod needs to be locked up long term",
        "label": "NEG"
    },
    {
        "comment": "Holy fuck that was sick, is Garland-Kuzmenko an unlikely but great combination?",
        "label": "POS"
    },
    {
        "comment": "2nd PERIOD TEAM!!!!!!",
        "label": "POS"
    },
    {
        "comment": "What a piss missile",
        "label": "NEG"
    },
    {
        "comment": "Beautyyy",
        "label": "POS"
    },
    {
        "comment": "I agree with this. It's something I'm noticing more of this year than I ever have before.",
        "label": "NEU"
    },
    {
        "comment": "If you had to sign Hronek today what would be the price?",
        "label": "NEU"
    },
    {
        "comment": "Jack has been getting his cookies stolen all night...wth",
        "label": "NEG"
    },
    {
        "comment": "I READ YOUR COMMENT SO I DID AND WE SCORED LETS GOOOOOOO",
        "label": "POS"
    },
    {
        "comment": "Hell yes!!",
        "label": "POS"
    },
    {
        "comment": "Fuck off danualt  !!!!!",
        "label": "NEG"
    },
    {
        "comment": "Suter breaks up more plays. He's hyper responsible. He did so much work in the neutral zone before his injury.",
        "label": "POS"
    },
    {
        "comment": "Well, we need Anderson to step up here. Beat someone's ass please. Not like we have a choice with X out, seriously pissed we don't have him around.",
        "label": "NEG"
    },
    {
        "comment": "Game plan for the 2nd: do the opposite of everything we just did",
        "label": "NEG"
    },
    {
        "comment": "No team has a worse goal differential in ANY period than the Jackets in the 3rd period (-22).Even the Blues and their atrocious record when giving up the first goal have a good chance of coming back if we're down going into the 3rd.",
        "label": "NEG"
    },
    {
        "comment": "Please don't lose to Carolina tonight, lol. I can't take it",
        "label": "NEG"
    },
    {
        "comment": "I'd like you all to know that I went in the Hawks GDT this morning ahead of game to see their thoughts. The overwhelming sentiment was that this game would be an easy game and the Kraken were a walkover. I know it's only second period, but we're not making this an easy game.",
        "label": "POS"
    },
    {
        "comment": "Yep to all of that but especially Benson. Easily my current favorite Sabre.",
        "label": "POS"
    },
    {
        "comment": "That's a weak ass call. Foligno is bringing the energy!!!",
        "label": "NEG"
    },
    {
        "comment": "Guys crazy thought, it's almost like when you're more structured more bounces go your way 😮",
        "label": "POS"
    },
    {
        "comment": "Bastian's puck skills have never been amazing, but man has he struggled to handle the puck this season. Seems like anything rougher than the softest, feathery pass just bounces right off him and becomes a turnover.",
        "label": "NEG"
    },
    {
        "comment": "These dingleberries are going to blow it haha",
        "label": "NEG"
    },
    {
        "comment": "I've got a Thomas London Knights jersey.  He used to wear 27.",
        "label": "NEU"
    },
    {
        "comment": "Does uh the Jets realize they down by 1? Shocked no empty net on the PP",
        "label": "NEG"
    },
    {
        "comment": "You defend him more than most of our actual defenseman",
        "label": "NEG"
    },
    {
        "comment": "Pathetic show for the guys after the horrible 3rd from last game you'd think they'd at least try tonight",
        "label": "NEG"
    },
    {
        "comment": "another educator???",
        "label": "NEU"
    },
    {
        "comment": "I looked at that PP2 line and legitimately didn't even know we were on the PP…",
        "label": "NEU"
    },
    {
        "comment": "How does Myers make the wrong decision every single time?",
        "label": "NEG"
    },
    {
        "comment": "Now we gotta force the Leafs to Toronto Sports their way to a loss..",
        "label": "NEG"
    },
    {
        "comment": "I dunno man, that is a pretty big moment of the game lol... technically lost the game because of that miss regardless of player",
        "label": "NEG"
    },
    {
        "comment": "Reichel is who I expected but I wouldn't have been surprised if Dickinson got the go ahead as he's been scoring",
        "label": "NEU"
    },
    {
        "comment": "Double tap now counts as a goal. This league is such a joke",
        "label": "NEG"
    },
    {
        "comment": "Jonathan Quick is becoming one of my favorite players and I still don't know how I feel about it.",
        "label": "POS"
    },
    {
        "comment": "Last year I was watching the standings and waiting for you guys to overtake the knights, right now I just don't want the sharks to be higher up than you",
        "label": "NEU"
    },
    {
        "comment": "That game was actually fucking bullshit",
        "label": "NEG"
    },
    {
        "comment": "It's uh…getting worse somehow",
        "label": "NEG"
    },
    {
        "comment": "If they said the reason was coleman cleared it off the player therefore it was put in by the flames I would understand that but to say that it's because they hit Hischier into the goalie is absolute complete BS",
        "label": "NEG"
    },
    {
        "comment": "I'm so excited to listen to Wes talk about the Minnesota Wild for the next few hours",
        "label": "POS"
    },
    {
        "comment": "i think i might be sick",
        "label": "NEG"
    },
    {
        "comment": "Are the Red Wings cursed? I legit feel awful for them.",
        "label": "NEG"
    },
    {
        "comment": "WHAT IS HAPPENING!?",
        "label": "NEG"
    },
    {
        "comment": "I would like for DeBoer to switch up the blue line pairings a little. Miro and Suter are clearly not working for one reason or another (I'm leaning towards the latter being the problem but who knows). We know Lindell and Hakanpaa weren't working well together last year in the playoffs.",
        "label": "NEG"
    },
    {
        "comment": "God damn I love Luongo",
        "label": "POS"
    },
    {
        "comment": "Good goaltending and lots of strong stick checks at both ends.  All around really good hockey from both teams.  I'm glad I got to watch this game, it looks like a fun one.",
        "label": "POS"
    },
    {
        "comment": "Imagine being a working class person spending your money in this economy to watch this shit",
        "label": "NEG"
    },
    {
        "comment": "McDavid is easily the 4th best Connor in the league",
        "label": "POS"
    },
    {
        "comment": "Seeing a happy Panger interviewing a Blackhawk after beating the Blues….😕",
        "label": "NEG"
    },
    {
        "comment": "I can. It's not like we were playing terribly. We were in basically every game. Now we're actually finishing our chances",
        "label": "POS"
    },
    {
        "comment": "9 for 83 on power plays is insane",
        "label": "POS"
    },
    {
        "comment": "Jamie Benn never refills the toilet paper.",
        "label": "NEG"
    },
    {
        "comment": "The boys really felt that this win was coming too smoothly. The heart attacks quota must. be. met.",
        "label": "POS"
    },
    {
        "comment": "Well, someone let one in.",
        "label": "NEG"
    },
    {
        "comment": "Man, I'll take what I can get.",
        "label": "NEU"
    },
    {
        "comment": "I'm so excited about his potential.  It will take longer to reach because he's still a little awkward, but he's so quick for such a rangy mountain.  He was really taking care of things tonight.",
        "label": "POS"
    },
    {
        "comment": "Stützle is reeeeaaaaally fighting it rn",
        "label": "NEG"
    },
    {
        "comment": "Ya looks like he has no confidence",
        "label": "NEG"
    },
    {
        "comment": "Yeah, Miro, you can't do that.",
        "label": "NEG"
    },
    {
        "comment": "That was a stupid ass play by Provorov.",
        "label": "NEG"
    },
    {
        "comment": "Maybe all lines should be in sequence!",
        "label": "NEU"
    },
    {
        "comment": "Ruff cycling 10 forwards. Cool",
        "label": "NEU"
    },
    {
        "comment": "Getting outshot 45 to 20 and winning the game probably isn't sustainable",
        "label": "NEG"
    },
    {
        "comment": "It has to be mental. We look good with the lead, but as soon as there's adversity, we fold like a house of cards. See the LA game earlier this month for another example.",
        "label": "NEG"
    },
    {
        "comment": "THATS THE KINDA FIGHT THAT WINS CUP",
        "label": "POS"
    },
    {
        "comment": "Boneheaded by Jenner bro. He's been horrific tonight.",
        "label": "NEG"
    },
    {
        "comment": "I love Laine too and I want him to get a grip and find his game. I just don't see it happening. I see him being traded which is sad but I understand. He has really grown on me :/.",
        "label": "NEG"
    },
    {
        "comment": "They're gonna lose another like 25 games this year idk how this sub will recover",
        "label": "NEG"
    },
    {
        "comment": "Gonna definitely need a replay of the Cousins slaying that Gub just did",
        "label": "NEU"
    },
    {
        "comment": "A regulation win at home? Sharks are winning the Superbowl this year! What an awesome game. Awesome goaltending on both sides.",
        "label": "POS"
    },
    {
        "comment": "I'm beginning to think Sandin kinda stinks…",
        "label": "NEG"
    },
    {
        "comment": "Why would you do that Ty?",
        "label": "NEG"
    },
    {
        "comment": "He's basically dumped Giavani Smith off the deep end. So much more effective.",
        "label": "POS"
    },
    {
        "comment": "I would have liked to have seen an O'Dogg jersey from the era he played, but those jerseys are super expensive on eBay.",
        "label": "POS"
    },
    {
        "comment": "RANCH DRESSING! Ranch has taken over now that ketchup has retired.",
        "label": "NEU"
    },
    {
        "comment": "We need to give Megna a chance.",
        "label": "POS"
    },
    {
        "comment": "Matthews is a fucking stud. I guess that advice from the coach to “shoot more” is working.Fuck that ending sucked the life out of me.",
        "label": "POS"
    },
    {
        "comment": "Holy shit Bally",
        "label": "POS"
    },
    {
        "comment": "It would be nice to see Garland rewarded with a goal, that pass to Blueger tonight was great though.",
        "label": "POS"
    },
    {
        "comment": "This defensive structure is embarrassing. Even if we did make the playoffs we would struggle to win a game",
        "label": "NEG"
    },
    {
        "comment": "That top line, I like what I'm seeing.",
        "label": "POS"
    },
    {
        "comment": "Demko just out assed Vitek.",
        "label": "POS"
    },
    {
        "comment": "These commentators suck bad!",
        "label": "NEG"
    },
    {
        "comment": "So Richardson in his infinite wisdom starts a shaky goalie, on the road, with half of our top D missing, then has the balls to put a fucking anchor of energy and compete on a line with the one player the Hawks want to see succeed most? I'm starting question some things",
        "label": "NEG"
    },
    {
        "comment": "CAN WE FIRE THE SOUND GUY",
        "label": "NEG"
    },
    {
        "comment": "Rossi sounds like he is faking an accent",
        "label": "NEG"
    },
    {
        "comment": "That and vibes, the most positive of vibes.",
        "label": "POS"
    },
    {
        "comment": "Yeah the score is bad but that's my biggest surprise",
        "label": "NEG"
    },
    {
        "comment": "Way better in action than in the promo shots",
        "label": "POS"
    },
    {
        "comment": "Last year when I was doing a practice closing before our actual mock trial, one of the attorneys giving feedback was named Paul and my whole closing argument comparing what happened in our \"case\" to a hockey fight.  When they started giving us feedback, he told me there was one minute left and I said, \"Thanks Paul!\"  Everybody looked at us like we were insane 😂",
        "label": "NEU"
    },
    {
        "comment": "Wtf was that roughing on kuz.",
        "label": "NEG"
    },
    {
        "comment": "Elvis may have given up 5 goals but the xGA was 5.5. This team can't defend lol",
        "label": "NEG"
    },
    {
        "comment": "Huberdeau: -2, 1 Shot, 1 blown gifted chance\"Solid\"",
        "label": "NEU"
    },
    {
        "comment": "now all the skaters have a goal!!",
        "label": "POS"
    },
    {
        "comment": "That's aiming too low…#WE NEED “LIVE”BACK",
        "label": "POS"
    },
    {
        "comment": "This will be our second",
        "label": "NEU"
    },
    {
        "comment": "I totally agree but I am sure he's asking for it right now",
        "label": "NEU"
    },
    {
        "comment": "Just pull Sammy.  He made a few nice ones on the first but these last 2 were pathetic.",
        "label": "NEG"
    },
    {
        "comment": "The Stars franchise record for goal scoring by Dmen is Boucher with 19. Harley is currently on pace for 20.",
        "label": "NEU"
    },
    {
        "comment": "You mean half this sub lol?",
        "label": "NEU"
    },
    {
        "comment": "Bro lavi better make adjustments cause this period was way worse by the whole team",
        "label": "NEG"
    },
    {
        "comment": "FUCK OFF",
        "label": "NEG"
    },
    {
        "comment": "Zibanejad has prettier hair than some girls I've dated.",
        "label": "POS"
    },
    {
        "comment": "I actively did not turn it back on for this reason haha, guess your powers are stronger than mine",
        "label": "NEU"
    },
    {
        "comment": "“That's your home! ARE YOU TOO GOOD FOR YOUR HOME?! **ANSWER ME!!!**”",
        "label": "POS"
    },
    {
        "comment": "Garland with such a nice pass to Blueger for that second game winning goal.",
        "label": "POS"
    },
    {
        "comment": "Crap",
        "label": "NEG"
    },
    {
        "comment": "I cannot recall one empty net we've hit this year.",
        "label": "NEG"
    },
    {
        "comment": "We don't.",
        "label": "NEG"
    },
    {
        "comment": "Can't even be upset over that loss.  Just another example of refs needing to call majors because if not players will do it their own way and the game goes completely off the rails.  Then again we got to witness a murder and it only cost one person $5000 which is the maximum fine under the current CBA",
        "label": "NEG"
    },
    {
        "comment": "FWIW it's definitely an intentional strategic choice to let the opponents rack up low quality shots from the outside while we turtle and protect the middle to hold a lead. Makes our stats (and PDO) look bad but it's clearly effective all things considered",
        "label": "NEG"
    },
    {
        "comment": "🙏",
        "label": "POS"
    },
    {
        "comment": "holy Moses!",
        "label": "POS"
    },
    {
        "comment": "Sammy vs Woll in OT/Shootouts.  Tell me who you would take.",
        "label": "NEU"
    },
    {
        "comment": "Always strive to be just like Papa Palps",
        "label": "POS"
    },
    {
        "comment": "After the past five minutes or so, that was especially satisfying.",
        "label": "POS"
    },
    {
        "comment": "Making a Crab boil with some friends tonight. Crab legs were super cheap this week.",
        "label": "POS"
    },
    {
        "comment": "I mean in this league its like 50/50 whether or not thats GI",
        "label": "NEU"
    },
    {
        "comment": "Refs are really playing well tonight what a fucking joke fuck the refs absolutely rigged bullshit",
        "label": "NEG"
    },
    {
        "comment": "Why does our dumb fuck coach insist on putting out the 4th line after we score? Instant momentum stopper",
        "label": "NEG"
    },
    {
        "comment": "There's the free breakaway lmao someone play fucking defense Christ",
        "label": "NEG"
    },
    {
        "comment": "We're either dominating or pulling the goalie. What in the hell is this season?",
        "label": "NEG"
    },
    {
        "comment": "BIG CAT TEEING OFF LETS GO",
        "label": "POS"
    },
    {
        "comment": "Kesler yes - Burrows no. But they posted these I think yesterday on the Canucks YouTube page so you can see it there :)",
        "label": "NEU"
    },
    {
        "comment": "ROBO!!! 🤖",
        "label": "POS"
    },
    {
        "comment": "Dude is a game changer every game. You love to see it.",
        "label": "POS"
    },
    {
        "comment": "BONINOBONINOBONINOBONINOBONINOBONINOBONINOBONINOBONINOBONINOBONINOBONINOBONINOBONINO",
        "label": "POS"
    },
    {
        "comment": "What if hammer didn't go got that hip check?",
        "label": "NEU"
    },
    {
        "comment": "I can't wait for Voronkov's first fight.",
        "label": "POS"
    },
    {
        "comment": "If I may, since mdt showed me moneypuck.com, I realy enjoy seeing from where shots are taken against us. Sometimes numbers are high but from far away.",
        "label": "NEU"
    },
    {
        "comment": "I normally don't think about this but I want to see an Islander get absolutely crushed tonight.",
        "label": "POS"
    },
    {
        "comment": "If they're playing a rookie goaltender bet the house.",
        "label": "POS"
    },
    {
        "comment": "No you're thinking of the time your flight was canceled and your family didn't get to go to Disneyland. That was a character building loss.",
        "label": "NEG"
    },
    {
        "comment": "The fucking crosschecks are unreal right now",
        "label": "NEG"
    },
    {
        "comment": "The only thing that makes sense is that Tocchet is so concerned about his defensive play, he doesn't care if he contributes to offence right now. There's no other reason to put him on the 4th line. I'd even argue that it's better to scratch him than play him on the 4th line.Edit: that said, these line projections are from December 9th.",
        "label": "NEU"
    },
    {
        "comment": "Manifesting a Wolf goalie goal bc why not 🐺",
        "label": "POS"
    },
    {
        "comment": "JT scoring a goal with 1 second left before OT to win it for us is my dream scenario tonight. I will settle for a win of any sort.",
        "label": "POS"
    },
    {
        "comment": "Olivier said he was watching the Grinch with his kid at 5:30 and got the call that he was playing tonight. Anyone know what the schedule looks like for scratched players? I assumed they'd already be at the arena by 5:30",
        "label": "NEU"
    },
    {
        "comment": "Stay out of the fucking box and play a 200ft game, it's not rocket science. Also, the game isn't over after the first period.And did I mention, STAY OUT OF THE FUCKING BOX.",
        "label": "NEG"
    },
    {
        "comment": "Lol You don't say bug a boo without quoting Destiny's Child",
        "label": "NEU"
    },
    {
        "comment": "I wanna win this one so bad now",
        "label": "POS"
    },
    {
        "comment": "😬😬😬",
        "label": "NEU"
    },
    {
        "comment": "Hedman may be out today, game time decision.",
        "label": "NEU"
    },
    {
        "comment": "Gonna hurt seeing Quickie in the crease with another jersey on :( also the ending of that rams game was brutal so hopefully this cheers LA on up",
        "label": "NEG"
    },
    {
        "comment": "there was ten seconds left lol",
        "label": "NEU"
    },
    {
        "comment": "Wtf is Middleton doing there",
        "label": "NEG"
    },
    {
        "comment": "What else can you say at this point?Fucking Q, man.",
        "label": "NEG"
    },
    {
        "comment": "Had to dump Lafferty to fit in Reaves and all the culture change.",
        "label": "NEU"
    },
    {
        "comment": "God we look like shit",
        "label": "NEG"
    },
    {
        "comment": "WIN FOR YOUR HONORWIN FOR ERIKWIN FOR AMERICA",
        "label": "POS"
    },
    {
        "comment": "Nah, the real problem is chiclets mushed us.",
        "label": "NEG"
    },
    {
        "comment": "Its funny about halfway through the game I realized: oh shit I barely noticed Zadorov!  Nice!",
        "label": "POS"
    },
    {
        "comment": "So close...",
        "label": "NEU"
    }
]