[
    {
        "comment": "This game is cursed. Ça sent vraiment mauvais.",
        "label": "NEG"
    },
    {
        "comment": "He's doing intermission stuff on Bally for the next few games.",
        "label": "NEG"
    },
    {
        "comment": "Okay we can all just agree Vlad's betrayal just never happened.",
        "label": "NEG"
    },
    {
        "comment": "Thank Mr. Demko",
        "label": "POS"
    },
    {
        "comment": "Welcome back LT, ILY.",
        "label": "POS"
    },
    {
        "comment": "Absolutely carrying the team right now.",
        "label": "POS"
    },
    {
        "comment": "Oilers just got a free minute of warm up for their power play.",
        "label": "NEG"
    },
    {
        "comment": "I was lurking in thie sub earlier, and apparently you can get tickets for 20 CAD, so you can't blame them",
        "label": "NEU"
    },
    {
        "comment": "Almost.....almost!",
        "label": "POS"
    },
    {
        "comment": "Tage has a lane, blind passes to no one.",
        "label": "NEG"
    },
    {
        "comment": "Booooo :(",
        "label": "NEG"
    },
    {
        "comment": "Need a PPG bad",
        "label": "NEG"
    },
    {
        "comment": "FIRST GOAL PARTY",
        "label": "POS"
    },
    {
        "comment": "As a side thought, thank fuck we haven't got any Euro style ad patches on the jerseys yet",
        "label": "NEU"
    },
    {
        "comment": "Can't even be too mad anymore. Just impressive win for the Coyotes",
        "label": "POS"
    },
    {
        "comment": "Is the Seattle ice trash? Lots of people falling randomly on both teams",
        "label": "NEG"
    },
    {
        "comment": "It doesn't get talked about enough but one of my biggest DJ beefs is the lines get put in a blender basically every time we lose a game. Guys don't get a chance to develop chemistry.",
        "label": "NEG"
    },
    {
        "comment": "Not hearing enough boos on my TV when that selfish fuck face who quit on the team and city touches the puck for my liking.",
        "label": "NEG"
    },
    {
        "comment": "Yes, err it means \"Hughes+Hughes\"",
        "label": "NEU"
    },
    {
        "comment": "There was a period of time where we were positive that one of the monitors on the bench floor near Chief was the gdt thread",
        "label": "NEU"
    },
    {
        "comment": "I can't believe I'm gonna watch this crap tomorrow. I must be fucking stupid.",
        "label": "NEG"
    },
    {
        "comment": "Bedard would be 3rd maybe 4th line on the Wild. What a noob",
        "label": "NEG"
    },
    {
        "comment": "Laffy please finish",
        "label": "NEG"
    },
    {
        "comment": "I think the big question is, do we move Tage or Dahlin to afford him?",
        "label": "NEU"
    },
    {
        "comment": "People already gave up again after they scored the first goal lol but they don't actually give up, they still watch every game and meltdown in the comments",
        "label": "NEG"
    },
    {
        "comment": "NJ wasn't the only place he was *rumored* to be interested in. And none of the teams he's was rumored to be interested in got him. Most likely because what Winnipeg wanted in return was ludicrous",
        "label": "NEU"
    },
    {
        "comment": "'faberoubly\" good one",
        "label": "POS"
    },
    {
        "comment": "Laf really needs to start trying to get to the middle of the ice. He's been a perimeter deferrer for a bit now.",
        "label": "NEG"
    },
    {
        "comment": "Damn I go take a shower and come back to this lol",
        "label": "NEU"
    },
    {
        "comment": "Bedard point! Keep em coming!",
        "label": "POS"
    },
    {
        "comment": "Why can't we ever have some right in front of the paint?",
        "label": "NEG"
    },
    {
        "comment": "“Ottawa has been struggling on the pk” Leafs: Hold my beer",
        "label": "NEG"
    },
    {
        "comment": "Shut up Maroon",
        "label": "NEG"
    },
    {
        "comment": "19 games without a goal for MOJO? uff da",
        "label": "NEG"
    },
    {
        "comment": "Love the creativity Zary and Coronato bring when entering the zone. This is our future right here.",
        "label": "POS"
    },
    {
        "comment": "I've watched that back several times and I still don't see how Larkin got hurt.",
        "label": "NEU"
    },
    {
        "comment": "I agree with you. I assumed it was VV until about half way through the 1st- I didn't even check who was in goal because I didn't think there was any chance it was Akira. I'm not saying he's bad, he's just not doing that great now, either. Better than Vitek, though.",
        "label": "NEU"
    },
    {
        "comment": "Draisaitl just dragging defenders behind him, kinda reminds me of young Jagr",
        "label": "POS"
    },
    {
        "comment": "Ottawa seems to “run into a hot goalie” all the time. Especially goalies who are super average",
        "label": "NEG"
    },
    {
        "comment": "He took away the best part of the team and turned them into a sad bunch, Bruce Boudreau is genuinely a good option for the team I think",
        "label": "NEG"
    },
    {
        "comment": "I usually wait until one of them works in our favour to complain about this, but video challenges are ruining this game",
        "label": "NEU"
    },
    {
        "comment": "Addison hasn't been a massive game changer or anything, but he's at least provided a point of difference that we didn't have at the start of the year, and that alone has seemed to free up a lot of our forward group",
        "label": "POS"
    },
    {
        "comment": "DJ should step down out of embarrassment at this point",
        "label": "NEG"
    },
    {
        "comment": "Big Rig nice block!!",
        "label": "POS"
    },
    {
        "comment": "what? looks like that challenge was within the time period. the OT goal in question was a Toronto call. fuck you talking about?",
        "label": "NEG"
    },
    {
        "comment": "fuck you Owen Power",
        "label": "NEG"
    },
    {
        "comment": "6 goals in the fist period? This is gonna be a shootout",
        "label": "POS"
    },
    {
        "comment": "Fresh seafood. Utter despair. A Pickle scorned. And the best Kraut this side of 5th avenenue.",
        "label": "POS"
    },
    {
        "comment": "I'll take it lol",
        "label": "POS"
    },
    {
        "comment": "He is the real shoutout leader as Toc didn't want to shit on the Sharks by taking their lone goal away",
        "label": "POS"
    },
    {
        "comment": "PK has been incredible but come on boys. We gotta string some offensive zone shifts together",
        "label": "POS"
    },
    {
        "comment": "If only we were able to do anything with our PP",
        "label": "NEG"
    },
    {
        "comment": "The first period was definitely the best offensively, but they put up a decent fight in the 2nd as well. We were still close-ish to tied in shots by the end of that one, it was the 3rd where the wheels really came off.",
        "label": "NEG"
    },
    {
        "comment": "We look more tired today than on day 2 of a back to back",
        "label": "NEG"
    },
    {
        "comment": "I'm naming the beef pot roast I'm slow cooking tomorrow The Brodz.",
        "label": "NEU"
    },
    {
        "comment": "Is Zub out of the game?",
        "label": "NEU"
    },
    {
        "comment": "> When's the last time we've been shut out in back to back games? Genuinely can't rememberApparently 12 years ago.",
        "label": "NEG"
    },
    {
        "comment": "I feel like we've been in their zone 99.9% of this period I love it!!",
        "label": "POS"
    },
    {
        "comment": "Yeah, let's put the turnover machine and 4 goal player in the shootout again and again and again.",
        "label": "NEG"
    },
    {
        "comment": "Playing in a college arena, they looked like a college team... community college.",
        "label": "NEG"
    },
    {
        "comment": "I think they know what is going on. Unfortunately we were playing solid defense at the beginning the season before the injuries started.Now with the shuffled lines our 'top' line of Skinner, Mitts, Tuch has been bleeding high danger chances almost every night. Tonight they were 10 against for 3 for. I like Mittlestadt but he isn't top line center quality.On top of that our bottom 6 has been basically useless all season no matter who rotates in and out. They get rolled over almost every single night and get caught out on long desperate shifts due to their complete inability to maintain possession in the offensive zone.",
        "label": "NEG"
    },
    {
        "comment": "His feet aren't fast but damn does he have a beautiful stride. He's keeping his head up while he skates and it's a big change from last year.I don't think he was slow last year, but just winded due to bad conditioning. In fact I think he skates very fast when he wants.",
        "label": "POS"
    },
    {
        "comment": "I have seen his commercials, it was real",
        "label": "NEU"
    },
    {
        "comment": "Niiice.",
        "label": "POS"
    },
    {
        "comment": "NICO, finally a good shift",
        "label": "POS"
    },
    {
        "comment": "yeah, knew they were gonna score that as soon as he started moving",
        "label": "POS"
    },
    {
        "comment": "Oh fuck Otter is hurt now… Godammit",
        "label": "NEG"
    },
    {
        "comment": "I miss Fox Sports West…",
        "label": "NEU"
    },
    {
        "comment": "Tocchet just not willing to provide Kuz with real positive comments in the interview after tonights game. Pisses me off actually. edit: Okay, wrong, he went further on later in the interview about Kuzmenkos play far more positively. Literally posted as listening to it btw.",
        "label": "NEG"
    },
    {
        "comment": "It's kids night there",
        "label": "NEU"
    },
    {
        "comment": "Sorry Darcy, Chuck's the starter now, brother",
        "label": "NEU"
    },
    {
        "comment": "Voronkov domi fight?",
        "label": "NEU"
    },
    {
        "comment": "Oh wow completely missed that news but that makes a lot of sense- was getting a bit worried with how he'd been playing. This new or known a couple games ago? Jw",
        "label": "NEU"
    },
    {
        "comment": "Is it how the Rangers are coached just not meshing with how this Ref likes to run faceoffs?I can't remember the last time I've seen us get kicked out so often. I suppose there's been quite a bit of simultaneous ejections as well...",
        "label": "NEG"
    },
    {
        "comment": "And now the Seahawks choking.  Fuck I hate Dallas and Vegas. Fuck off AS ending cities.",
        "label": "NEG"
    },
    {
        "comment": "Few bad bounces but honestly we had SO many defensive coverage breakdowns that just cannot happenPoor demmer",
        "label": "NEG"
    },
    {
        "comment": "Imagine being the posters who threw in the towel 5 minute ago.",
        "label": "NEU"
    },
    {
        "comment": "Who's gonna stop you?",
        "label": "NEU"
    },
    {
        "comment": "I think it's really just about the 3rd period collapse. No matter the opponent, huge lead or tie game, we can't seem to come out with any urgency in the 3rd and it can linger the whole period sometimes. Last few shifts look like we waked up.",
        "label": "NEG"
    },
    {
        "comment": "Wow another quick one!",
        "label": "POS"
    },
    {
        "comment": "Odds are set by the market.  If more people think Carolina will win, for whatever reason, the odds will shift that way. Basically they're not fixed and they're not set forever after probably an initial seeding.",
        "label": "NEU"
    },
    {
        "comment": "That's like not even Trochecks fault",
        "label": "NEU"
    },
    {
        "comment": "We stayed pretty much within 1 goal of the #1 power ranked team going into December.",
        "label": "POS"
    },
    {
        "comment": "No it was 14-15. He had 26 in 13-14.",
        "label": "NEU"
    },
    {
        "comment": "Did Myers just backhand that to the front of the net?",
        "label": "NEG"
    },
    {
        "comment": "i've never believed in anything more than i believe in jeek 30 goal scorer",
        "label": "POS"
    },
    {
        "comment": "First career assist for Wolf today.",
        "label": "POS"
    },
    {
        "comment": "I feel like a lot of people on this sub don't realize that even the very best teams in the league still lose 1/3 of their games in a season. We're going to lose a lot, but that doesn't mean we're a bad team.",
        "label": "POS"
    },
    {
        "comment": "Kings of the road",
        "label": "POS"
    },
    {
        "comment": "So disrespectful of Demko to show up Luongo on his night",
        "label": "NEG"
    },
    {
        "comment": "THATS A GOAL",
        "label": "POS"
    },
    {
        "comment": "Basically the only time I heard “let's go flyers” chants was when the “let's go devils” chants got going.",
        "label": "NEG"
    },
    {
        "comment": "Bedard needs a haircut",
        "label": "NEU"
    },
    {
        "comment": "I didn't think the team played particularly well, but it's amazing how it feels we've completely levelled up. Us not playing particularly well is now ‘solid' and can close out games, vs the old not playing particularly well and it being a complete dumpster fire. Huge step up in our floor of performance",
        "label": "POS"
    },
    {
        "comment": "Calgary is just playing much better than us",
        "label": "NEG"
    },
    {
        "comment": "Players got points and the Flames lose. Ideally the best outcome if you're on team tank",
        "label": "NEG"
    },
    {
        "comment": "Now that was a hard working power play unit",
        "label": "POS"
    },
    {
        "comment": "Oh man that's like a no contact tweak 😫",
        "label": "NEG"
    },
    {
        "comment": "On our own net?",
        "label": "NEG"
    },
    {
        "comment": "I'd be surprised if we don't go get a goalie this weekend. This has to be the last straw",
        "label": "NEG"
    },
    {
        "comment": "LETS GOOOOOO",
        "label": "POS"
    },
    {
        "comment": "i just HATE whe players take a direct shot at goalie during shootouts without anything added to it, let alone wheb 3 in a row do it",
        "label": "NEG"
    },
    {
        "comment": "Need more from our top players honestly",
        "label": "NEG"
    },
    {
        "comment": "So…. Close……",
        "label": "NEU"
    },
    {
        "comment": "So it's a penalty to get punched in the face. Sick.",
        "label": "NEG"
    },
    {
        "comment": "I'm just watching to see them get boo'ed at this point. It's oddly satisfying.",
        "label": "NEG"
    },
    {
        "comment": "Sharks just passed us in the standings and have been playing pretty good. I think we got last place on lock this year",
        "label": "POS"
    },
    {
        "comment": "Rob is a WNY treasure. “It felt good. Give me a stick!”",
        "label": "POS"
    },
    {
        "comment": "Miller has two open options but passes right to Kucherov lmao",
        "label": "NEG"
    },
    {
        "comment": "I picked a rough week to take a break from drinking",
        "label": "NEG"
    },
    {
        "comment": "Just one of those nights where we look slow and old",
        "label": "NEG"
    },
    {
        "comment": "Absolutely huge PP here",
        "label": "POS"
    },
    {
        "comment": "praying to the hockey gods for a rossi hatty",
        "label": "NEU"
    },
    {
        "comment": "Hey buddy, it's gonna fix it",
        "label": "NEU"
    },
    {
        "comment": "Man, I'm way too susceptible to Buffalo hopium.  Give me just a little bit and I'll snort that shit like a wall street frat boy, then I get dutch oven'd again.",
        "label": "NEG"
    },
    {
        "comment": "Atrocious call and DJ is silent",
        "label": "NEG"
    },
    {
        "comment": "Geez, talk about a dominant opening 4 minutes",
        "label": "POS"
    },
    {
        "comment": "yeah.kuemps.yikes.",
        "label": "NEG"
    },
    {
        "comment": "Myers and Cole are awful.",
        "label": "NEG"
    },
    {
        "comment": "Man, don't leave Barzal open dude.    Come on boys.",
        "label": "NEG"
    },
    {
        "comment": "Once we go to 8 feet wide nets we're gonna be awesome",
        "label": "NEG"
    },
    {
        "comment": "Miles and miles of heart",
        "label": "POS"
    },
    {
        "comment": "VIKINGS AND WILD FANBASES RN 🤝",
        "label": "POS"
    },
    {
        "comment": "Simon Nemec is so freakin cute",
        "label": "POS"
    },
    {
        "comment": "...I don't know? Ask Pascal Vincent. Probably because we want more experienced people there.",
        "label": "NEU"
    },
    {
        "comment": "need to buy etsys entire stock of dallas stars prayer candles",
        "label": "NEU"
    },
    {
        "comment": "Even though we still kinda suck - you can tell we're getting some chemistry going now that the lineup has been half assed stable for a week or so…. also noticeable scheme changes (no more dumping back at the blue line and more aggressive with D-men pinching in on the boards) so shout out to Richardson for changing things up.",
        "label": "POS"
    },
    {
        "comment": "the mitts are silky",
        "label": "NEG"
    },
    {
        "comment": "Wow this is a cursed game. Barron injured now, too?",
        "label": "NEG"
    },
    {
        "comment": "All I'm saying is, if you gave me the reins of this organization 13 years ago, I would've managed the team well enough to make the playoffs at least once since then.",
        "label": "NEG"
    },
    {
        "comment": "The stupid Flames wearing our own jerseys in front of us like they came up with it. What's with these people?",
        "label": "NEG"
    },
    {
        "comment": "Yup, first big measuring tape game today and we failed absolutely miserably.Can't wait to see how we stack up against LA too.We're running out of the easy schedule.",
        "label": "NEG"
    },
    {
        "comment": "Were the other teams even trying?",
        "label": "POS"
    },
    {
        "comment": "I DONT CARE WHAT ANYONE SAYS DEMKO IS THE BEST GOALIE IN THE LEAGUE",
        "label": "POS"
    },
    {
        "comment": "I legit laughed out loud. I try to make a point of telling people when I do that so they know they hit. Nailed it!",
        "label": "NEU"
    },
    {
        "comment": "Didn't Akira just let in 6 goals on 18 shots?",
        "label": "NEG"
    },
    {
        "comment": "His shot isn't the same. He's missing on breakaways, shootouts, and wide open looks he never used to miss.",
        "label": "NEG"
    },
    {
        "comment": "ATTA BOY JOSHY",
        "label": "POS"
    },
    {
        "comment": "We have to get a goal at some point on the PP right?",
        "label": "NEG"
    },
    {
        "comment": "Pivotal moment in the game.",
        "label": "POS"
    },
    {
        "comment": "The Slaf haters have gotten *really* quiet the past couple of weeks.",
        "label": "POS"
    },
    {
        "comment": "Some classic chaos giraffe centering it on the PK",
        "label": "NEG"
    },
    {
        "comment": "It's a high sticking cal but that embellishment is embarrassing",
        "label": "NEG"
    },
    {
        "comment": "When the shots are 33-17 but the score is 0-4: ***STONKS***",
        "label": "POS"
    },
    {
        "comment": "Back to back Florida teams so hope we can win at least one of them. It's be great if we get one on the inconsistent Lightning or against the Panthers on Luongo night",
        "label": "NEU"
    },
    {
        "comment": "Now that's exactly why we brought him in",
        "label": "POS"
    },
    {
        "comment": "Hope Larkin is ok that was scary. Wouldn't be surprised for us to get penalized for what happened. Just hope Larkin is gonna be alright.",
        "label": "NEU"
    },
    {
        "comment": "This feels trap-like but for the fact that the Sharks are atrocious. Yeah they just beat the Devils but a) the Devils aren't really that good and b) they were outshot like 50-20. Just chill and play our game and the good result will come.",
        "label": "NEG"
    },
    {
        "comment": "11 is not living up to the C so far tonight.",
        "label": "NEG"
    },
    {
        "comment": "Sabres hockey says we will lose this game. So let's play something else tonight!",
        "label": "NEG"
    },
    {
        "comment": "I just feel it's my duty here to say frick yeah go Wes. I appreciate him. May be unpopular here but I'm here for Walz.",
        "label": "POS"
    },
    {
        "comment": "YESSSS LET'S GO",
        "label": "POS"
    },
    {
        "comment": "So fun. Definitely take the opportunity if it ever turns up.",
        "label": "POS"
    },
    {
        "comment": "thats on schmid",
        "label": "NEG"
    },
    {
        "comment": "VETERAN PRESENCE",
        "label": "NEU"
    },
    {
        "comment": "Wow they really did it",
        "label": "POS"
    },
    {
        "comment": "Sometimes I miss those sweet Romanov hits",
        "label": "NEU"
    },
    {
        "comment": "On the night for Luongo bob pulls off one of the worst pieces of goal tending I've seen in a bit, is that ironic or poetic?",
        "label": "NEG"
    },
    {
        "comment": "Plays like jost. I like it",
        "label": "POS"
    },
    {
        "comment": "Dallas is no joke, they've got some some pretty big time players themselves. With a goalie like Oettinger back there, its going to be a tough one",
        "label": "POS"
    },
    {
        "comment": "If yall would actually watch plays develop, that's more on Seguin  for losing his man not suter fully.",
        "label": "NEG"
    },
    {
        "comment": "Time to get scored on",
        "label": "NEG"
    },
    {
        "comment": "Welp, that was a long drive to watch that disaster.I was asked by a friend what they think would happen if an OHL team played one of the worst NHL teams.There's their answer. :/",
        "label": "NEG"
    },
    {
        "comment": "The comeback kids gonna make “Ring of Fire” number 1 on my Spotify wrapped next year. I fucking love the young guns we haveThe holy water celebration?? I'm in love",
        "label": "POS"
    },
    {
        "comment": "I don't like reverse retro. It's that yellow band...the only nice thing is that the background for the A and the C is Minnesota outline.",
        "label": "NEU"
    },
    {
        "comment": "Bruh wtf is going on with the skate blades this year",
        "label": "NEG"
    },
    {
        "comment": "I'm not giving up yet, but the point stands.",
        "label": "NEU"
    },
    {
        "comment": "Kyrou better be fucking flying tonight",
        "label": "NEG"
    },
    {
        "comment": "Middleton, Maroon, Dewy, I still see some heads on those Calgary jerseys…",
        "label": "NEU"
    },
    {
        "comment": "Dave and Shane are not superstitious huh.",
        "label": "NEU"
    },
    {
        "comment": "Huby and Coleman sold",
        "label": "NEG"
    },
    {
        "comment": "Bedard is so much fun to watch. He just makes things happen no matter what.",
        "label": "POS"
    },
    {
        "comment": "Shesty should play against Anaheim for a “get-right” game but quick 100% deserves the start against Boston.",
        "label": "POS"
    },
    {
        "comment": "God. Damn. He is insane.",
        "label": "POS"
    },
    {
        "comment": "Rangers came off a back to back too. They have the more skilled players and size. We have depth but if a leg gives out then we struggle.",
        "label": "NEU"
    },
    {
        "comment": "What's more likely to be what they are? A 15 game heater or the previous three seasons?Might be time to realize they are what they are.",
        "label": "NEU"
    },
    {
        "comment": "I say it every game, I seriously feel BAD for sodes.  He's just not got it and they keep throwing him the wolves.  He's got to be totally dejected.",
        "label": "NEG"
    },
    {
        "comment": "He's a great person but his staff and system are complete ass water",
        "label": "NEG"
    },
    {
        "comment": "I cant wait to win 5-3 and then lose to the Yotes tomorrow",
        "label": "NEG"
    },
    {
        "comment": "Overtime would have been so much fun with all 3 Hughes on the ice",
        "label": "NEU"
    },
    {
        "comment": "Instigator for Zibanejad here I assume?Edit: hey look!",
        "label": "NEU"
    },
    {
        "comment": "I think that might have hit mercers stick too",
        "label": "NEU"
    },
    {
        "comment": "I don't like this at all.",
        "label": "NEG"
    },
    {
        "comment": "kyrou showed up tonight.",
        "label": "POS"
    },
    {
        "comment": "“Fans”",
        "label": "NEG"
    },
    {
        "comment": "You certainly have more patience than the rest of us. What's the secret?",
        "label": "NEG"
    },
    {
        "comment": "True that line is brutal",
        "label": "NEG"
    },
    {
        "comment": "NICO MY HORSE <3",
        "label": "POS"
    },
    {
        "comment": "Winning is fun!",
        "label": "POS"
    },
    {
        "comment": "That's a shame.  Damn… never got the puck.",
        "label": "NEG"
    },
    {
        "comment": "PP as expected",
        "label": "NEU"
    },
    {
        "comment": "Is it just me or is the crowd audio way loud? I dont remember another game with so much crowd noise... are they that loud or is the tv mix off?",
        "label": "NEU"
    },
    {
        "comment": "came to ask same. fucking roku stream channel?!",
        "label": "NEU"
    },
    {
        "comment": "If Dewar can get 3 (4) goals in a night with effort and a can do personality anybody can!",
        "label": "POS"
    },
    {
        "comment": "Let's end this recent skid. Losing 3 of the last 4 is enough, thanks.",
        "label": "NEG"
    },
    {
        "comment": "There production is down pretty much across the board this season.",
        "label": "POS"
    },
    {
        "comment": "FUCK <S>YOU</S> YEAH SHORESY",
        "label": "POS"
    },
    {
        "comment": "MAY HOGGY NEVER GO BACK TO ABBY",
        "label": "POS"
    },
    {
        "comment": "Can't blame Igor...these guys are playing like balls",
        "label": "NEG"
    },
    {
        "comment": "not grit 😭 yeah hartzy with the deweys could also work, just anything that isn't what it was pre suspension",
        "label": "NEG"
    },
    {
        "comment": "It's good to get the W but let's not forget reality and get carried away with it all.",
        "label": "NEU"
    },
    {
        "comment": "Nah, they will go on a run in January and February, make it look like we are gonna make the playoffs, then lose all the important games the rest of the way missing the playoffs by 2 points. Staios and the New GM will say DJ has earned another chance without injuries, then boom rinse and repeat.",
        "label": "NEG"
    },
    {
        "comment": "The team also is tied for 2nd in regulation losses this season. Only 6 regulation losses. Thats impressive in its own right.",
        "label": "POS"
    },
    {
        "comment": "Put Vejmelka on waivers and get somebody else to back up Ingram. This is pathetic.",
        "label": "NEG"
    },
    {
        "comment": "YAAAAAAAAAA HE MCCANNNNN",
        "label": "POS"
    },
    {
        "comment": "Just tuning in to make sure my boys are having a good time playing with their friends :D",
        "label": "NEU"
    },
    {
        "comment": "St. Louis just fired berube, they're not trending well",
        "label": "NEG"
    },
    {
        "comment": "Fuck yea McCann. Show em what the fuck is up",
        "label": "POS"
    },
    {
        "comment": "This is the softest team I've ever seen. My 24 year old goat head captain Peca jersey is crying in my closet.",
        "label": "NEG"
    },
    {
        "comment": "The secret is to tell them they stole his chew from the locker room.",
        "label": "NEG"
    },
    {
        "comment": "Browns on one tv jackets on PC, let's go!!!",
        "label": "POS"
    },
    {
        "comment": "Evander Kane is a garbage human being",
        "label": "NEG"
    },
    {
        "comment": "And just like that they jump from 6th place into a playoff spot.",
        "label": "POS"
    },
    {
        "comment": "Fold the team",
        "label": "NEG"
    },
    {
        "comment": "Oh this is fun you guys!!!! Aren't you having fun.....Because I'm sure having fun!",
        "label": "NEG"
    },
    {
        "comment": "Is it just me or did even Forsberg laugh and smile when he looked and saw Troch's other hand went right into Parssinen's mug?",
        "label": "NEU"
    },
    {
        "comment": "I'd still start Jones next game. Sammy wasn't awful, but it's evident you're probably going to be getting average goaltending from both guys.",
        "label": "NEG"
    },
    {
        "comment": "He's had a lot of defensive mistakes but is putting up points. I'm not really worried about it. Outside of Juulsen basically everyone looked decent on defence last night. I think as you take away more of his excess minutes and the pairs stop being such a blender Hronek will start looking better as well. It's hard to look good when you're playing so many minutes and all taking turns trying to babysit one of Friedman or Juulsen.",
        "label": "NEU"
    },
    {
        "comment": "On to the next one.  What a comeback.  Twice. Im proud of the buds",
        "label": "POS"
    },
    {
        "comment": "Fuck sakes couldn't even get a chance with the 6 on 5",
        "label": "NEG"
    },
    {
        "comment": "They're always the most boring games too! I hope this game is different because our last game was boring as hell as well.",
        "label": "NEG"
    },
    {
        "comment": "Bruh, you can't stop big Z when he's coming LOL",
        "label": "POS"
    },
    {
        "comment": "Power is such a fucking wuss. Dude is just standing there with a vacant look on his face while a kid is involved in some drama.",
        "label": "NEG"
    },
    {
        "comment": "Does anyone know of any fan surveys I can fill out? I want to voice my frustrations with this team without just venting or ranting to my poor STH reps.",
        "label": "NEG"
    },
    {
        "comment": "Alright that's the 100th mention of their shitty PP. Basically guaranteeing they score on the penalty.",
        "label": "NEU"
    },
    {
        "comment": "Man Hoglander is such a hard worker. That chance was all due to his effort.",
        "label": "POS"
    },
    {
        "comment": "this season is really killing me.",
        "label": "NEG"
    },
    {
        "comment": "HELLO FELLOW KIDS. My curling team beat the grumpy old men tonight (those guys can make our silly ice game decidedly un-fun). The migraine I had all day seems to be receding. Let's add a VGK win to the “good things about this Monday” list.",
        "label": "NEU"
    },
    {
        "comment": "Pain level intensifies with this PK fail.",
        "label": "NEG"
    },
    {
        "comment": "On pace to tie actually. Maybe they'll both win 3-0?",
        "label": "NEU"
    },
    {
        "comment": "I was just saying he's been so enthusiastic for all the other guys' kids, was super happy to see him get to celebrate his own!",
        "label": "POS"
    },
    {
        "comment": "Love the way Zad bullies players on the crease. We haven't had someone that does that in way too long",
        "label": "POS"
    },
    {
        "comment": "Bedard's 1st NHL Career BRAZIL",
        "label": "NEG"
    },
    {
        "comment": "fuck nodak  fuck denver",
        "label": "NEG"
    },
    {
        "comment": "Not normally, but if you were to sign him in Sweden vs signing him this week there's no question he's lost leverage, not to say he can't go back on the upswing.",
        "label": "NEG"
    },
    {
        "comment": "The worst part about this is how utterly unsurprising it is. It takes a good team playing how they should to show you how good we really are...which is to say, not at all",
        "label": "NEG"
    },
    {
        "comment": "I keep tuning in from my Mexican vacation and we lose the lead every time. I'll stop watching. You're all welcome",
        "label": "NEG"
    },
    {
        "comment": "Pearson hasn't scored in over a month now correct?",
        "label": "NEG"
    },
    {
        "comment": "🤞 it's just one bad period 🤞",
        "label": "NEG"
    },
    {
        "comment": "god wes shut the fuck up about the 3am thing.",
        "label": "NEG"
    },
    {
        "comment": "BRICK WOLL",
        "label": "POS"
    },
    {
        "comment": "Get off the ice, Wheeler, you pylon",
        "label": "NEG"
    },
    {
        "comment": "All heck breaks loose!",
        "label": "NEG"
    },
    {
        "comment": "Parsnips waited too long on that one",
        "label": "NEG"
    },
    {
        "comment": "Doesn't matter he doesn't have anyone that can hit a 1T.",
        "label": "NEG"
    },
    {
        "comment": "Can we just give Vatrano someone else's jersey and keep him on our team and hope no one notices?I love his shoot-like-your-life-depends-on-it mentality 😆",
        "label": "NEG"
    },
    {
        "comment": "Savard should just show video of how quickly and efficiently the avs move the puck on the PP",
        "label": "NEU"
    },
    {
        "comment": "The guys over at CHGO said they'd hate to see Reichels ceiling being a good 4th line player but honestly gun playing with checking forwards like Reese Johnson and Entwhistle may be what's best for him.",
        "label": "POS"
    },
    {
        "comment": "How did they disrespect him? Both teams were playing competitive.",
        "label": "NEU"
    },
    {
        "comment": "What does Palat do here?",
        "label": "NEG"
    },
    {
        "comment": "Looking fast again tonight.",
        "label": "POS"
    },
    {
        "comment": "Why would two defenders go for one guy so dumb",
        "label": "NEG"
    },
    {
        "comment": "Gotta be honest, don't think we're making the playoffs.",
        "label": "NEG"
    },
    {
        "comment": "They look even more shiny in person. Kinda love it!",
        "label": "NEU"
    },
    {
        "comment": "To the dude in the game thread who called the hat trick. I'm sorry I doubted you.",
        "label": "POS"
    },
    {
        "comment": "This team is a joke. These players cannot be as bad as they are playing together",
        "label": "NEG"
    },
    {
        "comment": "Oof.  You'd like to see that saved. Not one that should have gone in.",
        "label": "NEG"
    },
    {
        "comment": "jack has scored two points or more in a majority of his games this year. he's played in 18 games.",
        "label": "POS"
    },
    {
        "comment": "Damn that was vintage Quick",
        "label": "POS"
    },
    {
        "comment": "Yeah, I don't get this \"this isn't how they want to play\" talk at all. You have one of the youngest, fastest teams in the league. Open it up! We have goalies who like taking shots",
        "label": "NEU"
    },
    {
        "comment": "How the fuck did that not go in.",
        "label": "NEG"
    },
    {
        "comment": "Really needed a ppg there",
        "label": "NEG"
    },
    {
        "comment": "Can we do something about these refs? Serious question. I feel like this is an issue across all Fandoms. Maybe we can do something.",
        "label": "NEG"
    },
    {
        "comment": "Kill the penalty, tie up the game, and always go full bingo bango bongo.",
        "label": "NEU"
    },
    {
        "comment": "What's the goalie supposed to do there? Not try to make the save?",
        "label": "NEG"
    },
    {
        "comment": "Lol at that penalty, but shit, I am ready to dissapointed",
        "label": "NEG"
    },
    {
        "comment": "Sounds like coping to me… “flu is still ripping through the team”",
        "label": "NEG"
    },
    {
        "comment": "Ah yes. William Borgen.",
        "label": "NEU"
    },
    {
        "comment": "I think the proper term is “cluster fuck”",
        "label": "NEG"
    },
    {
        "comment": "Hopefully their new game excitement rubs off and you can enjoy the game regardless of the score.",
        "label": "NEU"
    },
    {
        "comment": "Myers: Ten seconds left in the period. On the PK. I have the puck in the corner. Should I:a) Squeeze it into the boards and kill the clockb) Make the safe play around the side wallc) Literally do anything except dd) Throw a blind backhand pass directly at Demko's feet",
        "label": "NEG"
    },
    {
        "comment": "What's wrong with being a Joey fan?",
        "label": "NEU"
    },
    {
        "comment": "Gotta get someone to the front of the net. No one has been anywhere near any of the rebounds.",
        "label": "NEG"
    },
    {
        "comment": "I swear to God if they blow it in the last 2 minutes I've never watching this team again!",
        "label": "NEG"
    },
    {
        "comment": "Team's playing with no heart. Ntm happens relying on depth players to take the reigns",
        "label": "NEG"
    },
    {
        "comment": "Love Nemec, it takes some real confidence to see Brendan Smith and go \"theres a scoring chance\" and then *almost make it fucking happen*",
        "label": "POS"
    },
    {
        "comment": "I like kuzmenko on the next bus out of town.",
        "label": "NEG"
    },
    {
        "comment": "Score 4? Okay, that's good enough, right? Good luck out there Jonesy!",
        "label": "NEG"
    },
    {
        "comment": "It is pretty creative we got around the “no themed uniforms in warmups” rule by just having players wear them to the arena.",
        "label": "NEG"
    },
    {
        "comment": "GG guys, can't wait to go up by 3 to still lose this one",
        "label": "NEG"
    },
    {
        "comment": "Dang...shoulda been a goal",
        "label": "NEG"
    },
    {
        "comment": "I made a prediction earlier that Caps-Stars would go to a shootout and the devils game would start at 10:52EST",
        "label": "NEU"
    },
    {
        "comment": "refs hate the Preds forever and always",
        "label": "NEG"
    },
    {
        "comment": "One of those wins, the Devils 😏",
        "label": "POS"
    },
    {
        "comment": "Can we acknowledge how awful Shitcago handled that 3 on 1. Fuckin losers.",
        "label": "NEG"
    },
    {
        "comment": "The panel is once again going to be muted for extremely loud Motörhead",
        "label": "NEG"
    },
    {
        "comment": "Pretty empty arena it looks like, doesn't it?",
        "label": "NEG"
    },
    {
        "comment": "Happy for Tarasenko. Nice to see him getting goals lately.",
        "label": "POS"
    },
    {
        "comment": "Exactly my thought… shit!!",
        "label": "NEG"
    },
    {
        "comment": "Despite some of Robo's shortcomings so far this season, dude is cash money in the shootout. He's been using the same move his whole career and still makes goalies look like practice squad with that shot.",
        "label": "POS"
    },
    {
        "comment": "Pretty sure everyone in the R/hockey GDT is gonna get 10 min major.",
        "label": "NEG"
    },
    {
        "comment": "He WAS a dynamic 30 goal scoring power forward. I'm not sure why he hasn't been that here he's in what should be the prime of his career and he has all the skills. He looks like he's skating in wet concrete now and makes the wrong decision with the puck almost every single time. It's getting real old",
        "label": "NEG"
    },
    {
        "comment": "Maybe we should change the team name to the Buffalo Apathetics",
        "label": "NEG"
    },
    {
        "comment": "In my opinion no one's job on this team should be safe. Seattle really needs to step it up this is pathetic. It's not bad luck guys it's lack of quality.",
        "label": "NEG"
    },
    {
        "comment": "The Habs are top notch when it comes to pomp and circumstance.",
        "label": "POS"
    },
    {
        "comment": "I'll see you guys for the next game.",
        "label": "NEU"
    },
    {
        "comment": "The least surprising thing to ever happen lol. Very on brand for AZ sports to be the one that ends the Pens PP goalless streak",
        "label": "NEG"
    },
    {
        "comment": "Get in there boys! Huge win that, the flames have been in good form and so it was imperative we take the two points in normal time.One of Peteys better games of recent times. Let's get on a roll again!",
        "label": "POS"
    },
    {
        "comment": "Can't score if you don't ever shoot",
        "label": "NEG"
    },
    {
        "comment": "I really never realized that everyone on Florida was such a pussy that played like dirty bitches. Very eye opening",
        "label": "NEG"
    },
    {
        "comment": "THAT'S A FUGGIN DUB Y'ALLOffense didn't come to play and there's still possession and passing issues, but defense showed up for onceSCHMID IS HIMSIMON NEMEC IS A NEW JERSEY DEVILFRIENDSHIP CONTINUES WITH POST*OH BOY CANG WHAT A GAME*",
        "label": "POS"
    },
    {
        "comment": "Cooley threw the biggest pissy fit when he got thrown out of that faceoff just now lmao",
        "label": "NEG"
    },
    {
        "comment": "This night has been fucking abysmal",
        "label": "NEG"
    },
    {
        "comment": "bench mang for the 1st so he can figure his shit out",
        "label": "NEG"
    },
    {
        "comment": "Lol, Moore with the \"you got the apple?!\" to Talbot at the end there.",
        "label": "NEU"
    },
    {
        "comment": "Yeah they aren't winning this game. Cant even get a fucking shot on net.",
        "label": "NEG"
    },
    {
        "comment": "Carbery should've of benched Kuzy long before the middle of 3rd imo..",
        "label": "NEG"
    },
    {
        "comment": "Do we have the worst luck in the league",
        "label": "NEG"
    },
    {
        "comment": "Slaf is a beast",
        "label": "POS"
    },
    {
        "comment": "Nice 1st period boys. Yams are in this holiday season!",
        "label": "POS"
    },
    {
        "comment": "Some up the road at Microsoft low key fucking with the Ballys stream",
        "label": "NEU"
    },
    {
        "comment": "Gotta believe Quinn really wants this one.",
        "label": "POS"
    },
    {
        "comment": "Would hope for a better performance than last night, but back to backs against Jersey? Idk.",
        "label": "NEU"
    },
    {
        "comment": "Tommer has come back full beast mode.",
        "label": "POS"
    },
    {
        "comment": "I'm pretty sure Hynes is a sith lord... He scares me way more than Dean",
        "label": "NEU"
    },
    {
        "comment": "Yes, empty net. You know... to give them a chance... at double digits.",
        "label": "NEG"
    },
    {
        "comment": "I feel physically ill saying this but my god Jack…too many turnovers my boy!",
        "label": "NEG"
    },
    {
        "comment": "My best memories were when we booed this song",
        "label": "NEU"
    },
    {
        "comment": "Singh isn't good. I'm all for inclusion, but the person needs to be good or at least get better over the years...",
        "label": "NEG"
    },
    {
        "comment": "Binner is definitely on tonight",
        "label": "POS"
    },
    {
        "comment": "Holy shit we won a challenge? Am I on drugs?!",
        "label": "POS"
    },
    {
        "comment": "At least Toscala can claim that he let in the unlikeliest goal ever scored. In true Leafs fashion. - And I saw it live on tv. 🤦🏻‍♂️",
        "label": "NEG"
    },
    {
        "comment": "Finally figured out who the Anaheim coach reminds me of...",
        "label": "NEU"
    },
    {
        "comment": "I really think getting Zadorov + the return of Soucy and Suter will go a long way. I also think Allvin is not done making moves so I'm hopeful that there will be other improvements to the team. The team still has a good record so I don't think it's time to panic just yet, but they definitely need to get a stretch in here where they string some wins together.",
        "label": "NEU"
    },
    {
        "comment": "Cement mitts there bonino lol",
        "label": "NEG"
    },
    {
        "comment": "I don't agree with the boos, but I have to point this out: Our fans booed Ryan O'Reilly for not sticking with the team. Islanders fans are doing the same thing to JT.Personally, I think they should have let it go and appreciated his achievement tonight. Would we have done the same for O'Reilly?This doesn't need to be a conversation. Boo or don't boo, or maybe cheer if it's appropriate. It is what it is and NY fans are no different from us. (I actually think we have more in common with NY folk than with most cities, but that's just me.)",
        "label": "NEU"
    },
    {
        "comment": "Maybe it's time to put Survivor on instead. This is gonna be an ugly trap game.",
        "label": "NEG"
    },
    {
        "comment": "That's what happens when you turn the puck over everytime you fucking touch it.",
        "label": "NEG"
    },
    {
        "comment": "Ok Murph, you know what's gotta be done… get to it….",
        "label": "NEU"
    },
    {
        "comment": "Dakota Joshua getting shifts on the last minutes of this game speaks volume about the trust he has from Tocchet. You guys see his board play in the last minute? Nothing cute, just wedged his body in there and kept the puck stuck to the boards to kill time and tire out the Csnes. Next he gets a block (shaft deflection) on the Canes last shot at temp off the face off with seconds left. He probably won't get a star tonight but he's deserving of one. Garland aldd also. Go Canucks!",
        "label": "POS"
    },
    {
        "comment": "Didn't even bother with the game yesterday. It was a busy day at home, went to the gym, didn't exactly avoid the game on purpose but man am I ever happy I didn't watch.  I'll try to watch the Kraken game. Seems unfathomable that only Pierre Dorion has been let go so far. Staios was on a hiring streak, adding a new person every week, no idea what the hold up is at all here. Make some sort of change, bring in a sports psychologist, something.",
        "label": "NEG"
    },
    {
        "comment": "How many more trades with the flames until we become the Fanucks",
        "label": "NEG"
    },
    {
        "comment": "Well it's been a wild ass game but I'm having at least",
        "label": "NEU"
    },
    {
        "comment": "Shoooooooooooooot",
        "label": "NEU"
    },
    {
        "comment": "Fuck it, fire DJ mid game at this point.",
        "label": "NEG"
    },
    {
        "comment": "When Akira is on he's ON",
        "label": "POS"
    },
    {
        "comment": "Yeah I didnt like that either. Nylander was completely taxed and you could see it. Still doesn't excuse his giveaway but it didnt help",
        "label": "NEG"
    },
    {
        "comment": "we have them right where we want them",
        "label": "POS"
    },
    {
        "comment": "Where do I view post game interviews live?",
        "label": "NEU"
    },
    {
        "comment": "If they ever figure out that what they are doing on the PP isn't working and fix that then holy they will be a complete team for the first time in a while.",
        "label": "POS"
    },
    {
        "comment": "17-4 shots on goal 4:44 left in the first what the fuck lmao what team put on the Sabres jerseys today",
        "label": "NEG"
    },
    {
        "comment": "Wedgewood is 91.1% even though he gets shot at significantly more than Otter",
        "label": "NEU"
    },
    {
        "comment": "BOGO IS BACK!!",
        "label": "POS"
    },
    {
        "comment": "Conor Garland approves",
        "label": "NEU"
    },
    {
        "comment": "This is the gold standard, this is where we want to be. I know we got trucked, but I hope they look back at this game and remember what it takes to be a contender. And how much work is still needed.",
        "label": "POS"
    },
    {
        "comment": "Darcy is on edibles or some shit wtf",
        "label": "NEG"
    },
    {
        "comment": "There's a clear difference between Woll and Sammy during OT/Shootouts.    There are no OT/Shootouts in the Playoffs but we need to win regular season games too.",
        "label": "NEU"
    },
    {
        "comment": "Oh did we think this was going to be a worriless game?",
        "label": "NEG"
    },
    {
        "comment": "Can't wait for McDonald to score his third less than 3 minutes into the third",
        "label": "NEG"
    },
    {
        "comment": "Oh fuck you Ottawa. Jesus fuckin Christ. Grip your fucking sticks, play to the whistle, and stop throwing your hands up and crying because the refs aren't bailing you out.God damn they drop their sticks on any contact. Start calling that for embellishment.",
        "label": "NEG"
    },
    {
        "comment": "What a shot!",
        "label": "POS"
    },
    {
        "comment": "Okay I've been busy and out of the loop for a few games, where's Otter?",
        "label": "NEU"
    },
    {
        "comment": "this is where I'm at now. they need a big change to their (extremely shitty) \"system\". ffs.",
        "label": "NEG"
    },
    {
        "comment": "We were 4-0 down after 8 shots, it was a tragic end but I think it was a solid effort to even tie the game. Just not our night, happens to even the best teams",
        "label": "NEU"
    },
    {
        "comment": "RIGHT I was like \"oh hey he's almost there\" 😂",
        "label": "NEG"
    },
    {
        "comment": "Great kill.",
        "label": "POS"
    },
    {
        "comment": "Good for Gudbranson, players are getting away with way to much this year.",
        "label": "POS"
    },
    {
        "comment": "Pinch me. Fucking love you Daccord",
        "label": "POS"
    },
    {
        "comment": "#HOW YA FEELIN', KINGS FANS?!?!",
        "label": "NEU"
    },
    {
        "comment": "Goalffson fucking end to end!",
        "label": "POS"
    },
    {
        "comment": "GRUUUUUUUUUUU",
        "label": "POS"
    },
    {
        "comment": "Fortunately for the flames, our PK is even worse than their hapless PP",
        "label": "NEG"
    },
    {
        "comment": "HEADLINE: “BROCK BOESTS LIGHTNING”",
        "label": "POS"
    },
    {
        "comment": "As amazing as the gutsy late third period comebacks have been can we please don't completely implode in the middle of the game",
        "label": "NEU"
    },
    {
        "comment": "Over reacting much? We're still having a good season even if we've lost a couple of games recently.",
        "label": "NEU"
    },
    {
        "comment": "this has been a fast 1st so far",
        "label": "NEU"
    },
    {
        "comment": "Yeah, it shows with all the over reaction trades he has made since the start of the season...... wait. He hasn't. If Jarmo had to choose between making a questionable move to save his job, or waiting for a good option, he would wait on principal. The dude doesn't have it in him to make panicked decisions. He is just not built like that.",
        "label": "NEG"
    },
    {
        "comment": "sike we are so not back",
        "label": "NEG"
    },
    {
        "comment": "Did someone say 3 dubs in a row????",
        "label": "POS"
    },
    {
        "comment": "🧱🧱",
        "label": "NEU"
    },
    {
        "comment": "Holy heavens our passing is atrocious tonight",
        "label": "NEG"
    },
    {
        "comment": "He had multiple penalties this game and isn't on the penalty kill. There wasn't room for him on the ice tonight.",
        "label": "NEG"
    },
    {
        "comment": "Damn these tnt dudes really buttering us up lol",
        "label": "NEG"
    },
    {
        "comment": "Quick is him",
        "label": "POS"
    },
    {
        "comment": "Just bought a CBJ hockey glove drink holder on eBay, and using it right meow. I'LL NEVER TAKE IT OFF BOYS",
        "label": "POS"
    },
    {
        "comment": "Attta boy Domi",
        "label": "POS"
    },
    {
        "comment": "Is Randy saying Nemec's name wrong or is it pronounced “Nemets”?Edit:  Asked the Devils sub, c is pronounced like “ts” in Slovak, so Nemets is the correct pronunciation.",
        "label": "NEU"
    },
    {
        "comment": "And who we lose to. We just phone it in when we think we're the stronger team. It's bit us in the ass almost every loss",
        "label": "NEG"
    },
    {
        "comment": "Shango has been unreal. Kids a player!",
        "label": "POS"
    },
    {
        "comment": "neck guard on tage?",
        "label": "NEU"
    },
    {
        "comment": "Holy fuck people.. everything is starting to align..  If we can get Jojo going this team is Stanley cup caliber",
        "label": "POS"
    },
    {
        "comment": "Linesmen are terrible, Myers is terrible",
        "label": "NEG"
    },
    {
        "comment": "WhatTheFuckJustHappened?#AHHHHHHHHHHHHHHHHHHHH HAPPY NOISES",
        "label": "POS"
    },
    {
        "comment": "Based on how the early season went, I really expected there to be a more even split between the two, it seemed to work really well.",
        "label": "NEU"
    },
    {
        "comment": "Felt like almost everything went against him last night",
        "label": "NEG"
    },
    {
        "comment": "Daccord totes thought Bjorkstrand had that one",
        "label": "NEU"
    },
    {
        "comment": "Yay, we got one.",
        "label": "POS"
    },
    {
        "comment": "Made it exciting but we still can't play an entire game with intensity.  Sigh",
        "label": "NEG"
    },
    {
        "comment": "GREAT PLAY!!!Awesome play by Brady battling with Trouba and great play by G to bank it in! Keep it going boys!",
        "label": "POS"
    },
    {
        "comment": "Carolina game will be tough. After embarassing losses to EDM and CGY, I expect the canes to come out strong. They're well coached. Let's see if the boys can pull it out.",
        "label": "NEU"
    },
    {
        "comment": "Fucking brain dead Hanifin",
        "label": "NEG"
    },
    {
        "comment": "Willy getting lazy again",
        "label": "NEG"
    },
    {
        "comment": "This game has hit on all of the 2023 Blackhawks Bingo.Seth Jones losing his position/missing the net on the PPReichel afraid to play hockey as a professional hockey player Soderblom lets in an easy goalTyler Johnson having wide open net and missing Bedard goal in a losing effort",
        "label": "NEG"
    },
    {
        "comment": "Seems like our D are making a more concerted effort to jump into the play",
        "label": "POS"
    },
    {
        "comment": "Can we score? Please?",
        "label": "NEG"
    },
    {
        "comment": "WOOOOOOOO WHITECLOUD!!",
        "label": "POS"
    },
    {
        "comment": "I wish rat face and all of the refs a very large fuck you",
        "label": "NEG"
    },
    {
        "comment": "Omg if that went in I would've lost it I swear!",
        "label": "NEU"
    },
    {
        "comment": "Third line played amazing as usual and Demko shutout!Great way to end the last home game and now let's dominate the roadtrip. Also I hope they get the three stars right.Edit: Demko, Joshua and Garland three stars!!",
        "label": "POS"
    },
    {
        "comment": "Finally. A Leafs game goes overtime. I haven't seen one in ages.",
        "label": "NEU"
    },
    {
        "comment": "Incredible work Dvorak",
        "label": "POS"
    },
    {
        "comment": "One of the few days it's been great to be a Raider AND Kraken fan!",
        "label": "POS"
    },
    {
        "comment": "The yell from ME on that awkward bounce",
        "label": "NEU"
    },
    {
        "comment": "Oilers on pace for (checks math) well that can't be right, 51 shots?",
        "label": "POS"
    },
    {
        "comment": "If this is the NYI, it would be call on the ice stands!",
        "label": "NEU"
    },
    {
        "comment": "These players in their primes at affordable contracts were great pieces in the lineups of other teams. It's usually a good idea to let them go when they want huge contracts and are past their prime.",
        "label": "NEU"
    },
    {
        "comment": "I'd love to see him stick in the top 6. So dynamic lately and fiesty. First on pucks, Hoggy is living up to his namesake!",
        "label": "POS"
    },
    {
        "comment": "Rasmus you beaut",
        "label": "POS"
    },
    {
        "comment": "Different game now",
        "label": "NEU"
    },
    {
        "comment": "Nothing gets me more pumped than OT wins",
        "label": "POS"
    },
    {
        "comment": "He's definitely proving he's an NHL'er.",
        "label": "POS"
    },
    {
        "comment": "wtf was that lmao",
        "label": "NEG"
    },
    {
        "comment": "we have a lead...cant we just play north south hockey. stop trying to be offensive and make big plays",
        "label": "NEG"
    },
    {
        "comment": "Must be nice to have goaltending, haven't know what that feels like since Ryan Miller",
        "label": "NEU"
    },
    {
        "comment": "It's brilliant we'll win... In 40 years....",
        "label": "NEG"
    },
    {
        "comment": "Hot take but that was insanely lucky, looked to me like he lost an edge.",
        "label": "NEU"
    },
    {
        "comment": "Keumper is dogshit",
        "label": "NEG"
    },
    {
        "comment": "Too many posts. Bad puck luck.",
        "label": "NEG"
    },
    {
        "comment": "If that's a slash my grandmother is a bicycle",
        "label": "NEG"
    },
    {
        "comment": "I hope the boys get to sleep in tomorrow",
        "label": "NEU"
    },
    {
        "comment": "Maybe this will wake them up!",
        "label": "NEU"
    },
    {
        "comment": "I just hope he goes 'round the world on a glove save at least once",
        "label": "NEU"
    },
    {
        "comment": "Did not have Jizzy crushing Luke on the bingo card",
        "label": "POS"
    },
    {
        "comment": "I'm so sick of the Lindy line blender. I really am.",
        "label": "NEG"
    },
    {
        "comment": "Quick got roughing?! WTF",
        "label": "NEG"
    },
    {
        "comment": "My god what a hit",
        "label": "POS"
    },
    {
        "comment": "Kevin Hayes will pot an empty netter for the hat trick",
        "label": "POS"
    },
    {
        "comment": "#ABSOLUTE FILTHY MITS",
        "label": "POS"
    },
    {
        "comment": "Numb to this",
        "label": "NEU"
    },
    {
        "comment": "Why is he even on pp1",
        "label": "NEG"
    },
    {
        "comment": "Oh god fucking dammit",
        "label": "NEG"
    },
    {
        "comment": "I'm sensing a toprightmyers night",
        "label": "NEU"
    },
    {
        "comment": "WHATTT ON US???",
        "label": "NEU"
    },
    {
        "comment": "I never want to hear that Aho is on the same level as Pettersson defensively, what was that coverage lol",
        "label": "NEG"
    },
    {
        "comment": "What did Rossi do? Lol",
        "label": "NEU"
    },
    {
        "comment": "I'll say it again raddysh and Johnson need to be split up. That line looks Super lazy and effortless",
        "label": "NEG"
    },
    {
        "comment": "Nothing is more annoying when the announcers say “6th win in 7 games” when you were at the that 1 loss hahaha LGD!!!!!! 😈😈😈",
        "label": "POS"
    },
    {
        "comment": "cozens would get shut out in a brothel",
        "label": "NEG"
    },
    {
        "comment": "As good as Luke Hughes is/will be, he should not be the focal point of the PP. We need to find ways to involve more people. They collapse a lot and prevent the cross ice Hughes-> Bratt One-timer but that we have to do something more than jack skating down to see no options and then circling back to Luke up top.",
        "label": "NEG"
    },
    {
        "comment": "He looks deep into Soderbloom's eyes and sees Macklin Celebrini looking back at him.",
        "label": "NEU"
    },
    {
        "comment": "There are going to be fifteen lead changes between these two teams.",
        "label": "NEU"
    },
    {
        "comment": "Idk, the avs and lightning this year was pretty cool",
        "label": "NEU"
    },
    {
        "comment": "YESSIR",
        "label": "POS"
    },
    {
        "comment": "NO GOAL!!",
        "label": "NEG"
    },
    {
        "comment": "I'm withholding my doom and gloom until the next couple games. Obviously can't win them all so we'll see how they respond if they don't pull something off tonight.",
        "label": "NEU"
    },
    {
        "comment": "WHAT A SAVE!!!!🤯🤯🤯",
        "label": "POS"
    },
    {
        "comment": "On the same PP",
        "label": "NEU"
    },
    {
        "comment": "Kerbs calling out the team, ANYONE for not roughing up Carrier after skating/running into Binner. TruthHe's right, he's not wrong",
        "label": "NEU"
    },
    {
        "comment": "Lol remember when Makar had that snide comment about Shesty loving to put on a show with the windmill? Quick would have Makar convulsing on the ice right now.",
        "label": "NEU"
    },
    {
        "comment": "Sharks scored 7 road goals until tonight.... they put 6 on the board tonight. Coaching change needs to happen. Starting Akira after that performance last night is the epitome of incompetence. Over 20 games in and still no defensive structure in place. Fitz needs to do something now because it's officially panic time. This season is on him just as much as Ruff. He failed to address goaltending and defense and its been exposed all year.",
        "label": "NEG"
    },
    {
        "comment": "Good to see Pospisil back in tonight",
        "label": "POS"
    },
    {
        "comment": "I don't hate Brady, where did you get that from. I've only made comments on his immaturity. That doesn't equal hate. I like Brady a lot and think he's a terrific player.I'd call my niece and nephew immature, do you think that'd mean that I hate them?Edit: and really not sure where you're gathering that I think I'm the smartest guy around. I'm just a dude who's been a Sens/hockey fan for a long time with opinions. Sorry they don't match yours I guess.",
        "label": "NEU"
    },
    {
        "comment": "We got this.",
        "label": "POS"
    },
    {
        "comment": "The kids can play and might be our best chance to win. Also greaves looked really sharp, strong instincts and agility, I wonder how long we can keep him down",
        "label": "NEU"
    },
    {
        "comment": "Sloppy",
        "label": "NEG"
    },
    {
        "comment": "\"Casey at the bat\"",
        "label": "NEU"
    },
    {
        "comment": "Why? Because his head made contact? That's not how the protocol works. Heads make contact constantly. They are looking for signs that equate to pulling him off.",
        "label": "NEU"
    },
    {
        "comment": "Swear to God the First Period Preds would win the Cup rn",
        "label": "NEU"
    },
    {
        "comment": "Excellent pressure. They look like they're enjoying playing again too.",
        "label": "POS"
    },
    {
        "comment": "It is WAY too early for this 😭",
        "label": "NEG"
    },
    {
        "comment": "Doughty!!!! fuckin great!",
        "label": "POS"
    },
    {
        "comment": "Johnny was at least excellent tonight. He's been looking a lot better",
        "label": "POS"
    },
    {
        "comment": "We all sacrificed our livers and sanity during the Willie D tank era for this team right here. This team is what was born of our sacrifice.",
        "label": "NEU"
    },
    {
        "comment": "Oilies seemed to be offside without being called pretty often.",
        "label": "NEU"
    },
    {
        "comment": "WTF are these JBD stretch passes from behind the net! He CANT come out of the lineup. Dude is actually playing with so much confidence.",
        "label": "POS"
    },
    {
        "comment": "Something in his left leg",
        "label": "NEU"
    },
    {
        "comment": "If the Leafs allow a goal here, it's gonna get ugly.",
        "label": "NEG"
    },
    {
        "comment": "the boys penalty kill is stepping on people's pp",
        "label": "POS"
    },
    {
        "comment": "I predict Hughes will score",
        "label": "NEU"
    },
    {
        "comment": "All I've been earring these last 3 days: 1-3-1 system...",
        "label": "NEU"
    },
    {
        "comment": "Did I ever say that I usually HATE those long road trips during the Holidays? It's not fun for the boys at all either.",
        "label": "NEG"
    },
    {
        "comment": "Go Habs Go!!!!",
        "label": "POS"
    },
    {
        "comment": "How in the world did he score on that shot? Crazy talent",
        "label": "POS"
    },
    {
        "comment": "I'm fully prepared for Anderson to replace slaf for the third period if we're losing",
        "label": "NEU"
    },
    {
        "comment": "I don't think he's cocky.  I think he's lazy and entitled.",
        "label": "NEG"
    },
    {
        "comment": "Honestly, they are playing well and doing what they are supposed to do in the 3rd when they are down by one.  They just have no luck at all tonight.",
        "label": "NEU"
    },
    {
        "comment": "Toxic hockey culture bullshit",
        "label": "NEG"
    },
    {
        "comment": "The players don't suck. There's a ton of talent on this team. When your best players play 11 minutes, their lies the problem.",
        "label": "NEG"
    },
    {
        "comment": "I don't think I've ever heard a commentary team with less chemistry or interest in the game.",
        "label": "NEG"
    },
    {
        "comment": "Not sure what's more frustrating. Having a lead and the team stop playing or not play the first two periods and try to force a comeback every game",
        "label": "NEG"
    },
    {
        "comment": "To everyone still watching this game, you are a real one!",
        "label": "NEU"
    },
    {
        "comment": "last was doable, but not gonna argue with after his performance overall.",
        "label": "NEU"
    },
    {
        "comment": "Face off numbers must be like 2:1 for Vegas tonight",
        "label": "NEU"
    },
    {
        "comment": "I honestly have no idea what they're going to call here",
        "label": "NEU"
    },
    {
        "comment": "Firefighters night is super based",
        "label": "POS"
    },
    {
        "comment": "SUPREME VICTORY! WE GOIN TO MOTHAFUKKIN BOOMERJACKS!",
        "label": "POS"
    },
    {
        "comment": "***YES!***",
        "label": "POS"
    },
    {
        "comment": "Looking kind of dogshitty right now",
        "label": "NEG"
    },
    {
        "comment": "Keller to Schmaltz 🤌",
        "label": "POS"
    },
    {
        "comment": "Allez les boys! We can win this one, especially for Monty",
        "label": "POS"
    },
    {
        "comment": "Comon Hughes you gotta cover Hughes!",
        "label": "NEG"
    },
    {
        "comment": "i wouldn't call losing a 1-0 lead an unreal collapse",
        "label": "NEU"
    },
    {
        "comment": "With the amount of careless turnovers we've had id make this team skate suicides tomorrow till their legs fall off.",
        "label": "NEG"
    },
    {
        "comment": "GOALIE NIGHT BABYDEMKO THE DEMONLUONGO THE HONORED",
        "label": "POS"
    },
    {
        "comment": "Entirely different team this period, mixed it up and took the first 10 minutes off.",
        "label": "POS"
    },
    {
        "comment": "Is Demko hurt or something?",
        "label": "NEG"
    },
    {
        "comment": "The only thing the zebras are worse at than calling penalties these days is getting the fuck out of the way",
        "label": "NEG"
    },
    {
        "comment": "Acceptable.",
        "label": "NEU"
    },
    {
        "comment": "Literally, especially after the game knies was having",
        "label": "NEU"
    },
    {
        "comment": "Nobody makes Marchenko bleed his own blood. NOBODY.",
        "label": "POS"
    },
    {
        "comment": "Levi has been a fucking wall tonight. Also, FUCK YOU MARCHAND!",
        "label": "POS"
    },
    {
        "comment": "This game is an extremely tough spot for the boys. Played hard in the 1st, sucks to give up a soft goal but will be a close game if they continue to play like this.",
        "label": "NEU"
    },
    {
        "comment": "Okay, I liked that",
        "label": "POS"
    },
    {
        "comment": "I love how bad we are",
        "label": "NEG"
    },
    {
        "comment": "For real. They wanna get dirty plays like that out of the game? FUCKING PUNISH THEM WHEN IT HAPPENS.",
        "label": "NEG"
    },
    {
        "comment": "They wouldn't even need to show us the game",
        "label": "NEU"
    },
    {
        "comment": "oh please tell me he's actually ok",
        "label": "NEU"
    },
    {
        "comment": "All the focus is on Huberdeau but Lindholm's has been worse. And for someone that reportedly wanted 9.5M from the Flames to stay. The stretch of terrible earlier in the season was a blessing in disguise",
        "label": "POS"
    },
    {
        "comment": "Look at that! Look at this! Look at that!",
        "label": "POS"
    },
    {
        "comment": "Games are won in the first period right? Right?",
        "label": "NEG"
    },
    {
        "comment": "New conspiracy theory: the Panthers have someone sawing partway through sticks in the away locker room. Trained mice or something.",
        "label": "NEU"
    },
    {
        "comment": "How about a Wenny point for his bobble head night? That would be special",
        "label": "POS"
    },
    {
        "comment": "Ouch, sorry Fabbro, that hurts",
        "label": "NEG"
    },
    {
        "comment": "Laine and Gaudreau are just total non factors it's sad to see",
        "label": "NEG"
    },
    {
        "comment": "LOL that Petey sigh of frustration",
        "label": "NEU"
    },
    {
        "comment": "Took a surprise nap after work and woke up to this scoreline.  What a pleasant surprise",
        "label": "POS"
    },
    {
        "comment": "Hynes .750 win %",
        "label": "POS"
    },
    {
        "comment": "Slow start for both teams",
        "label": "NEU"
    },
    {
        "comment": "YAMS!!!!! WOOOT!!!",
        "label": "POS"
    },
    {
        "comment": "That one dude kept getting laid out 😂😂😂",
        "label": "POS"
    },
    {
        "comment": "What the hell happened?? I cut a watermelon and came back to 2 more goals. These guys SUCK",
        "label": "NEG"
    },
    {
        "comment": "I think that's a reach that he's keeping them in the game. Wasn't a bad first period.",
        "label": "NEU"
    },
    {
        "comment": "It's funny, we're bottom 5 in both goaltending and scoring. But we manage to underperform even that. We'll score 3, only to let in 4. Then we'll have a game like tonight where we hold the other guys to 2, only to not score.We're definitely getting the least out of what little we do have.",
        "label": "NEG"
    },
    {
        "comment": "Soderblom just isn't a guy who's going to win ~~a shootout~~",
        "label": "NEG"
    },
    {
        "comment": "Nice, Suter",
        "label": "POS"
    },
    {
        "comment": "I always think that if we get even 1 more Russian person on this team that Kaprizov would be just slightly happier and more comfortable and improve his play",
        "label": "NEU"
    },
    {
        "comment": "Saw the game at BJ's in Fremont. Good win👌",
        "label": "POS"
    },
    {
        "comment": "Zaits WHAT A PASS",
        "label": "POS"
    },
    {
        "comment": "~~BECK !!!!!!!!!!~~ DOWDERSSSSSSSS!!! 🎉🎉🎉",
        "label": "POS"
    },
    {
        "comment": "Benson all over the ice tonight, you love to see it",
        "label": "POS"
    },
    {
        "comment": "I think the $10 per game is on an individual game basis, I have to imagine buying a whole season would be cheaper per gameAlso I bet you can just Google it",
        "label": "NEU"
    },
    {
        "comment": "I think we're looking a hair better than Boston right now. They seem to maybe be scrambling with all the pressure we're putting on them.Let's see Boston collapse, eh?",
        "label": "POS"
    },
    {
        "comment": "Hey now!",
        "label": "NEU"
    },
    {
        "comment": "Beauuuutiful play!!!",
        "label": "POS"
    },
    {
        "comment": "So maybe we should just start going down by 2 goals instead of being up 2 goals, can't blow the lead then",
        "label": "NEG"
    },
    {
        "comment": "Looked pretty decent in the first period, then just collapsed. Power play looked pretty rough :(See you guys tmr :)",
        "label": "NEG"
    },
    {
        "comment": "You can't be a third period comeback team if there is nothing to come back from.",
        "label": "NEG"
    },
    {
        "comment": "Of course. Let's blow a tire exiting our own zone, surrendera two on ohhhhh. We will concede to the pressure and walk away with a participation point.",
        "label": "NEG"
    },
    {
        "comment": "Vronk!",
        "label": "NEU"
    },
    {
        "comment": "You could have given the reins to a magic 8 ball to make all the decisions and there likely would have been more success.",
        "label": "NEG"
    },
    {
        "comment": "It's amazing the difference elite talent makes",
        "label": "POS"
    },
    {
        "comment": "Shoutout to the Blues fan rockin the Binnington jersey in the lower bowl! Lol",
        "label": "NEU"
    },
    {
        "comment": "Petey is ON tonight",
        "label": "POS"
    },
    {
        "comment": "*taps forehead*There's no regulation in the playoffs",
        "label": "NEU"
    },
    {
        "comment": "That was so weak sauce it's practically water",
        "label": "NEU"
    },
    {
        "comment": "He asked if Panger would sit next to him on the plane for their next road trip. Panger uncomfortably laughed it off and said he would be sitting next to Troy again so they could catch up. It was a really weird and uncomfortable moment.",
        "label": "NEU"
    },
    {
        "comment": "Myers was piss poor.  Hronek wasn't good.  Hughes tried too hard.  Zadorov had some good hits but is also prone to bad turnovers.  Cole was on the hook for a goal, him or Blueger should've picked up Hughes on the 3rd goal.  Juulsen was okay (only 10 mins of ice time).",
        "label": "NEG"
    },
    {
        "comment": "interesting scheduling to stack and play teams more clustered. curious to see how the team will look when we play our kings and remaining vegas games... also not complaining cause im in Calgary only till dec so i get to see the nucks twice",
        "label": "NEU"
    },
    {
        "comment": "3 stars1. O'Reilly 1g 1a2. Josi 1a3. Trocheck 1g 2aJust ignore Fox's 3 points and Igor's 38 saves and give the top 2 stars to the losing team. Totally makes sense.",
        "label": "NEU"
    },
    {
        "comment": "The game I miss because I am dead tired is the best game of the season (so far)? And the best Connor in the league scored a hattrick? And judging by comments here he might have had another goal? Please explain this to me while I watch the recap, thank you.",
        "label": "POS"
    },
    {
        "comment": "From now on, I'm calling Hayes \"Goofy\". No offense to Goofy.",
        "label": "NEU"
    },
    {
        "comment": "Damn I love Englund",
        "label": "POS"
    },
    {
        "comment": "Kaprizov needs to chill with the impossible pass attempts. Way too many turnovers from those lately.",
        "label": "NEG"
    },
    {
        "comment": "Welp, what have we always said, 2nd period team? lol.",
        "label": "NEU"
    },
    {
        "comment": "Was feeling down since the Ohtani news broke. This definitely cheered me up!",
        "label": "NEU"
    },
    {
        "comment": "I'm gonna change it up for this one...Three Turds of the Game💩 - Kyrou💩💩 - Krug💩💩💩 - ESPN's AnnouncersBonus 💩 to the refs for the made up penalties. I'm not sorry, but a player making a sweep check that ends up knocking it out of play should not be a penalty. And whatever the interference call was at the beginning of the 3rd didn't even warrant a replay on TV.",
        "label": "NEG"
    },
    {
        "comment": "We used to score a lot last year.",
        "label": "NEG"
    },
    {
        "comment": "Mathews everyday of the week and twice on Sunday",
        "label": "POS"
    },
    {
        "comment": "Love the effort. Keep blocking those shots and getting sticks in lanes",
        "label": "POS"
    },
    {
        "comment": "slaf was a different beast this game, the progress",
        "label": "POS"
    },
    {
        "comment": "I was 22 then and still watching the games in my college bar! The heart could handle it better then haha",
        "label": "NEU"
    },
    {
        "comment": "I didn't expect this to be points night. At least not for the Leafs.",
        "label": "NEU"
    },
    {
        "comment": "This fucking guy",
        "label": "NEG"
    },
    {
        "comment": "Ovi and Carlson on 3 on 3?",
        "label": "NEU"
    },
    {
        "comment": "The non-pinned post game thread throws me off but anyway, I knew we were going to win but I couldn't say it out loud 🤫👹❤️‍🔥😘",
        "label": "POS"
    },
    {
        "comment": "Just got here WHAT THE FUCK HAPPENED",
        "label": "NEG"
    },
    {
        "comment": "OVERTURN THIS SHIT",
        "label": "NEG"
    },
    {
        "comment": "The last time this organization made a major change was when the arena was empty and there were rumors of relocation. Boycott season?",
        "label": "NEG"
    },
    {
        "comment": "oh i know he sucks but it doesn't help when your team sucks in front of you",
        "label": "NEG"
    },
    {
        "comment": "The reality is that Zemgus would not be caught dead in that position. He dumps to the corner and that's it",
        "label": "NEG"
    },
    {
        "comment": "Hang in there. There's something nasty going around. Took me down for a couple days this week.",
        "label": "NEU"
    },
    {
        "comment": "exactly, its nice when its exciting but just loose in regulation",
        "label": "NEU"
    },
    {
        "comment": "Dime pass by wheeler",
        "label": "POS"
    },
    {
        "comment": "I'll be honest with you, I don't think this is helping his confidence.",
        "label": "NEG"
    },
    {
        "comment": "Wish I got paid $8mil to completely suck ass at my job",
        "label": "NEG"
    },
    {
        "comment": "Anderson needs a sports therapist or something he is so far in his head.",
        "label": "NEG"
    },
    {
        "comment": "Sharon and goalman willed that shit into the net. What a shift.",
        "label": "POS"
    },
    {
        "comment": "At least back then we lost because we legitimately sucked, we didn't expect any better.Now we know we can do better but we're sabdbagging it.",
        "label": "NEG"
    },
    {
        "comment": "I have to take a power nap or I'm not making it through the game, hopefully the rangers are doing something similar between periods.",
        "label": "NEU"
    },
    {
        "comment": "Flames sub is complaining about him being bias towards van lol",
        "label": "NEU"
    },
    {
        "comment": "Yea man he was my favourite",
        "label": "NEU"
    },
    {
        "comment": "End of the first right now, anyway.",
        "label": "NEU"
    },
    {
        "comment": "I'm old enough to have watched that meme break in with the habs. Love it",
        "label": "NEU"
    },
    {
        "comment": "I'd love to see Fabes with a mullet",
        "label": "POS"
    },
    {
        "comment": "Take that drama elsewhere, girlfriend 🙄",
        "label": "NEG"
    },
    {
        "comment": "Fucking Filthy Forsberg, owner of OT.",
        "label": "POS"
    },
    {
        "comment": "He's becoming very unpleasant to play against.",
        "label": "POS"
    },
    {
        "comment": "Oh my god we're cursed",
        "label": "NEG"
    },
    {
        "comment": "Knowing our teams track record with previous talents, I guarantee the team is gonna completely fumble developing players like coronato, wolf & pospisil. At least Zary looks like he's getting comfortable ahead of time.",
        "label": "NEG"
    },
    {
        "comment": "The Wild set a pretty low bar. We've had some ugly games but we aren't as bad as the Wild.",
        "label": "NEG"
    },
    {
        "comment": "Good game this",
        "label": "POS"
    },
    {
        "comment": "YES!!!Sens media is toothless. No one besides Ian mendes is willing to even skirt the topic of this teams shit play. They'll talk about the pressure and the schedule but holy shit, who the fuck is holding these guys accountable!?Not the coach, not the media…. I'll give the **new** management team a bit of a buffer but holy fuck… these media teams have seen this shit, they see the patterns, they know the script… ask the tough questions",
        "label": "NEG"
    },
    {
        "comment": "I dont agree.   A cross ice/east-west pass to a WIDE OPEN player for a one time shot and goal cant go on the goalie.  Had Schmid got across ice and made those saves they would have been great but he didnt.  You cant blame him for not making a great save.  Cant blame him for tip ins.   I will put some of the blame on the 5th goal because Schmid swatted at the puck but then yet again, it was a wide open Shark who got the puck and put it in.  Why was he wide open is the real question.  This is and has been all on the 5 man shitty defensive system the Devils are trying to play.  Peewee teams do a better job of picking up open players in the D zone.  Coaches either have to change it or we need new coaching.",
        "label": "NEG"
    },
    {
        "comment": "Let's go game over",
        "label": "POS"
    },
    {
        "comment": "That was a hoot! ❤️",
        "label": "POS"
    },
    {
        "comment": "Yes Vesey! Maybe this will wake them up.",
        "label": "NEU"
    },
    {
        "comment": "Do you think goalies like Stolarz ever feel an ounce of shame knowing they are the sole reason for their  team losing?",
        "label": "NEG"
    },
    {
        "comment": "Yep saw it coming",
        "label": "NEU"
    },
    {
        "comment": "If we can just win this period and carry some momentum I'll be happy",
        "label": "NEU"
    },
    {
        "comment": "Weegs needs to use his shot fake more often.",
        "label": "NEU"
    },
    {
        "comment": "Good Lord it's moments like these that I really miss Josh and Razer!",
        "label": "NEG"
    },
    {
        "comment": "Okay, but-Why take out our defence, Rocky Mountain Bros? Just wait for us to turnover like every other team!!  😭😭😭We ain't that good!",
        "label": "NEG"
    },
    {
        "comment": "Wasn't that cat",
        "label": "NEU"
    },
    {
        "comment": "Kind of unbelievable a team like this can just never score first",
        "label": "NEG"
    },
    {
        "comment": "Sucks that teams like the Blackhawks and Blue Jackets are already tanking so early in the season.",
        "label": "NEU"
    },
    {
        "comment": "Ugly, but I'll take it.  Some tepid D play, some great D play, our pucks went in, theirs did not.  Decent game Vanecek, monster game Nico Horschier!",
        "label": "POS"
    },
    {
        "comment": "We got a game here folks.",
        "label": "POS"
    },
    {
        "comment": "Panthers please win so i can forget about last night's shitshow.",
        "label": "NEU"
    },
    {
        "comment": "Standings wise we are worse than we were last year. Through 28 games this year, we are 8-15-5. Last year through 28, we were 10-16-2. We literally ARE worse this year. Check Hockey Reference",
        "label": "NEG"
    },
    {
        "comment": "This is absolutely a team we should be confidently beating. Terrible coach, terrible effort from the players. If we can't win this game, what games are we supposed to win?",
        "label": "NEG"
    },
    {
        "comment": "Our D looks great tonight",
        "label": "POS"
    },
    {
        "comment": "So sloppy and lethargic. Wake the fuck up",
        "label": "NEG"
    },
    {
        "comment": "noted Czech sniper David Kämpf",
        "label": "POS"
    },
    {
        "comment": "Low event game skewed by whatever the refs were doing in the 3rd.",
        "label": "NEU"
    },
    {
        "comment": "No penalty shot:(",
        "label": "NEU"
    },
    {
        "comment": "Hockey players are notorious for begging to play despite what's bothering them. When Rich Peverly had a heart attack and died on the ice, the first thing he asked when they literally revived him in the tunnel was whether he could go back into the game.",
        "label": "NEU"
    },
    {
        "comment": "We actually would've won without Myers. Just bench him",
        "label": "NEG"
    },
    {
        "comment": "Too late 🫠",
        "label": "NEG"
    },
    {
        "comment": "I would love to win some time with Joe and Sam",
        "label": "NEU"
    },
    {
        "comment": "It is mental health awareness here in Boston where we will be aware of how depressed the Bruins make the Sabres fans",
        "label": "NEU"
    },
    {
        "comment": "Expectation around the league was that the Sens were going to be a good/wildcard team, it's not like it was some delusional expectation only shared by Sens fans.",
        "label": "NEG"
    },
    {
        "comment": "I am once again here to remind the Binnington haters that he is winning the Vezina this season. This is not an overreaction or bias this is just an objective fact thank you. Scrumptious dub tonight boss men.",
        "label": "POS"
    },
    {
        "comment": "Demko was fantastic last night. He made a lot of key saves at important times that allowed for the team to continue to play their way. It wasn't one of those games where I would say he was the only reason we won because the team in front of him was playing really well but it just goes to show how important it is to have a goalie who just looks super confident in net.",
        "label": "POS"
    },
    {
        "comment": "Ranger fans are truly some of the most self-obsessed twits",
        "label": "NEU"
    },
    {
        "comment": "Needed a garbage one like that",
        "label": "POS"
    },
    {
        "comment": "Myers actually playing decent",
        "label": "POS"
    },
    {
        "comment": "Prob gonna score 4 goals every game from here on out.",
        "label": "POS"
    },
    {
        "comment": "NHL Network sucks!! Why does it even exist?",
        "label": "NEU"
    },
    {
        "comment": "The amount of open net Zib had on that shot  L(・o・)」",
        "label": "NEU"
    },
    {
        "comment": "Reaves basically drew that penalty lolll",
        "label": "NEU"
    },
    {
        "comment": "Popisil was a conditioning stint. Nothing deserving or not deserving about it.And he had the flu the other game..",
        "label": "NEG"
    },
    {
        "comment": "Good fucking shit atleast Shesterkin is trying",
        "label": "POS"
    },
    {
        "comment": "The most blue jackets thing ever is giving up 5 unanswered goals.The most is maples leaf's thing ever is coming back 5 goals and still losing.Only chaos can happen if these two face each other.",
        "label": "NEU"
    },
    {
        "comment": "S2G Ovi is gonna be the “what if player” in 10/15 years…He's just been fucked over and over again. League lockouts, COVID, etc. would be super close to the record by now. And yet… he ain't gonna break it.",
        "label": "NEG"
    },
    {
        "comment": "jesus, alright bud. calm down",
        "label": "NEU"
    },
    {
        "comment": "Great shift for the fourth line",
        "label": "POS"
    },
    {
        "comment": "Bluey doesn't let me down like this team does. 😞",
        "label": "NEG"
    },
    {
        "comment": "Vladar with the giveaway... Huby be like \"hold my beer\"",
        "label": "NEG"
    },
    {
        "comment": "Willy.. lol",
        "label": "NEU"
    },
    {
        "comment": "I feel good taking an important point out of that game. They did what they needed to do win that game, just came up a bit short against a really good Toronto team. This is an effort to build on.",
        "label": "POS"
    },
    {
        "comment": "Lays the Lumber and rips one!",
        "label": "POS"
    },
    {
        "comment": "Boom! Roasted",
        "label": "POS"
    },
    {
        "comment": "I cant watch Woll get barraged like this",
        "label": "NEG"
    },
    {
        "comment": "IN!LFG!",
        "label": "POS"
    },
    {
        "comment": "Omfg what a goal. Holy shit.",
        "label": "POS"
    },
    {
        "comment": "Hög has been elite",
        "label": "POS"
    },
    {
        "comment": "We need the Jims.",
        "label": "NEU"
    },
    {
        "comment": "I genuinely find it hard to explain how professional hockey players couldn't find the back of the net with 6-8 minutes of powerplay time per game on a regular basis",
        "label": "NEG"
    },
    {
        "comment": "The worst effort I ever seen in a long time",
        "label": "NEG"
    },
    {
        "comment": "hmmm … maybe try turning off the game tonight(edit to clarify /j)",
        "label": "NEU"
    },
    {
        "comment": "Man Kirills flow is *stunning*",
        "label": "POS"
    },
    {
        "comment": "Maybe Colliton was jealous of how cute Strome's dog was?",
        "label": "NEU"
    },
    {
        "comment": "Well my streak of staying away from Reddit during the game and the Sens winning is over. We got goalied like a mofo. Sens played a really good game again. I like to see the effort consistently now. Just couldn't get the points.",
        "label": "POS"
    },
    {
        "comment": "Nice save from Talbs. Fiala has got to not revert to his stupid o zone penalty phase",
        "label": "NEU"
    },
    {
        "comment": "wtf retire",
        "label": "NEG"
    },
    {
        "comment": "This is why we needed that buffer",
        "label": "NEU"
    },
    {
        "comment": "They don't ask how they ask how many.",
        "label": "POS"
    },
    {
        "comment": "It's not brash or reactionary, we have enough of a sample size to know that the team is performing at a lower level than it has any right to. We have too much talent for this to be our season. We've had one maybe two good games so far, against teams that are basically bottomfeeders this season, even still we just got rocked by the biggest bottomfeeder of the season.",
        "label": "NEG"
    },
    {
        "comment": "Some brutal turnovers the last few games",
        "label": "NEG"
    },
    {
        "comment": "I love this team",
        "label": "POS"
    },
    {
        "comment": "Man, the Panthers sub is some kinda thing. They really liked that hit.",
        "label": "NEU"
    },
    {
        "comment": "If he were a suitable replacement, maybe, but Vinnie has nowhere near the talent Hartman has and I'm sure Hynes wants to put the best team possible on the ice.",
        "label": "NEU"
    },
    {
        "comment": "Ain't no way clifton got bitched by a 19 year old 💀💀",
        "label": "NEG"
    },
    {
        "comment": "Funny how all the redwings fans didnt want Kane to sign cause hes a piece of shit person but now they all love him",
        "label": "POS"
    },
    {
        "comment": "Now Sam and Joe rip the refs cause both are tired of this bullshit",
        "label": "NEG"
    },
    {
        "comment": "I love when they try to show us the review and the clip doesn't even follow the puck.",
        "label": "NEU"
    },
    {
        "comment": "What will happen to Big Z in Vancouver when he figures out he's not the top defenseman there either?",
        "label": "NEG"
    },
    {
        "comment": "Holy fuck shoot or something. 40 seconds left so let's just stand here and look around a bit...",
        "label": "NEG"
    },
    {
        "comment": "#DIDNT REALIZE THERE WAS A GAME TONIGHT BROS BUT IM HERE NOW",
        "label": "POS"
    },
    {
        "comment": "It's definitely intentional. Everyone does it to try to stay onside",
        "label": "NEU"
    },
    {
        "comment": "🤣🤣🤣 you can't make this up...",
        "label": "NEU"
    },
    {
        "comment": "It wasnt worse lol",
        "label": "NEU"
    },
    {
        "comment": "this really was easy to see coming.  I never hated Hynes the way a lot of our fans seem to--I'll even give the guy credit as he played the role of scapegoat pretty well.  Poile knew he was screwed and absolutely knew what he was doing hiring him.  When you get right down to it he was yet another poor decision by Poile on his way out the door...",
        "label": "NEG"
    },
    {
        "comment": "Any idea what's going on with Timo? seems like he's just been streaky",
        "label": "NEG"
    },
    {
        "comment": "Notice how you can score late on the play if you play tough D, lads?  That goal was a whole team effort.",
        "label": "POS"
    },
    {
        "comment": "Looks like a High Stick to me.",
        "label": "NEU"
    },
    {
        "comment": "SHARO!!!",
        "label": "POS"
    },
    {
        "comment": "Welcome!!! Don't apologize for life happening glad to see ya either way",
        "label": "NEU"
    },
    {
        "comment": "That was a low effort shift from Miller there.",
        "label": "NEG"
    },
    {
        "comment": "Hard to miss him",
        "label": "NEU"
    },
    {
        "comment": "not surprised someone wanted to fight Joseph but nice on the takedown for Joseph",
        "label": "POS"
    },
    {
        "comment": "Columbus gave us Carter. They gave us Gaborik. They gave us Vlad. They gave us this win tonight. God bless Columbus.",
        "label": "POS"
    },
    {
        "comment": "No, no, let him cook.",
        "label": "POS"
    },
    {
        "comment": "This didn't age well",
        "label": "NEG"
    },
    {
        "comment": "We are so lucky to have root announcers",
        "label": "NEU"
    },
    {
        "comment": "Great fucking kill boys",
        "label": "POS"
    },
    {
        "comment": "lol we're tanking. We don't need anything tbh",
        "label": "NEG"
    },
    {
        "comment": "Eric Robinson only scores at KeyBank center. The only thing that can stop him is the refs",
        "label": "NEU"
    },
    {
        "comment": "It's not it's fucking insanely dumb.But sure, let me humor you. What's the use? (if you just wanna that like all analytics the main use is to validate opinions you already had then that's fine, that's a good use and it's what 99% of people are doing anyway).",
        "label": "NEU"
    },
    {
        "comment": "I ain't forget when some of you said juice was washed",
        "label": "NEU"
    },
    {
        "comment": "Probably why he gets so many “rest” days too. Don't know why this team is so fishy with injuries",
        "label": "NEU"
    },
    {
        "comment": "Agree.  And 4-3 I think the team had some fire but once it was 5-3 - it was gone.  They were going through the motions.",
        "label": "NEG"
    },
    {
        "comment": "Will we have 3 ppl hit 40 this yr marchy karly and eichel have been on a insane pace",
        "label": "POS"
    },
    {
        "comment": "Yea same here, drove from Charlotte to be here and this is what we get to experience :(",
        "label": "NEG"
    },
    {
        "comment": "Detroit's going to be good enough to make the playoffs most years in the future and I so look forward to dummying their soft-as-butter team in the first round.",
        "label": "POS"
    },
    {
        "comment": "ok good auto sorting by new is fixed. LETS GO YOTES!",
        "label": "POS"
    },
    {
        "comment": "You guys! We are now 12-0 when we outscore our opponent.",
        "label": "POS"
    },
    {
        "comment": "Woll's injury makes me think goalie equipment has become too heavy.The last time I saw a Leafs goalie move like that was probably Eddie the Eagle?",
        "label": "NEU"
    },
    {
        "comment": "What the fuck was that?",
        "label": "NEG"
    },
    {
        "comment": "Anyone want to gift me a Faber jersey please",
        "label": "POS"
    },
    {
        "comment": "> Garland and Joshua are this team's Chris Higgins and Jannik Hansen.[*\"Little bit of Dakota Joshua.\"*](",
        "label": "POS"
    },
    {
        "comment": "Seems like half the fanbase already forgot Nylander was carrying this team the first 2 months when Matthews and Marner were showing up once every 5 games. Recency bias is insane. Nylander had a bad blunder so what Marner does the same shit 5 times a game",
        "label": "NEU"
    },
    {
        "comment": "lol I watched 2nd and 3rd periodseemed we controlled most of the play",
        "label": "POS"
    },
    {
        "comment": "That was the most beautiful play I've seen",
        "label": "POS"
    },
    {
        "comment": "This is a pretty balanced / deep team with 4 decent lines .... if the first top two lines heat up we are hard to beat.     I also think our top 4 defensemen are decent.    Top 3 are excellent with Brodin, Fabor and Spurgeon.  And have two decent goalies.   Who says we can't go on a nice win streak.All that said, the passing and movement out of the defensive zone has been way better than in the past.   The team, win or lose, is much more fun to watch right now.   I predict by mid season we are fully in line for a playoff spot.     What a difference a week makes.",
        "label": "POS"
    },
    {
        "comment": "Did this fucking moron call the blocker a stick glove?",
        "label": "NEU"
    },
    {
        "comment": "That team you refer to is SO TACKY",
        "label": "NEG"
    },
    {
        "comment": "Really feels like we've been the better team for a lot of this game and yet we're trailing. Maybe it's a former coach thing",
        "label": "NEU"
    },
    {
        "comment": "Holy fuck Ras. What were you doing there.",
        "label": "NEG"
    },
    {
        "comment": "Him and Nichushkin. We've been beating Nichushkin up tho",
        "label": "NEU"
    },
    {
        "comment": "wow a point at least",
        "label": "NEU"
    },
    {
        "comment": "Good defensive work by Evans on the boards there.",
        "label": "POS"
    },
    {
        "comment": "let's fucking go bois",
        "label": "POS"
    },
    {
        "comment": "> We look better when we have the puck on offense vs not having the puck on defense… what a revelation!This is what you're boiling that down to? Camaaan dude.",
        "label": "NEU"
    },
    {
        "comment": "hahaha I can't unsee that now.",
        "label": "NEU"
    },
    {
        "comment": "That's a lot of men",
        "label": "NEU"
    },
    {
        "comment": "With many fewer games played",
        "label": "NEU"
    },
    {
        "comment": "Welp cue the \"if you're a goaltender...\" 😭",
        "label": "NEU"
    },
    {
        "comment": "Lol Tennessee Wesleyan vs Chattanooga score",
        "label": "NEU"
    },
    {
        "comment": "It actually feels like those two accounts are one person high fiving themselves lol",
        "label": "NEU"
    },
    {
        "comment": "That's probably because it's probably not really a problem for them? Robidas and St Louis are both Player developpement hires, Burrows has been coaching pro hockey for more than 5 years and Letowski is a career coach with ten years in the OHL. Assistant coaching jobs are litterally how most junior coaches start in pro hockey (See pascal Vincent, Ducharme, Groulx, etc.) We're not getting Boucher on a shit team like this to be an Assistant coach.. It's perfectly fine to get assistants from junior leagues.",
        "label": "NEU"
    },
    {
        "comment": "Slow down. Sharks tomorrow",
        "label": "NEU"
    },
    {
        "comment": "So glad we got this win, Vanacek needed this so badly for his confidence as well as the whole team really. Happy to see we won the Hughes Bowl too :)Edit: Ok maybe Vanacek's confidence is shot, but I just feel bad for him and would love to see a resurgence of previous form.",
        "label": "POS"
    },
    {
        "comment": "Not sure the down votes are deserved on this one, we are lacking an elite offensive talent and one legit fell into our lap and we didn't bite.I do think Reinbacher will be solid down the line, but this decision still baffles me",
        "label": "NEU"
    },
    {
        "comment": "That's Dallas sports, babyyy",
        "label": "POS"
    },
    {
        "comment": "E-Rob but he's the goat",
        "label": "POS"
    },
    {
        "comment": "Hurry back woll",
        "label": "NEG"
    },
    {
        "comment": "Classic celly by Luke",
        "label": "POS"
    },
    {
        "comment": "BRODZINSKI SCORES AND???? TUMBLES‼️",
        "label": "NEU"
    },
    {
        "comment": "It's only gonna get worse. That was when we were up by 2. They're just getting embarrassed at this point",
        "label": "NEG"
    },
    {
        "comment": "Experience. Blues. Hockey.",
        "label": "NEG"
    },
    {
        "comment": "Lindy has us covered.",
        "label": "NEU"
    },
    {
        "comment": "Nobody wants to shot. Nobody is capable of connecting on a pass. Recipe for shit hockey",
        "label": "NEG"
    },
    {
        "comment": "Malkin's an idiot",
        "label": "NEG"
    },
    {
        "comment": "We have a team that went to the finals last year everything they could want and then some. Good game boys.",
        "label": "POS"
    },
    {
        "comment": "That felt good. Can't be giving up 14 goals in 3 games but I'm glad we got the full 2 points tonight. I like that we didn't quit and fought back again even though we came up short last night. That's a positive sign.",
        "label": "NEU"
    },
    {
        "comment": "At what point? When we see this team without DJ",
        "label": "NEG"
    },
    {
        "comment": "imo this shows what happens when our stars are let loose to go wild. makes me concerned though why were so often in this situation and what that says about our \"structured play\"",
        "label": "NEG"
    },
    {
        "comment": "It was Dilly though!",
        "label": "POS"
    },
    {
        "comment": "Welp another good example that this team has the ability. They just aren't playing the full 60 minutes the way they should be.",
        "label": "NEG"
    },
    {
        "comment": "First name SharonLast name Govich",
        "label": "NEU"
    },
    {
        "comment": "At our current rate we're on track for 20!",
        "label": "POS"
    },
    {
        "comment": "Still Beats me, I've never skated PERIOD",
        "label": "NEU"
    },
    {
        "comment": "Hmm I bet with an injury or two he will be up then. That is good to hear though.",
        "label": "POS"
    },
    {
        "comment": "Foot on the gas!!!!!",
        "label": "POS"
    },
    {
        "comment": "Zad scores, but his agent bragging about him being the best Dman on the Flames gets exposed for what it really is. Gilly fights him in the 1st.",
        "label": "NEU"
    },
    {
        "comment": "This Miller Hoggy Boeser line doesn't look so bad",
        "label": "POS"
    },
    {
        "comment": "Colton's a scumbag.",
        "label": "NEG"
    },
    {
        "comment": "Can we go like 1 week without losing an important player?",
        "label": "NEG"
    },
    {
        "comment": "Allen got the molson cup in october and since then it just went downhill it feels like",
        "label": "NEG"
    },
    {
        "comment": "The owner wants to instill stability. The status quo is the opposite of that. Painful to watch another ruderless season go down the drain",
        "label": "NEG"
    },
    {
        "comment": "They been playing rather poor for the past 2 weeks it's not a suprise.",
        "label": "NEG"
    },
    {
        "comment": "BIG BOI HUBI playing bully",
        "label": "POS"
    },
    {
        "comment": "Last game before I go on vacation so let's get our shit together and get the W!! GKG!!!",
        "label": "POS"
    },
    {
        "comment": "Totally agree. Something to be said about the character of the room rn just winning when shit isn't going our way.",
        "label": "POS"
    },
    {
        "comment": "And the alternative is what exactly? Keep rolling out the current roster? Which btw is only going to get worse once we lose Vlad and Giroux to age.",
        "label": "NEG"
    },
    {
        "comment": "Smells like LouDog inside the van",
        "label": "NEU"
    },
    {
        "comment": "Cassie Campbell is smart and better at commentary than Leah Hextall but PLEASE girl show some excitement. The monotone is putting me to sleep",
        "label": "NEU"
    },
    {
        "comment": "Did you watch the game?",
        "label": "NEU"
    },
    {
        "comment": "Where's goalman at? Quiet tonight.",
        "label": "NEU"
    },
    {
        "comment": "Don't act like Larsen wasn't a fucking disaster, too.",
        "label": "NEG"
    },
    {
        "comment": "This kid is so special.",
        "label": "POS"
    },
    {
        "comment": "Just once I'd like to win one of these. Can't be upset about that effort to get to OT tho. Jesus",
        "label": "NEU"
    },
    {
        "comment": "pedal to the metal boys!! no more sitting with a lead on my history making team!!!",
        "label": "POS"
    },
    {
        "comment": "Dads mad tonight.",
        "label": "NEG"
    },
    {
        "comment": "Is Domi or Cammalleri back with Habs ? Or Tanguay ?",
        "label": "NEU"
    },
    {
        "comment": "thank god it finally stopped",
        "label": "NEU"
    },
    {
        "comment": "You can be shit and lazy at the same time. These are not mutually exclusive things.",
        "label": "NEG"
    },
    {
        "comment": "These games against Dallas never disappoint!",
        "label": "POS"
    },
    {
        "comment": "I love it",
        "label": "POS"
    },
    {
        "comment": "Kelly didn't really deserve the two minutes, but I'm honestly AMAZED that the refs got that call (mostly) right.",
        "label": "NEU"
    },
    {
        "comment": "Robo not willing to hit players but zebras? Yes please.",
        "label": "POS"
    },
    {
        "comment": "Okie got one! Yeah!",
        "label": "POS"
    },
    {
        "comment": "Merrill and Goose looking like beer leaguedl defense out there.",
        "label": "NEG"
    },
    {
        "comment": "Look at what Torterella is getting out of the flyers.  It's not our roster, it's the coach.",
        "label": "POS"
    },
    {
        "comment": "Exactly! I think he gets a lot of love Saturday. Could be a turning point in his career. He seemed rattled in that presser and knew he fucked up",
        "label": "POS"
    },
    {
        "comment": "Remember when Joe mentioned how Anaheim was the most penalized team in the NHL?  Watch us not get a single call against them",
        "label": "NEG"
    },
    {
        "comment": "No No No NO, don't mess with Foligno Heart!!! That's all I can think of so far. LFG!!!",
        "label": "POS"
    },
    {
        "comment": "Probably Mermis or Damon Hunt next season at the full-time. Both of them might not be so bad either.",
        "label": "NEU"
    },
    {
        "comment": "Shame it is being overshadowed by the most embarrassing hockey game I have seen in a few years...Honestly, at least with the dark era Devils their was no expectations... this season hurts more",
        "label": "NEG"
    },
    {
        "comment": "Hopefully our prospects pan out.  And hopefully this is a learning year and they don't regress too much in the coming years.",
        "label": "POS"
    },
    {
        "comment": "Damn so close",
        "label": "NEU"
    },
    {
        "comment": "Unhelpful answer, but probably both.  I don't think we have any OELs among our current prospects",
        "label": "NEU"
    },
    {
        "comment": "What an awesome game! I could have given the whole team a star if I could!",
        "label": "POS"
    },
    {
        "comment": "It's the vino... you're forgiven.  Keep drinking. We need another goal.",
        "label": "NEU"
    },
    {
        "comment": "God if you can hear me please provide this team with top 4 defence man it isn't much but it will fulfill our dream of having B+ defence core. Amen",
        "label": "NEG"
    },
    {
        "comment": "Yikes that's embarrassing hockey",
        "label": "NEG"
    },
    {
        "comment": "Jamie Benn gets close to the bowl and sniffs hard after he drops one",
        "label": "NEU"
    },
    {
        "comment": "wow that's excellent! I hope it makes you happy",
        "label": "POS"
    },
    {
        "comment": "It was a bullshit penalty and they scored off it. Not only did they score but it was the rat getting his 2nd of the night.",
        "label": "NEG"
    },
    {
        "comment": "Imagine getting 4 minutes for that....",
        "label": "NEG"
    },
    {
        "comment": "Respek for sure",
        "label": "POS"
    },
    {
        "comment": "Atta boy, Greggy",
        "label": "POS"
    },
    {
        "comment": "Juice personally likes playing more (according to an interview with him) but yeah he doesn't need to start every game for sure. I think Juice is just off to start the season. Could be adjusting to the new scheme. He always has a bit of a blunder to start off but by the end of the season he's elite. There's a good chance Lank is dealt at the deadline.",
        "label": "NEU"
    },
    {
        "comment": "That's 3 straight penalties. It got real physical, real quick here",
        "label": "NEU"
    },
    {
        "comment": "bullshit call",
        "label": "NEG"
    },
    {
        "comment": "Love ya forver Levi but we need more than 1/4 saves in the shootoutHell of a game. We deserved that win this one stings",
        "label": "NEU"
    },
    {
        "comment": "Kreider got me w that one",
        "label": "NEU"
    },
    {
        "comment": "I was one of them.  Had go canucks go chants in my section lol.",
        "label": "POS"
    },
    {
        "comment": "This. We just arent looking dangerous.",
        "label": "NEG"
    },
    {
        "comment": "YOU'VE GOT TO BE FUCKING KIDDING ME WTF",
        "label": "NEG"
    },
    {
        "comment": "Team played like shit but in what world is that not goalie interference?",
        "label": "NEG"
    },
    {
        "comment": "Literally like what are you doing in practice I want to see TEARS",
        "label": "NEG"
    },
    {
        "comment": "\"So the way you gotta deal with players like Hughes is commit blatant interference against 'em, because ya know the refs won't call it!\"What a joke of a commentator.",
        "label": "NEG"
    },
    {
        "comment": "I wore the ring! LGR! W!",
        "label": "POS"
    },
    {
        "comment": "Tarasov is a so hyped up to go in. His interview today he was ready to leap out of the locker room.",
        "label": "POS"
    },
    {
        "comment": "Is Luke Richardson actually dead and we're in a Weekend at Bernie's scenario?",
        "label": "NEU"
    },
    {
        "comment": "Did the color guy just say he didn't know what to say.... haha",
        "label": "NEU"
    },
    {
        "comment": "“Aw shucks we were so close to a playoff spot, too bad we pooped our pants for the first half of the season. Oh well, see you next year don't forget to renew your seasons”",
        "label": "NEG"
    },
    {
        "comment": "Fuck Carrier. What you doing bby",
        "label": "NEG"
    },
    {
        "comment": "You're wrong for one reason…. They push the offense when they're down goals. And they're constantly down goals from shit goaltending to start. When you play from behind on shit goals in the first 5 minutes it's easy to get caught cheating offensively.",
        "label": "NEG"
    },
    {
        "comment": "And like that we're second in the Pacific again.",
        "label": "POS"
    },
    {
        "comment": "Flames win a game they deserve to win challenge (impossible)",
        "label": "NEG"
    },
    {
        "comment": "Sucks to hear about Joey Kenward, get well soon!",
        "label": "NEG"
    },
    {
        "comment": "It's like they leave their brains in the room after the first intermission.  Every game.  That was a terrible change.",
        "label": "NEG"
    },
    {
        "comment": "We gotta invest in some balance training for Matty",
        "label": "NEU"
    },
    {
        "comment": "Toccet earn ur ice time is bullshit, Myers is useless, wtf was that in the corner",
        "label": "NEG"
    },
    {
        "comment": "Miro My Hero 🥅🥅🍎  Finnish Sniper 🥅🍎  🤖 🐼🍎  Bobby Hintz 🍎🍎  Man of Steel 🍎🍎  🇳🇱 🥅  Joe \"Just the Tip\" Pavelski 🥅  Oh Captain 🍎  Jani Hockeypuck 🍎  Hanley 🍎  Sexxy Seggy 🍎",
        "label": "POS"
    },
    {
        "comment": "I feel like we should have more goals than this the way both teams are playing…",
        "label": "NEU"
    },
    {
        "comment": "ROBOOOOOOOOOOO WE'RE WINNING THE CUUUUUUP",
        "label": "POS"
    },
    {
        "comment": "I mean, you really have to hope Kuzmenko returns to form and thus Petey's wing.",
        "label": "NEU"
    },
    {
        "comment": "Ok if we could play every period like this one I'd be pleased. Don't care if it's 2-0 us or them, this effort is incredible. So pleased.Vlasic will be in Norris conversations at some point in his career",
        "label": "POS"
    },
    {
        "comment": "David Alter tweeted that Gregor-Kampf-Reaves had an expected goals of 98% tonight. Kampf got one at 5v5, and Gregor got a shorty (on PK but technically 2 goals from 4th line)They looked great out there! I'm pretty sure Keefe closed out the 2nd and 3rd with the fourth line out there, and they had chances all night without giving up much of anything.",
        "label": "NEU"
    },
    {
        "comment": "HYNES CAM",
        "label": "NEU"
    },
    {
        "comment": "Wow what a terrible call....again",
        "label": "NEG"
    },
    {
        "comment": "Ofc it's being challenged 🥲",
        "label": "NEU"
    },
    {
        "comment": "Quinn Hughes is just too good man… if Luke can become near that level we'll be fine",
        "label": "POS"
    },
    {
        "comment": "LETS GO JOEY",
        "label": "POS"
    },
    {
        "comment": "Boesers gonna score 3 this game to taka back his title from Matthew's 💪💪",
        "label": "POS"
    },
    {
        "comment": "Don't pressure the puck up high, don't pressure the puck down low. The assignment truly seems to be to just kinda stand in the middle and chill.",
        "label": "NEU"
    },
    {
        "comment": "William Borgen lol",
        "label": "NEU"
    },
    {
        "comment": "Anyone else kinda okay with losing but playing hard and seeing the kids do well?",
        "label": "NEU"
    },
    {
        "comment": "He's just sick",
        "label": "NEU"
    },
    {
        "comment": "By speaking about liking someone for their skill and charisma and how well they do their job, instead of finding something to complain about because we have to be constantly angry about sports? I am clearly not looking for the same kind of thing you are in a play-by-play guy. I want a good voice and a talent for exciting calls. Perhaps you want a homer who cheers when his team scores and is unhappy when the other team scores. Perhaps you want someone like Jack Edwards who will defend the dirty plays of your team and rant about the dirty plays of the opposition. I cannot stand those guys.Maybe I am in the minority on a Leafs subreddit, but fortunately, in the real world, the Leafs have such a huge fan base and practically every game is a national broadcast, so they will probably never get a homer calling the games. Being such a huge market, they tend to get the most skilled and sought after guys.",
        "label": "NEU"
    },
    {
        "comment": "FUCK YEAH JOEY",
        "label": "POS"
    },
    {
        "comment": "Wait. What happened to Woll?",
        "label": "NEU"
    },
    {
        "comment": "We look like we don't belong here",
        "label": "NEG"
    },
    {
        "comment": "Hahah I should follow in your footsteps. It definitely is maddening. 😵‍💫",
        "label": "NEU"
    },
    {
        "comment": "Are you FUCKING JOKING",
        "label": "NEG"
    },
    {
        "comment": "Some losses you can walk away from feeling good about yourself. Not these losses. These are painful.",
        "label": "NEG"
    },
    {
        "comment": "Good kill.  Time to counter.",
        "label": "POS"
    },
    {
        "comment": "Do we think Otter has been playing hurt lately and it became more serious?",
        "label": "NEG"
    },
    {
        "comment": "There is no universe where we should have Juulsen in over Friedman. We have enough size on the back end with Myers and Myers lite. Let's put in a dman who can actually handle the puck",
        "label": "NEG"
    },
    {
        "comment": "Just don't even know what to say man. Sharks won 6-3 on 18 SOG, Devils only get 3 on 48. Someone's gotta get fired. Golden opportunity to get into a WC spot and we blow it. Absolutely fucking unacceptable.",
        "label": "NEG"
    },
    {
        "comment": "WHO ELSE BUT HUGHES",
        "label": "POS"
    },
    {
        "comment": "Shorty time",
        "label": "NEU"
    },
    {
        "comment": "Miller is a truck 🛻",
        "label": "POS"
    },
    {
        "comment": "Maybe we need our teeth kicked in for a month straight to wake up",
        "label": "NEG"
    },
    {
        "comment": "Don't understand fake going to his glove then go back the other way. Easy from my couch to say that though",
        "label": "NEU"
    },
    {
        "comment": "He's a beast on the PK is the only reason he stays in I think. Everyone else on the right side is a tire fire and Soucy is injured. Need Bear and another depth body there.",
        "label": "NEU"
    },
    {
        "comment": "I think they'd focus on a defenseman if a move were to happen",
        "label": "NEU"
    },
    {
        "comment": "Did you watch the playoffs in 2003?",
        "label": "NEU"
    },
    {
        "comment": "I know we're all frustrated with recent happenings, but can we take a second to appreciate Thomas? Guy has won nearly 60 percent of FO this year and has had an inconsistent line all year. Averaging a ppg. Loving his play!!",
        "label": "POS"
    },
    {
        "comment": "\"The Bruins have been gifted the puck at times ...\"   - you ain't kiddin', Dan",
        "label": "POS"
    },
    {
        "comment": "Too many turnovers in our own zone",
        "label": "NEG"
    },
    {
        "comment": "Good win boys. That's all, that's it. String together a few and we'll talk more.",
        "label": "POS"
    },
    {
        "comment": "Get fuuuuucked ungulates.P.S. YOLOnen is one beautiful kid. Such cold-blooded shootout specialist.",
        "label": "POS"
    },
    {
        "comment": "Wrong side Grundy-not the glove man. Should have taken to the net.",
        "label": "NEG"
    },
    {
        "comment": "We Coyotes fans can have a little winning, as a treat",
        "label": "POS"
    },
    {
        "comment": "A good omen! When the sub is doom and gloom we play well.",
        "label": "POS"
    },
    {
        "comment": "If anyone is snakebitten on this team it's been Slafkovsky. He's been creating some amazing chances for his linemates, and opens up *SO MUCH* room for them. Almost a guarantee to come out of the boards with the puck. Shockingly, Caufield and Suzuki look a step behind Slaf, lol.",
        "label": "POS"
    },
    {
        "comment": "Gotta keep taking it to them guys. Don't let off the gas.",
        "label": "POS"
    },
    {
        "comment": "Petition the league to make games only 2 periods.",
        "label": "NEU"
    },
    {
        "comment": "This team doesn't deserve playoffs",
        "label": "NEG"
    },
    {
        "comment": "This season the habs basically lose one /win one /repeat. No upswings, just plain boring average. I just can't convince myself to bother watching the games. I guess this type of consistency is somewhat promising for building something long term, though the habs fan in me needs a 4 games winning streak or something with an insane Caufield Suzuki display of dominance, even if it means losing the 4 following games lmao.",
        "label": "NEU"
    },
    {
        "comment": "Green onion crepes with a lettuce wrap type filling.",
        "label": "NEU"
    },
    {
        "comment": "Yup I checked out a few games ago.  Sometimes I come in a catch the last part of a game but we don't have many exciting players.  It's not fun.",
        "label": "NEG"
    },
    {
        "comment": "What the fuck is going on here?",
        "label": "NEG"
    },
    {
        "comment": "Why the fuck is Anthony Manthony so productive now",
        "label": "POS"
    },
    {
        "comment": "I am going to have this ESPN+ commercial burned into my brain by the time this season is over",
        "label": "NEG"
    },
    {
        "comment": "Here we go again 🤞🤞",
        "label": "POS"
    },
    {
        "comment": "So much for us shooting the puck on this power play.",
        "label": "NEG"
    },
    {
        "comment": "How bout a Binner Goal here up by 2!",
        "label": "POS"
    },
    {
        "comment": "GRRRRUUUUUUUUUUUU",
        "label": "NEU"
    },
    {
        "comment": "They've had some serious injury issues. Having both their 1C and 2C out would cripple any team",
        "label": "NEG"
    },
    {
        "comment": "Good shot Kreids ends up topping the all time PP goal scorer list",
        "label": "POS"
    },
    {
        "comment": "#BACKLUUUUUND",
        "label": "POS"
    },
    {
        "comment": "If you get absolutely trashed at a game you'll realize how it's actually an elite goal song",
        "label": "NEU"
    },
    {
        "comment": "He's just so small for a goaltender is the problem",
        "label": "NEG"
    },
    {
        "comment": "To be honest I get it. Our division is hilariously competitive and a few losses earlier in the season that we could have won definitely an be the difference between making the playoff or not.",
        "label": "NEG"
    },
    {
        "comment": "Why the fuck did they start OT like they were playing a penalty kill?No offense at all, that was pathetic.",
        "label": "NEG"
    },
    {
        "comment": "I'm getting PTSD fladshbacks from last game...",
        "label": "NEG"
    },
    {
        "comment": "I never notice him, which is good with a defenseman.",
        "label": "POS"
    },
    {
        "comment": "Zero effort on defense from Ovie there",
        "label": "NEG"
    },
    {
        "comment": "We'll either win tonight and lose on Wednesday, or lose tonight and win our next two. Gotta keep the .500 pattern going",
        "label": "NEU"
    },
    {
        "comment": "#FUCK YES",
        "label": "POS"
    },
    {
        "comment": "christ almighty just shoot!!! ffs",
        "label": "NEG"
    },
    {
        "comment": "I have no problem with how the leafs played in this game. Take the point and move on to the next. Happy for JT",
        "label": "POS"
    },
    {
        "comment": "Elite poke by Fleury.",
        "label": "POS"
    },
    {
        "comment": "According to some comments we should already be selecting the \"Forfeit\" option.",
        "label": "NEG"
    },
    {
        "comment": "Cheers homie. Hope Larkin comes back and doesn't miss a beat",
        "label": "NEU"
    },
    {
        "comment": "Thank you for giving me some hope",
        "label": "POS"
    },
    {
        "comment": "Beauty of a keep in at the blueline by zary",
        "label": "POS"
    },
    {
        "comment": "My body isn't ready for the amount of dump and chase that is about to come",
        "label": "NEG"
    },
    {
        "comment": "hockey is fun in vancouver again as lu said!",
        "label": "POS"
    },
    {
        "comment": "So do they just not practice shooting? No one can hit the net ever. The Knights could pull the goalie and the Blues still wouldn't score.",
        "label": "NEG"
    },
    {
        "comment": "Maybe Toews shouldn't put his face there",
        "label": "NEU"
    },
    {
        "comment": "my football is straight up trash and doomed to fail so seeing these sharks make hockey fun is a godsend. I love the sharks so damn much lol.",
        "label": "POS"
    }
]