[
    {
        "comment": "Won't blame Clifton for that one. Puck is in front of your net, you clear it right away. It just ended up right on Barbashev's stick.",
        "label": "NEU"
    },
    {
        "comment": "Panarin Scoring goals while crashing the net. This dude is absolutely a different player this year.",
        "label": "POS"
    },
    {
        "comment": "Mirpalicious",
        "label": "POS"
    },
    {
        "comment": "Dahlin with help of the 4th line",
        "label": "NEU"
    },
    {
        "comment": "\"Get outta here, pipsqueak!\"",
        "label": "NEG"
    },
    {
        "comment": "Honestly i shouldve kept it on after watching last night game where we almost came back too.",
        "label": "NEU"
    },
    {
        "comment": "I know this isn't a hot take but these commentators are really boring and uninteresting to listen to, makes it hard to watch tbh",
        "label": "NEG"
    },
    {
        "comment": "Love you Yanni",
        "label": "POS"
    },
    {
        "comment": "being a buffalo sports fan has been really good for me, i became good at being able to just emotionally step away from something rather than get upset about it and that came in handy when i was divorcing my first wife. thank you Sabres, i appreciate you",
        "label": "POS"
    },
    {
        "comment": "Any mention on Perron's egregious, attend to injure Zub?!?Of course not that was just a player sticking up for his teammate, while attempting to severely injured another player.",
        "label": "NEG"
    },
    {
        "comment": "It's literally every single game we have a lead entering the third period.What the *fuck* is wrong with this team?!",
        "label": "NEG"
    },
    {
        "comment": "Their inability to consistently score on 5 on 5 is so interesting",
        "label": "NEG"
    },
    {
        "comment": "I'm nervous because 11-29 have been consistently on our worst defensive lines and we just maybe made them worse in that end. Gonna need to get these three early offensive zone time and puck rhythm and get them out there with the right D pairing.",
        "label": "NEG"
    },
    {
        "comment": "Mortgage 👏 Your 👏 Future 👏",
        "label": "NEU"
    },
    {
        "comment": "This has to be the worst possible outcome to teach Kuzy a lesson. This game is the turning point to the season, they will start getting results that align with their awful play.",
        "label": "NEG"
    },
    {
        "comment": "Really wish the Dadonov/Benn/Johnston would lock fully into gear. They've done well enough (especially Johnston) but the way they were dominating in the last 30 games + playoffs last year makes me think this team still isn't even close to their maximum offensive potential.Let's start the week off right tonight, Go Stars!",
        "label": "POS"
    },
    {
        "comment": "no man, this team isn't making playoffs.. we want exciting games but losses",
        "label": "NEG"
    },
    {
        "comment": "Stupid penalty, lose faceoff, get scored on first attempt. Ez pz",
        "label": "NEG"
    },
    {
        "comment": "Ah rip that sucks. MSG ain't worth paying for at all lol",
        "label": "NEG"
    },
    {
        "comment": "Awoooo 🐺",
        "label": "POS"
    },
    {
        "comment": "Rock sounds alive now!Keep it the fucking going!",
        "label": "POS"
    },
    {
        "comment": "Kadri!",
        "label": "POS"
    },
    {
        "comment": "2 minutes for falling over. Bread wouldn't ever play.",
        "label": "NEG"
    },
    {
        "comment": "Hand passes are allowed in defensive zone, subtle exception to the rule.",
        "label": "NEU"
    },
    {
        "comment": "We can stock their vending machine for a year as well",
        "label": "NEU"
    },
    {
        "comment": "What a play yegor",
        "label": "POS"
    },
    {
        "comment": "Lmao marky",
        "label": "NEU"
    },
    {
        "comment": "ELVIS THANK YOU SO FUCKING MUCH GOOD GOD WAKE UUUUUUUUUUUUUUUUUUUUUPPPPPPPPPPPPPPPPPPPPPPPPP",
        "label": "POS"
    },
    {
        "comment": "Pretty frustrated at how atrociously the team played in the 3rd. That's just unacceptable levels of sloppiness for a playoff contender. Yeah, we got fucked by the refs, but come on. This team should be able to protect a two goal lead. Frankly, this team has to score more than two goals against a team like the Islanders. Our defense and goaltending isn't supposed to be in charge of stopping everything, the offense needs to outscore our other issues. Kempe was beyond selfish in that OT and it cost us the game. That's very frustrating. You don't play run and gun hockey in 3 on 3. You prioritize possession and set something up. Kempe was so desperate to be the hero that he cost us the game, that is very hard to swallow. Sucks that the streak ends like that. Now we have to play the best team in hockey on a back to back with Copley in net. Really needed two points tonight. Good luck tomorrow, because on paper it looks real bad for us.",
        "label": "NEG"
    },
    {
        "comment": "Oh for sure. I've had no ill will towards the Sharks for a while now, but like you said, rooting for a team at the bottom of the barrel is easy.",
        "label": "NEU"
    },
    {
        "comment": "#TRADEBAITTHOMPSON",
        "label": "NEG"
    },
    {
        "comment": "I won't be at the game but I'll be rocking my Winter Classic Benn",
        "label": "POS"
    },
    {
        "comment": "Shots were 47-17, how can you argue this with a straight face",
        "label": "NEG"
    },
    {
        "comment": "Kane looking good for the Wings.   Wings are pretty fun to watch.",
        "label": "POS"
    },
    {
        "comment": "it's entirely reddits fault for removing live view but i think it has to be done!",
        "label": "NEG"
    },
    {
        "comment": "#MARCHY!!!!",
        "label": "POS"
    },
    {
        "comment": "pffft, lol okay. Stick to those guns. How he is in the room, at this point, is just as, if not arguably more important than how he is on the ice. Same goes for guys like Foligno or Perry. You think nearly any other team would be cool with spending 4 million in cap space for those guys if they WERENT in a situation like the Hawks and looking more for guidance than point production? That's all this season is about dude. You and a LOT of other people aren't looking at this season with the right lens.",
        "label": "NEU"
    },
    {
        "comment": "CALGARY FLAMES ONLY PLAYS IN THE 3RD PERIOD",
        "label": "NEG"
    },
    {
        "comment": "Jamie Benn eats other people's food in the communal fridge",
        "label": "NEG"
    },
    {
        "comment": "Players have given up. This is pure Larsen bullshit, they stopped caring and now they're crumbling. 7 fucking goals conceded, twice tonight we eat 3 unanswered. A joke is funny. This isn't even funny, it's an absolute disgrace.",
        "label": "NEG"
    },
    {
        "comment": "#MATT GOALDY",
        "label": "POS"
    },
    {
        "comment": "That would basically be a rebuild",
        "label": "NEU"
    },
    {
        "comment": "3-5 record is fine on what is essentially a coin flip",
        "label": "NEU"
    },
    {
        "comment": "Retaliation spear on Marchment, nothingn",
        "label": "NEU"
    },
    {
        "comment": "STOP! MAKING! BINNER! DO! ALL! THE! WORK!",
        "label": "NEG"
    },
    {
        "comment": "hey I mean the sweater still slaps",
        "label": "POS"
    },
    {
        "comment": "Reichel's pass first mentality would go great with Bedards shoot first mentality! But for real, if you want to give Reichel a little confidence boost I think you go back to that for a few games",
        "label": "POS"
    },
    {
        "comment": "Kuzy is a major liability & I see why no other team wants him.",
        "label": "NEG"
    },
    {
        "comment": "Matt Boldy has soft hands apparently",
        "label": "NEU"
    },
    {
        "comment": "BENSON YOU ARE FUCKING AMAZING.",
        "label": "POS"
    },
    {
        "comment": "Top 6 is basically dormant right now. 44 shots against is also unacceptable.",
        "label": "NEG"
    },
    {
        "comment": "Question for whomever is doing media availability, how many times does Boston have to slap you around before you stop playing this “Gentlemans agreement.” Game? What does a team have to do to this group to get emotion out of them?",
        "label": "NEG"
    },
    {
        "comment": "Guy that Igor got the stop on is the same dude who Vinny facewashed. Not the best night for him lol",
        "label": "NEG"
    },
    {
        "comment": "Love \"Hockeypuck\"! You're probably to young to remember the Greek singer Yanni, but Yanni Hockeypuck is what I \"read.\"",
        "label": "POS"
    },
    {
        "comment": "LaPanta did this",
        "label": "NEU"
    },
    {
        "comment": "He's had a bad game every game he's played this year except maybe two? Against Nashville where he only faced 18 shots, and then against Boston. Outside of that he's been sub-NHL.",
        "label": "NEG"
    },
    {
        "comment": "Only one person is and I'm curious why too.",
        "label": "NEU"
    },
    {
        "comment": "That was unexpected.Especially on the PP drop pass",
        "label": "POS"
    },
    {
        "comment": "I don't get why the Sen's media doesn't start complaining.   Its not their job to suck up to the ownership.  Its their job to point the problems with the team.",
        "label": "NEG"
    },
    {
        "comment": "Sammy might as well just sit in the middle of the goal and not move. He'd probably save as many shots as he does now.",
        "label": "NEG"
    },
    {
        "comment": "Woo! Eat shit Cousins!",
        "label": "POS"
    },
    {
        "comment": "Yeah this is most definitely what it's like to have a good coach. Weird feeling.",
        "label": "NEU"
    },
    {
        "comment": "We need to get back to letting our defensive systems making it not matter who's in net.Trying to string a few together is difficult but we can't be relying on god tier goaltending. Our defense needs to get it together.",
        "label": "NEU"
    },
    {
        "comment": "Luuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu",
        "label": "NEU"
    },
    {
        "comment": "Anddd there it is.",
        "label": "NEU"
    },
    {
        "comment": "I'll take the point and hope for better starts in the future. Proud of the boys for pushing it to OT/Shootout territory.",
        "label": "POS"
    },
    {
        "comment": "Did he say the S word again?",
        "label": "NEG"
    },
    {
        "comment": "This scouting this is going nuts. We have guys at the Caps' road games, Edmonton has been living here essentially…. Just make a move already!!!",
        "label": "NEG"
    },
    {
        "comment": "Alexis looks just like his dad, crazy how genetics work",
        "label": "NEU"
    },
    {
        "comment": "Shango that was filthy",
        "label": "POS"
    },
    {
        "comment": "Vitek point in the OT winner",
        "label": "NEU"
    },
    {
        "comment": "Honestly 😂",
        "label": "NEU"
    },
    {
        "comment": "Being ranked 30th (maybe worse now) in 2nd period GA is probably the most DJ Smith stat of all",
        "label": "NEG"
    },
    {
        "comment": "Ooops…",
        "label": "NEU"
    },
    {
        "comment": "We're rent free boys!",
        "label": "NEU"
    },
    {
        "comment": "pp1 looking good",
        "label": "POS"
    },
    {
        "comment": "Wtf am i even watching how are we the top team in the conference?",
        "label": "NEG"
    },
    {
        "comment": "He lost his speed so regrouped instead of trying to do a flat footed 1v1 on the end of his shift",
        "label": "NEU"
    },
    {
        "comment": "Once again, Myers fucks this team and kills all momentum. That 2-1 goal deflated us.",
        "label": "NEG"
    },
    {
        "comment": "Truly!!! Our guys are too often acting individually, egotistically, opportunistically and not as a team. What's the use in getting twice the number of SOGs if your shots aren't quality attempts? Granted there's a balance between opportunity and teamsmanship but holy heck we gotta get some more action out there with the puck. Basics man, BASICS!",
        "label": "NEG"
    },
    {
        "comment": "#WWWWWWWEEEEEEEEEEGAAAAAAAR",
        "label": "POS"
    },
    {
        "comment": "Oh MY LEVI",
        "label": "POS"
    },
    {
        "comment": "If Sunny is hurt, I'm going to be very sad.",
        "label": "NEG"
    },
    {
        "comment": "Shari keep shooting. All the time.",
        "label": "NEU"
    },
    {
        "comment": "Sure look like it hit a stick to me",
        "label": "NEU"
    },
    {
        "comment": "We talk about Vegas being first in the division , LA is dominating Montreal right now, someone's gotta stop them",
        "label": "NEU"
    },
    {
        "comment": "Myers extension incoming",
        "label": "NEU"
    },
    {
        "comment": "Lol good luck",
        "label": "NEU"
    },
    {
        "comment": "Fart gate💀",
        "label": "NEG"
    },
    {
        "comment": "Well the lines were just posted in the pregame, Fantilli is back with Johnson and Bemstrom and the top line is now Johnny Danforth Laine",
        "label": "NEU"
    },
    {
        "comment": "Glad that Hoggy gets rewarded for his effort in this game",
        "label": "POS"
    },
    {
        "comment": "Minnesota fan coming here in peace. Y'all are so cheeky for shouting \"C\" during the US national anthem lol. I just wanted to say that I love our international anthem ceremonies in the NHL. I almost cry every time I hear \"O, Canada\". I've only been watching NHL a short time, but this is one of my favorite parts hands down. Good luck tonight and I hope we have a great game.",
        "label": "POS"
    },
    {
        "comment": "HeroinBy the time you kick it and return to society, the Flames will have finished their rebuild",
        "label": "NEG"
    },
    {
        "comment": "We took away NJD's lead but choked a chance to win it. We choked away a lead and won vs CAR. This team, man. I love and hate this team. A W is a W so I'm super happy about it. Onto Tampa and Florida. I know we didn't have a good showing IN Tampa vs them, but hopefully Tuesday will be a great challenge for this team. And hopefully we don't shit the bed on Luongo ROH night 🫣",
        "label": "POS"
    },
    {
        "comment": "We're getting some real downvoting something or other tonight. Only downvote if you hate the USA! Or Canadian hockey players! Or pasta?! Cheese?!",
        "label": "NEG"
    },
    {
        "comment": "I think it has something to do with the home team choosing the players of the game.",
        "label": "NEU"
    },
    {
        "comment": "Can't eat 5 goals and expect to win. This team has a serious D issue.",
        "label": "NEG"
    },
    {
        "comment": "League not ready for the Bedard, Beauvillier combo!!!!!",
        "label": "POS"
    },
    {
        "comment": "LOL BOB OOPS",
        "label": "NEU"
    },
    {
        "comment": "I know it's heresy to call out the coach in a rebuild but we really do need to start taking a little more look at MSL ice time allocations and lines.",
        "label": "NEU"
    },
    {
        "comment": "Can't find a better teeeeeam",
        "label": "POS"
    },
    {
        "comment": "So when are we going to get that make up call back, stripes??",
        "label": "NEG"
    },
    {
        "comment": "Boston had to have paid them off or something cuz 2 of the PP goals for them came from soft as shit calls.",
        "label": "NEG"
    },
    {
        "comment": "He gives off “that guy” vibes.",
        "label": "NEU"
    },
    {
        "comment": "I liked him last year. He plays hard and has skills.",
        "label": "POS"
    },
    {
        "comment": "Fuck :(",
        "label": "NEG"
    },
    {
        "comment": "i think moving kuzy is the best for both worlds. we move his big ole contract while opening a spot for a younger skater, while kuz would get the fresh start he might need. hes requested a trade already so it should be too difficult",
        "label": "POS"
    },
    {
        "comment": "Can't be competitive if you can't beat competitive 🤷🏽‍♂️",
        "label": "NEU"
    },
    {
        "comment": "LUUUUUUUUUUUUUUUUU",
        "label": "NEU"
    },
    {
        "comment": "5 fingered palm of death.",
        "label": "NEG"
    },
    {
        "comment": "Boys twiddling our thumbs with these plays here",
        "label": "NEU"
    },
    {
        "comment": "Suzuki and Caufield struggling heavily currently. Need to find a way to snap out of it",
        "label": "NEG"
    },
    {
        "comment": "This has been a very fun game to watch",
        "label": "POS"
    },
    {
        "comment": "that quick glove slave was so casual it's almost insulting, and then he does that",
        "label": "POS"
    },
    {
        "comment": "Well, that got dramatic at the end.",
        "label": "NEU"
    },
    {
        "comment": "yea that also leaves out that Mika's worst season was still better than Kakko's best, and he plays a far more demanding position.  They are not even remotely comparablewhich of these guys are you not resigning to resign a second overall pick on pace for 12pts 1/4 of the way through the season:LAF, Key, Lindgren, Gus, Schnieder, Jones, Cuylle",
        "label": "NEG"
    },
    {
        "comment": "Tkachuk on Korpi was deliberate but subtle. Kubalik on Shesterkin was unintentional but painfully obvious. The latter will always get called.",
        "label": "NEG"
    },
    {
        "comment": "I don't care what the stats say, when Sam says \"IT'S A POWER PLAY GOAL\"', it's a powerplay goal.",
        "label": "NEU"
    },
    {
        "comment": "Suck a fat one st. Louis.",
        "label": "NEG"
    },
    {
        "comment": "This happens anytime kadri or huby are in involved in any goal.",
        "label": "NEU"
    },
    {
        "comment": "Sooo back to 11/7?",
        "label": "NEU"
    },
    {
        "comment": "I don't understand this take. He's constantly getting and creating chances and most of the time is the one keeping it alive in the opposition's end.",
        "label": "NEU"
    },
    {
        "comment": "They have the worst goaltending in the league, they need to make a fix and fast, they can't afford to waste a year outside the playoffs for McDavid and Draisaitl, times running out on their contracts too. Teams get desperate plus we can retain his salary. They could be looking at defense too but not sure who would provide them a solution. Gudbranson has been serviceable this year, maybe him.",
        "label": "NEG"
    },
    {
        "comment": "This effort is fucking gross lmao",
        "label": "NEG"
    },
    {
        "comment": "I guess we can't complain it was too long",
        "label": "NEU"
    },
    {
        "comment": "Thank you for the Oiler fanboi perspective",
        "label": "POS"
    },
    {
        "comment": "That call was absolutely criminal",
        "label": "NEG"
    },
    {
        "comment": "Win one for shilly",
        "label": "POS"
    },
    {
        "comment": "I'm really not trying to be mean, but is there a reason Wes has not been replaced yet? Maybe it's just me, but hearing him constantly stumble over his words on phrases he has said 100 times is so grating to listen to.",
        "label": "NEG"
    },
    {
        "comment": "Yotes haters don't know what to do. Boy I'd love to see the Mullet host the playoffs",
        "label": "POS"
    },
    {
        "comment": "At least sit and watch a game or two.",
        "label": "NEU"
    },
    {
        "comment": "Fucking Laine.",
        "label": "NEG"
    },
    {
        "comment": "Looking pretty good so far despite this penalty",
        "label": "POS"
    },
    {
        "comment": "Bedard is 18",
        "label": "NEU"
    },
    {
        "comment": "Better off honestly",
        "label": "POS"
    },
    {
        "comment": "Solid reference.",
        "label": "NEU"
    },
    {
        "comment": "Top titty Sharangovich",
        "label": "POS"
    },
    {
        "comment": "As Chief walks into the locker room, the din of a multitude of conversations dim to absolute silence. He spits his gum out in a nearby trash can and begins to speak.\"WAKE THE FUCK UP!\" He takes a fresh stick of gum out of his pocket, unwraps it, and throws the wrapper away as he begins chewing the new piece. He thinks about giving the trash can his usual kick across the locker room, but he's lost the energy, and the will. The team will either motivate themselves or they will not, he thinks to himself, no matter what he says or does anymore. He knows this is the experience of Blues Hockey.",
        "label": "NEU"
    },
    {
        "comment": "We started great, but we are unfortunately tied. This is definitely a must win game.",
        "label": "NEG"
    },
    {
        "comment": "I'd saw off my own leg to get Marco that hatty",
        "label": "NEU"
    },
    {
        "comment": "I thought the same thing. I guess when you're scratched you just show up around 7 o'clock. Lol",
        "label": "NEU"
    },
    {
        "comment": "I dunno man we are something fucked like 17-0 when taking a lead into the third. I think i'll let them do their thing",
        "label": "NEG"
    },
    {
        "comment": "Let's just win it all this year. Why not?",
        "label": "POS"
    },
    {
        "comment": "Remember when Sam Bennett tuned up Josh Manson? Pepperidge Farm remembers",
        "label": "NEU"
    },
    {
        "comment": "Would be nice if we could get it out of our own zone",
        "label": "NEG"
    },
    {
        "comment": "The twin towers got to be separated. My heart can't take it.",
        "label": "NEG"
    },
    {
        "comment": "Tomorrow can't come soon enough",
        "label": "POS"
    },
    {
        "comment": "Our D have scored a lot of goals in this season. In terms of scoring, our D might be one of the best in the League. Unfortunately, our D aren't so good in defense, and our O sucks at offence.",
        "label": "NEG"
    },
    {
        "comment": "what a response. The key to success, is to give it to the dman named Key.",
        "label": "POS"
    },
    {
        "comment": "Dewar hat trick is comingHe can't just score 1",
        "label": "NEU"
    },
    {
        "comment": "That's how I felt against Winnipeg last week.",
        "label": "NEU"
    },
    {
        "comment": "I remember when hockey players used to be tough",
        "label": "NEG"
    },
    {
        "comment": "Pull Saros",
        "label": "NEG"
    },
    {
        "comment": "Myers and Zadorov played an excellent game",
        "label": "POS"
    },
    {
        "comment": "This will continue to happen all season. They've changed nothing.",
        "label": "NEG"
    },
    {
        "comment": "YOU HAVE TO FUCKING SHOOT THE DAMN THING TO SCORE",
        "label": "NEG"
    },
    {
        "comment": "A habs pp at a crucial moment in the game?? Time for the worst hockey you've ever seen",
        "label": "NEG"
    },
    {
        "comment": "To be fair, I didn't think they were a true top contender this year even before the season. Just too damn young still. Don't get me wrong, they are very much underperforming, but I would be happy with a series win, maybe 2, in the playoffs again.",
        "label": "NEG"
    },
    {
        "comment": "When you're 18-4, on the road, you're going to get the other teams best shot. Especially a team like the Sens",
        "label": "NEU"
    },
    {
        "comment": "I hate that I love him so much.. as a Xhekaj fanboi.",
        "label": "POS"
    },
    {
        "comment": "Jack my man",
        "label": "POS"
    },
    {
        "comment": "Can I just say… I fucking love Benoit",
        "label": "POS"
    },
    {
        "comment": "I wouldn't want to be in a VGK sweater in that arena right now.",
        "label": "NEG"
    },
    {
        "comment": "He's so damned good at it.",
        "label": "POS"
    },
    {
        "comment": "Now that, was Kraken hockey, baby.",
        "label": "POS"
    },
    {
        "comment": "YAYgor SharanGOvich!!!",
        "label": "POS"
    },
    {
        "comment": "This team needs to send a bunch of players on a Viking cerimonial funeral pyre down the Chicago River. It'll need to be sturdy, because it's a lot of people.",
        "label": "NEU"
    },
    {
        "comment": "Definitely rooting for him. He just needs a confidence boost and score to get that fire started.",
        "label": "POS"
    },
    {
        "comment": "He deserves at least 3 and a half BJs",
        "label": "NEG"
    },
    {
        "comment": "On the bright side Nemec put up two pts in his first game, played 22 mins, and looked like one of our best D out there.",
        "label": "POS"
    },
    {
        "comment": "Weak",
        "label": "NEG"
    },
    {
        "comment": "I think this might get overturned and it hurts",
        "label": "NEG"
    },
    {
        "comment": "AYYYYY PAPI!",
        "label": "POS"
    },
    {
        "comment": "This regression is really interesting. Don't think anyone really expected another 100 point season but this team sucks. Should be sellers at the deadline and get the kids some reps.",
        "label": "NEG"
    },
    {
        "comment": "He's the only reason we got 1 point, let alone 2",
        "label": "POS"
    },
    {
        "comment": "Need our Captain to get us back in this game somehowLETS FUCKING GOOOOO! LGB 🎺 💙 🎺 💙 🎺",
        "label": "POS"
    },
    {
        "comment": "winning or losing, sam's hashtag cadillac trivia enthusiasm is always off the charts",
        "label": "POS"
    },
    {
        "comment": "RIP my Caps -1.5 bet. Willy's hatty dulls the pain!!",
        "label": "NEG"
    },
    {
        "comment": "Slaf is a fucking unit",
        "label": "POS"
    },
    {
        "comment": "New Jersey is so lucky to sign Jack Hughes before he broke out with 99 points. $8M cap until 2030. Absolutely insane value for a franchise center who is only 22.",
        "label": "POS"
    },
    {
        "comment": "These players don't live in a bubble. They talk to people and have the internet. They must know the fanbase is calling for Donnys head. They know that this kind of play quickly got kreuger fired (basically have the same record as we did under him). And this is the effort that shows up after getting stomped last night?  What is happening.",
        "label": "NEG"
    },
    {
        "comment": "I wonder what Collin Delia is doing right now?",
        "label": "NEU"
    },
    {
        "comment": "I think this is a turning point in the season. In the opposite direction",
        "label": "NEG"
    },
    {
        "comment": "Shoot the damn puck Boldy. Omg wow",
        "label": "NEG"
    },
    {
        "comment": ">  They beat playoff teams and get smoked by the bottom teams.There's that, and if we're being honest, Hofer has been wildly inconsistent. We had the same issue with Greiss in net last year. Sub-par play from our backup tender makes it harder to rest Binner and even harder to steal wins when he does rest. I'd like to say we'd prioritize shoring up that position sooner rather than later, but I have a feeling they're gonna stick with the kid.",
        "label": "NEG"
    },
    {
        "comment": "I'm tired of these ovi one timers that fly out of the zone when we're on the powerplay. Wastes so much time…",
        "label": "NEG"
    },
    {
        "comment": "Well it WAS a better start for us",
        "label": "POS"
    },
    {
        "comment": "Bench this second unit",
        "label": "NEG"
    },
    {
        "comment": "Not something we're used to as Golden Knights fans.",
        "label": "NEU"
    },
    {
        "comment": "Dropped the ball on CK. Buch was great but didn't break out until after a Ranger. Callahan was a favorite but not an elite point producer. All of the guys you listed are good hockey players, but none of them have been PPG players. Not to say those are easy to come by, but for an O6 team that has spent a lot of time losing… it's hard to fathom the level of high level forwards we have drafted and produced",
        "label": "NEG"
    },
    {
        "comment": "Stop I can't handle it",
        "label": "NEG"
    },
    {
        "comment": "Guys if the sharks can come back maybe we can too. Sigh",
        "label": "NEU"
    },
    {
        "comment": "Easy downvote, bud. Suter on the top pair is an atrocious choice that is an albatross around Miro's neck. It will probably hinder his development for a decade.",
        "label": "NEG"
    },
    {
        "comment": "Love that line. Voronkov is my favorite player on this team",
        "label": "POS"
    },
    {
        "comment": "And got his goals against under 3 recently too",
        "label": "POS"
    },
    {
        "comment": "ESA!!!",
        "label": "NEU"
    },
    {
        "comment": "First place",
        "label": "NEU"
    },
    {
        "comment": "Beauty!",
        "label": "POS"
    },
    {
        "comment": "Oh shit not a 7 minute. Fuck",
        "label": "NEG"
    },
    {
        "comment": "Agressive but arguably most unskilled PP unit I've ever seen in my life. Yolo looks like the only guy who can handle a puck.",
        "label": "NEG"
    },
    {
        "comment": "Bro high sticked his boy. Hope he's good",
        "label": "NEU"
    },
    {
        "comment": "BROTHER. Malkin literally picked up Savard's stick out of his hand and threw it on the ice. How in the world is that not holding the stick?",
        "label": "NEG"
    },
    {
        "comment": "Does anybody have stats for goodrow turnovers? Swear to god when he touches it i know the other team is getting it",
        "label": "NEU"
    },
    {
        "comment": "Maybe aside from the Sharks we hands-down have the worst defense in the leagur",
        "label": "NEG"
    },
    {
        "comment": "So fucking static",
        "label": "NEG"
    },
    {
        "comment": "You need glasses man",
        "label": "NEG"
    },
    {
        "comment": "We should give winning a try",
        "label": "POS"
    },
    {
        "comment": "Demko is locked in tonight, great positioning",
        "label": "POS"
    },
    {
        "comment": "Ok I'm shutting the fuck up now...",
        "label": "NEG"
    },
    {
        "comment": "WIDEWIDEWIDEWIDE",
        "label": "NEU"
    },
    {
        "comment": "Hope Trouba trucks Tom Wilson.",
        "label": "NEU"
    },
    {
        "comment": "I did like what I saw from Ryker…. So… that's a plus?!?",
        "label": "POS"
    },
    {
        "comment": "Put Quick in.",
        "label": "NEU"
    },
    {
        "comment": "I think Domi played a bit part also.",
        "label": "NEU"
    },
    {
        "comment": "I really wonder why some of you are even Devils fans with how much you hate this team",
        "label": "NEG"
    },
    {
        "comment": "We got our stoner everyone!!! What a massive assist from Eichel",
        "label": "POS"
    },
    {
        "comment": "I love this team so much.",
        "label": "POS"
    },
    {
        "comment": "They aren't wearing matching suits today :(",
        "label": "NEG"
    },
    {
        "comment": "I've got the city TV feed and the morons. Keep calling it cross check. I absolutely hate the Toronto broadcasters. They have nothing but bad things to say about Ottawa players. That was not a dirty play. MATTHEW Joseph was simply pushing them, and it went high, but there was no intent in injury was not a dirty play.The Sportsnet broadcasters are absolute morons",
        "label": "NEG"
    },
    {
        "comment": "Appears to be bean guac sour cream cheese and salsa",
        "label": "NEU"
    },
    {
        "comment": "Thanks Lou",
        "label": "POS"
    },
    {
        "comment": "Brendan Smith is one of fifteen people who still play Gears of War, like the original one from 2006.",
        "label": "NEU"
    },
    {
        "comment": "Yeah, no, he's cheap enough that anybody we replace him with will cost at least as much as him. He's perfect for a 13F.",
        "label": "NEG"
    },
    {
        "comment": "Domi never went off.  He was supposed to go off but just decided to stay on and the guy changing for him had to go off.  It's like YOU don't actually watch the game.",
        "label": "NEG"
    },
    {
        "comment": "Hopefully the smartwater works and you don't keep paying for it.",
        "label": "NEG"
    },
    {
        "comment": "I saw that 6 men on the ice from 10 miles awayOfficials: 🦓🙈🦓🙈🦓🙈🦓🙈",
        "label": "NEG"
    },
    {
        "comment": "Brutal goaltending holy 😭",
        "label": "NEG"
    },
    {
        "comment": "Win 7-2 just to fuck with us.",
        "label": "NEU"
    },
    {
        "comment": "This is all Panarin's fault. He doesn't have 6 points it's on him why we're losing 😤",
        "label": "NEG"
    },
    {
        "comment": "Elias Pettersson is saying \"Ya'll forget about me?\"",
        "label": "NEU"
    },
    {
        "comment": "Is there any info on Elvis' injury? I know the trainer was looking at his glove hand in the third against the Kings during a TV timeout.",
        "label": "NEU"
    },
    {
        "comment": "4-2 in our last 6",
        "label": "POS"
    },
    {
        "comment": "WE SCORED MORE THAN ONE GOAL! 🎉",
        "label": "POS"
    },
    {
        "comment": "Good times",
        "label": "POS"
    },
    {
        "comment": "I am still so mad the Rangers let him go as a rookie",
        "label": "NEG"
    },
    {
        "comment": "And if he gets the hatty, could incorporate that in.",
        "label": "NEU"
    },
    {
        "comment": "I wasn't able to watch but the app was going crazy haha",
        "label": "NEU"
    },
    {
        "comment": "Why take many shots when one do trick",
        "label": "NEU"
    },
    {
        "comment": "LET HIM FIGHT",
        "label": "NEU"
    },
    {
        "comment": "That's why I get mad if Joe gets mad because Joe is legit the least biased person ever",
        "label": "NEG"
    },
    {
        "comment": "Think they'll mind if I put the game on the boardroom TV while we meet?",
        "label": "NEU"
    },
    {
        "comment": "2nd period made driving in traffic waaaaaay more enjoyable; let's gooooooooooo",
        "label": "POS"
    },
    {
        "comment": "They didn't even try to score smh",
        "label": "NEG"
    },
    {
        "comment": "first line looking good, those PPs are better, more dynamic. it has to start producing goals !",
        "label": "POS"
    },
    {
        "comment": "Idk something about the team being young and injuries.",
        "label": "NEG"
    },
    {
        "comment": "Do we really only have 1.5 periods of hockey in us?",
        "label": "NEU"
    },
    {
        "comment": "3 games straight of continuous effort and drive? Is this the twilight zone?",
        "label": "POS"
    },
    {
        "comment": "Because of course. Geez, I hope we don't play the Isles soon.",
        "label": "NEG"
    },
    {
        "comment": "Yeah how is Zibby not getting a point there?",
        "label": "NEG"
    },
    {
        "comment": "Why is Suzuki so ass 😕",
        "label": "NEG"
    },
    {
        "comment": "lol Cozens",
        "label": "NEU"
    },
    {
        "comment": "Gorg and Gus doing the worm would be incredible",
        "label": "POS"
    },
    {
        "comment": "Big hit",
        "label": "NEU"
    },
    {
        "comment": "I didn't think we'd be able to after that shorty. But I'm also an idiot so ¯\\\\_(ツ)_/¯",
        "label": "NEG"
    },
    {
        "comment": "Leafs try to win a game in regulation challenge (impossible)",
        "label": "NEG"
    },
    {
        "comment": "AND WE'RE TIED",
        "label": "NEU"
    },
    {
        "comment": "How do you now score there ffs",
        "label": "NEG"
    },
    {
        "comment": "Mush-Duch-Seg line BUZZIN",
        "label": "POS"
    },
    {
        "comment": "Him Evans and Ylonen, hell even Dvorak look engaged. Everyone else looks fucking terrible right now.",
        "label": "NEG"
    },
    {
        "comment": "#WAH",
        "label": "NEU"
    },
    {
        "comment": "Shit it's almost like I keep saying \"We're overplaying Oettinger\" and he's suffering for it, but nooo, shout me down.I mean the entire team is playing mid af, but Oettinger doesn't look great when he gets overplayed like this. Seriously questioning PDB's ability to manage a teams minutes, pairings, and goalie starts.",
        "label": "NEG"
    },
    {
        "comment": "Better just be a one off rotation scratch for Tommer",
        "label": "NEU"
    },
    {
        "comment": "I hate that this team always plays against teams that are trying to use us as a rebound game after a losing streak, it mostly ends up in losses",
        "label": "NEG"
    },
    {
        "comment": "༼ つ ◕_◕ ༽つ STARS TAKE MY ENERGY ༼ つ ◕_◕ ༽ つ༼ つ ◕_◕ ༽つ STARS TAKE MY ENERGY ༼ つ ◕_◕ ༽ つ༼ つ ◕_◕ ༽つ STARS TAKE MY ENERGY ༼ つ ◕_◕ ༽ つ",
        "label": "NEU"
    },
    {
        "comment": "Petey looking invisible again",
        "label": "NEG"
    },
    {
        "comment": "That save!",
        "label": "POS"
    },
    {
        "comment": "Oh no did I hear Bill say one of the officials is Justin Kea?",
        "label": "NEU"
    },
    {
        "comment": "Kuby beating the useless allegations",
        "label": "POS"
    },
    {
        "comment": "Goonerdeau right in the middle of the scrum. Yes. Yes. This pleases me.",
        "label": "POS"
    },
    {
        "comment": "How do you score 3 unanswered goals and immediately lose all momentum and stop playing hockey",
        "label": "NEG"
    },
    {
        "comment": "Kyrou scored and immediately lost every other hockey ability and is now back on the shit list lol",
        "label": "NEG"
    },
    {
        "comment": "And back to the wings game.",
        "label": "NEU"
    },
    {
        "comment": "Loved PDGs early season contributions but it's pretty clear his time is up on that line",
        "label": "POS"
    },
    {
        "comment": "Alright now we need Armia to do another one",
        "label": "NEU"
    },
    {
        "comment": "Win or lose, they've shown us that they are exactly where they belong at the bottom of the standings.",
        "label": "POS"
    },
    {
        "comment": "Let's get Savarded (hah)Let's get Savarded (in here)",
        "label": "POS"
    },
    {
        "comment": "It's a micro pp",
        "label": "NEU"
    },
    {
        "comment": "Brodz might just deserve a full time job with the big squad.",
        "label": "POS"
    },
    {
        "comment": "NO WOLL NO DONT BE HURT AHHHHHHHH",
        "label": "NEG"
    },
    {
        "comment": "Don't boo for Z, cheer for the flames. Winning is the best revenge",
        "label": "POS"
    },
    {
        "comment": "Brady falls on a breakaway chance and then takes a completely unnecessary penalty. Just WHY.",
        "label": "NEG"
    },
    {
        "comment": "Advertisers have figured that their sisters and moms can act better",
        "label": "NEU"
    },
    {
        "comment": "I'm only going Tuesday if Driedger gets the start. I would prefer he not because I have a math final on Wednesday 😂 but he can start anytime after that 😂",
        "label": "NEU"
    },
    {
        "comment": "Nah, Komisarek was as defensive a defenseman as there ever was (14G, 81 pts in 551 regular season games=.147 ppg). Struble has much better offensive skill. Small sample size, but he's nearly 2X Komisarek's PPG and already has 14% the number of career goals Komisarek had, in 2% the number of games. In other words, 7X Komisarek's career GPG.",
        "label": "POS"
    },
    {
        "comment": "Faulk looks like he belongs in an 80s cop movie",
        "label": "NEG"
    },
    {
        "comment": "Best moment in franchise history.",
        "label": "POS"
    },
    {
        "comment": "I think it's cause he was a bit dickish when asked about berube after the firing. Fans didn't like it",
        "label": "NEG"
    },
    {
        "comment": "Sure is a lot of blue in that \"sea of red\" lol",
        "label": "NEU"
    },
    {
        "comment": "Michkov is not a star lol",
        "label": "NEG"
    },
    {
        "comment": "LOOK AT BARKOV MAN!!!! SO INSPIRATIONAL 🥺",
        "label": "POS"
    },
    {
        "comment": "That was a confidence building (restoring) goal by Kuzy",
        "label": "POS"
    },
    {
        "comment": "Wow dumoulin is pure trash take him out…. He passed that directly to Ottawa right in front of goal",
        "label": "NEG"
    },
    {
        "comment": "Struble looks good.In fact, I'm old enough to have watched Mike Komisarek break in with the habs…he was really poised right from the start…that's who struble reminds me of",
        "label": "POS"
    },
    {
        "comment": "Again.  Jfc Lanky :(",
        "label": "NEG"
    },
    {
        "comment": "A win is a win is a win. Let's go boys!",
        "label": "POS"
    },
    {
        "comment": "ATTABOY",
        "label": "POS"
    },
    {
        "comment": "We really have to drag Ryan Miller here to watch this shit show? When he was on the team it was the last time I had genuine hopes for a championship.",
        "label": "NEG"
    },
    {
        "comment": "Announcers making excuses for why Bob let that goal in.",
        "label": "NEG"
    },
    {
        "comment": "Leafs played a solid game and started on time tonight.    That said, Nashville did not show up tonight.",
        "label": "POS"
    },
    {
        "comment": "These fans realize golden boy Robert Thomas is best friends with Kyrou right? You alienate one you alienate the other.",
        "label": "NEU"
    },
    {
        "comment": "He was putting up points to start the season, so I don't know how true that is. This team had no issue scoring goals and being good offensively to start the season. Pettersson is struggling, and whether that is him being hurt or him just not playing well, he needs to sit for a few games or so.",
        "label": "NEG"
    },
    {
        "comment": "Leetch. Park. James Patrick. And some dude I don't recall from back in the day.",
        "label": "NEU"
    },
    {
        "comment": "CBD! CBD!",
        "label": "POS"
    },
    {
        "comment": "Gus said Put her there pal",
        "label": "NEU"
    },
    {
        "comment": "Timo has lost all his confidence. He's gotta rip it there.",
        "label": "NEG"
    },
    {
        "comment": "Nvm Tex scores as I hit \"post\" lmao",
        "label": "NEU"
    },
    {
        "comment": "Thought my hopes couldn't get higher for Zary",
        "label": "NEU"
    },
    {
        "comment": "EXPERIENCE JACKETS HOCKEY",
        "label": "NEU"
    },
    {
        "comment": "Montembeault has turned into such a solid goalie. So much more calm in his demeanor and in control of his movements. Very Price-like in the crease in that sense. I'm really happy with the way he's progressed.",
        "label": "POS"
    },
    {
        "comment": "How long does this continue until he demands out of Buffalo?",
        "label": "NEU"
    },
    {
        "comment": "Every single time I've looked up at the clock there has been 8:30 left each periodWhat the actual fuck is this inception",
        "label": "NEG"
    },
    {
        "comment": "Great game. Man they played a full 60 tonight",
        "label": "POS"
    },
    {
        "comment": "best display of team defence so far",
        "label": "POS"
    },
    {
        "comment": "❤️🔥🧱 Vladar 🧱🔥❤️",
        "label": "POS"
    },
    {
        "comment": "Maybe pull the guy, yeah?",
        "label": "NEU"
    },
    {
        "comment": "None of these problems will be fixed this season. Sorry. This was never going to be the Cup winning year, what with our “star” dmen starting the year as a rookie and as an AHLer. Enjoy the wins we do get this year, which still may be a decent amount.",
        "label": "NEG"
    },
    {
        "comment": "Arghhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh",
        "label": "NEG"
    },
    {
        "comment": "Rough night for Kesselring",
        "label": "NEG"
    },
    {
        "comment": "Any team in nhl history lead the league in scoring and goals against?",
        "label": "NEU"
    },
    {
        "comment": "Recovering from minor surgery and not travelling out of the country for a bit.",
        "label": "NEU"
    },
    {
        "comment": "Just would have been nice to keep 2 points away from them after shutting them out for 40 minutes tonight with a 3 goal lead.Worst part is, the Kings are one of the only teams in the pacific I don't hats. Kopitar, Kempe, Fiala, Byfield, Danault. Lots of players I like. Doughty is a love/hate situation.",
        "label": "NEG"
    },
    {
        "comment": "I'M GOING TO SHIT MY PANTS",
        "label": "NEG"
    },
    {
        "comment": "#CHANDLER!!!",
        "label": "POS"
    },
    {
        "comment": "Well, terrible start, but nice comeback.  An enjoyable evening.  It's all we can ask for at this point.  Go Habs Go!!!",
        "label": "POS"
    },
    {
        "comment": "The way Dunner is playing it's almost he's like fuck it, I'll just do it all myself. Defend and take it down to try and score",
        "label": "NEU"
    },
    {
        "comment": "Welp.",
        "label": "NEU"
    },
    {
        "comment": "EMOTIONAL DAMAGE",
        "label": "NEG"
    },
    {
        "comment": "Two straight goals for Drew!!",
        "label": "POS"
    },
    {
        "comment": "Brock Booing Banned",
        "label": "NEU"
    },
    {
        "comment": "Eh they'll fuckin win like they'll get like 6 of 7 points next week and everyone will be back on board. This team is too inconsistent under granato to be anything other than a playoff hopeful. Granato wont get fired this year, he prolly stays in the summer, so there's that to look forward too. If he does get the axe, and if Sullivan in Pittsburgh gets canned, it wouldn't shock me to see us gun hard for him",
        "label": "NEG"
    },
    {
        "comment": "Who is saying that?  Where are all these people saying they should be actively trying to be bad next year?  They're just *going to be* bad.  Better but still bad.",
        "label": "NEG"
    },
    {
        "comment": "I wouldn't blame Copley for that one, but I would have liked to have seen him get the glove up and open before the shot was taken.",
        "label": "NEU"
    },
    {
        "comment": "I make the joke “game over” every time we give up the first goal but it keeps being true and now it's not funny anymore.",
        "label": "NEG"
    },
    {
        "comment": "Another freakin PK??",
        "label": "NEG"
    },
    {
        "comment": "He wasn't even involved in that play. What a stupid fucking rule.",
        "label": "NEG"
    },
    {
        "comment": "I see the refs have decided this will be one of those games.",
        "label": "NEG"
    },
    {
        "comment": "God damn bums. Lol",
        "label": "NEG"
    },
    {
        "comment": "# GO KNIGHTS GO!",
        "label": "POS"
    },
    {
        "comment": "Will Cuylle Fan Club where you at?!!!!!! he aint hot, he's Cuylle!!!! Four GOALS! PIZZA TIME BABY!!!! CONSUME IT!!!! 🍕🍕🍕🍕",
        "label": "POS"
    },
    {
        "comment": "Laviolette better rip into them this intermission like Joey Chestnut at a hot dog eating contest...",
        "label": "NEU"
    },
    {
        "comment": "2 of 6 defensemen with goals before the end of the 1st. On pace for all 6 scoring the day we trade Zad, which would be fucking hilarious.",
        "label": "POS"
    },
    {
        "comment": "Freddy G.  Game winner.  I'm calling it",
        "label": "POS"
    },
    {
        "comment": "Agree on most except olofsson.  He had a great 2 way game tonight for perhaps the first time in his life.",
        "label": "POS"
    },
    {
        "comment": "Anyone else noticing Kings players spilling all over the ice?Also, this has been a fun god damn game.",
        "label": "POS"
    },
    {
        "comment": "Ah so its your fault!",
        "label": "NEG"
    },
    {
        "comment": "Honestly. Three of our four lines are fucking cooking.I just really want good things for that third line too.",
        "label": "POS"
    },
    {
        "comment": "Bill please don't say Nico is leaking ever again thank you",
        "label": "NEG"
    },
    {
        "comment": "It's wild how he is scoring at what should be kyrous clip. A lot have been by getting nasty but right there was just saying fuck the pass. He literally said “great drive buchy”. Thomas and kyrou could learn a thing or 2",
        "label": "NEU"
    },
    {
        "comment": "Jani… 🙄",
        "label": "NEG"
    },
    {
        "comment": "There's a clear difference between Woll and Sammy during OT/Shootouts.  I don't know why these goalie apologists can't see the obvious.",
        "label": "NEU"
    },
    {
        "comment": "The referees drop the opening face-off and we are underway in Boston! Sabres attacking from left to right in their road whites as David Pastrnak shoots and scores to make it 2-0 Bruins.",
        "label": "NEU"
    },
    {
        "comment": "His Nana clearly didn't whoop his ass enough after fighting with his brother lol",
        "label": "NEG"
    },
    {
        "comment": "These guys know this is an actual game and not practice, right?",
        "label": "NEG"
    },
    {
        "comment": "That was such a soft call, it was clearly unintentional and didn't result in an opportunity.  Matt Tkachuck could circle back and chop Korpi when we played them and there was no call or anything.",
        "label": "NEG"
    },
    {
        "comment": "5-2 pls (bet the over)",
        "label": "NEU"
    },
    {
        "comment": "I'd honestly love to see Hartzy between the Deweys, skill and grit all around.",
        "label": "POS"
    },
    {
        "comment": "hoping we see the come back stars tonight 🙏",
        "label": "POS"
    },
    {
        "comment": "Actually, fuck it, I'll just watch on mute",
        "label": "NEG"
    },
    {
        "comment": "lmfao, Soderblom is so bad.",
        "label": "NEG"
    },
    {
        "comment": "I wish they had a live stream to watch the coach talking to the team in the intermission, I imagine Tocchet is going to turn purple.",
        "label": "NEG"
    },
    {
        "comment": "EVANS THAT WAS BEAUTIFUL (even if it didnt go in)",
        "label": "POS"
    },
    {
        "comment": "No chance of it happening but a playoff series between these two would be electric",
        "label": "POS"
    },
    {
        "comment": "Jesus christ Erod...",
        "label": "NEG"
    },
    {
        "comment": "#DRUNK CHRIS APPROVED. CATCH UP MODE ENGAGED.",
        "label": "POS"
    },
    {
        "comment": "Harley - Lundkvist is such a fun pair. I hope they keep it together 🥺",
        "label": "POS"
    },
    {
        "comment": "Yeah, I lost my love of MAF after that.",
        "label": "NEG"
    },
    {
        "comment": "Get rid of the stupid little fuck who is too stupid to change a scheme that is so blatantly failing.Is Babcock still available????",
        "label": "NEG"
    },
    {
        "comment": "Darn. That is all. Just darn.",
        "label": "NEG"
    },
    {
        "comment": "\"Leafs looking for a response shift now\"Immediately put the puck up the board to the Isles player for an easy out",
        "label": "NEG"
    },
    {
        "comment": "Just announced he won't return after taking a puck to the face in the 2nd",
        "label": "NEU"
    },
    {
        "comment": "Oh man. It is funny though. Say what you want. Lololol",
        "label": "NEU"
    },
    {
        "comment": "He looks like the child of Gomez and Rodman but his game has been surprisingly solid",
        "label": "POS"
    },
    {
        "comment": "Happy for us of course. But man I sympathize with the goalie, poor guy was getting mobbed lol",
        "label": "POS"
    },
    {
        "comment": "If bedard gets hit again take the penalty and stand up for him. He's been getting hit hard all game",
        "label": "NEG"
    },
    {
        "comment": "Timo Meier the invisible $8 million man.",
        "label": "NEG"
    },
    {
        "comment": "Not even Mariah Carey can stop McMichael.",
        "label": "NEU"
    },
    {
        "comment": "I almost forgot how fucking tall Tage is.  It's like watching Lurch on ice skates.",
        "label": "NEU"
    },
    {
        "comment": "Was that a serious shot from Erik Johnson? That was a beach ball",
        "label": "NEG"
    },
    {
        "comment": "Best birthday everSharks gave me a Fat W, work was easy today, traffic was clearSomeone is watchin out for me today",
        "label": "POS"
    },
    {
        "comment": "Adams and Granato suck. They failed the sabres this season for not addressing needs all while everyone around us got better.Fuck Adams & Granato 2024!",
        "label": "NEG"
    },
    {
        "comment": "I am not ruling out a resurgence. He was once quite the tender. And now he has less pressure to be the guy, though does to stick. I felt like he didn't let in a softie. That 3rd goal, people were calling for a save. But that is going in on most goalies between glove and head. People expect too much, getting critical far too quickly.",
        "label": "NEU"
    },
    {
        "comment": "Dougie Hamilton plays Civ6",
        "label": "NEU"
    },
    {
        "comment": "Lazy even on the powerplay tonight man wtf",
        "label": "NEG"
    },
    {
        "comment": "Just incredibly disappointing to see what type of pieces we have on this team and this is the result",
        "label": "NEG"
    },
    {
        "comment": "We looked so good like 1 game ago - the inconsistency is wild",
        "label": "NEG"
    },
    {
        "comment": "Man if we could play this well every night we'd be a playoff team!",
        "label": "POS"
    },
    {
        "comment": "Dewar fixing his own mistakes we love to see it",
        "label": "POS"
    },
    {
        "comment": "Speed doesn't matter for the shootout. It's all hands.",
        "label": "NEU"
    },
    {
        "comment": "Im glad Sunny got one.",
        "label": "POS"
    },
    {
        "comment": "STEEL GOAL!",
        "label": "POS"
    },
    {
        "comment": "I've always admired his footwork",
        "label": "POS"
    },
    {
        "comment": "I feel like every time I watch the cats they put up 40-50 shots like how??",
        "label": "NEG"
    },
    {
        "comment": "Oh Prov. You can't do that my guy.",
        "label": "NEG"
    },
    {
        "comment": "Fucking hell, guys",
        "label": "NEG"
    },
    {
        "comment": "Holy fuck Coleman.",
        "label": "NEU"
    },
    {
        "comment": "Any team accepts that deal. Canucks would never make that kind of offer. Lol.",
        "label": "NEU"
    },
    {
        "comment": "Im not saying there was anything obvious I missed, but how has their only been 1 PP per team, both in the 1st period and nothing since?",
        "label": "NEU"
    },
    {
        "comment": "Willy choose to break out for the pass while we had possession rather then break for a change. It comes down to coaching at that point",
        "label": "NEU"
    },
    {
        "comment": "Zuuuuuuub",
        "label": "NEU"
    },
    {
        "comment": "Wolf jump is the best jump",
        "label": "POS"
    },
    {
        "comment": "Nylander has to dump it in right?  What a fuckin dummy",
        "label": "NEG"
    },
    {
        "comment": "Hopefully being at home will give them some rest and routine.  Throw a few practices in there and maybe we can get firing again.",
        "label": "POS"
    },
    {
        "comment": "Oh my God!!!!!! What a save",
        "label": "POS"
    },
    {
        "comment": "I almost turned it off after that shortie.  Glad I stuck around to watch. Hat trick for Hertl and a come from behind OT win. Fuck Yeah!",
        "label": "POS"
    },
    {
        "comment": "hahahahahahaha oh dear",
        "label": "NEU"
    },
    {
        "comment": "Hopefully this is good for momentum",
        "label": "POS"
    },
    {
        "comment": "GRUUUUU. That was a great sequence of saves",
        "label": "POS"
    },
    {
        "comment": "what happened to adin hill?  I need him for my fantasy team.",
        "label": "NEU"
    },
    {
        "comment": "Can we put him on weavers like now?",
        "label": "NEU"
    },
    {
        "comment": "gonna be really interesting to see how , mysteriously, the 4th line will excel at shutting down their opponents tonight.",
        "label": "POS"
    },
    {
        "comment": "They are giving me hope that we could make the Winter Classic a game",
        "label": "POS"
    },
    {
        "comment": "Some team is scoring 6 tonight. The question is who",
        "label": "NEU"
    },
    {
        "comment": "Mods, no need for a post game thread tonight.  We know how's it's gonna go lol.",
        "label": "NEU"
    },
    {
        "comment": "Definitely feels like they are starting to pivot towards the skate jerseys being our main home jersey. Have we worn them more than our actual home jersey this year?",
        "label": "NEU"
    },
    {
        "comment": "I'd love either one of those guys on the Jackets tho. Hate that I like them both so much. Lol",
        "label": "POS"
    },
    {
        "comment": "THATS IN HE NEVER COVERED IT",
        "label": "NEU"
    },
    {
        "comment": "There is that silver lining at least, I guess, lol.",
        "label": "POS"
    },
    {
        "comment": "Just saw a BC overpass high impact replay",
        "label": "NEU"
    },
    {
        "comment": "Groodles was right all along",
        "label": "POS"
    },
    {
        "comment": "What a huge momentum shift in the 2nd half of this period",
        "label": "POS"
    },
    {
        "comment": "Hoglander turning into one of our best forecheckers. Petey line doesn't seem to pressure enough. Maybe trying Mikheyev with Miller and Boeser and putting Hoggy with Petey might be worth a look?",
        "label": "NEU"
    },
    {
        "comment": "I'm calling it now, it looked like something clicked again last night. &#x200B;Sometimes you gotta go through those motions to learn and grow, it really looked like they got back to some quality hockey last night. PP was zipping it around, Petey was noticeably better, I thought the giraffes looked steady and the boys really got up on the forecheck all night long. This might be the first game where they turn it around, it was fun to watch. &#x200B;Long live Hoggy.",
        "label": "POS"
    },
    {
        "comment": "I don't see near enough of those anymore. Good clean hard checks. Love it.",
        "label": "POS"
    },
    {
        "comment": "That last second effort by Granlund would have been a beauty if it just made the net.",
        "label": "POS"
    },
    {
        "comment": "this does not spark joy.",
        "label": "NEG"
    },
    {
        "comment": "holy fuck we suck",
        "label": "NEG"
    },
    {
        "comment": "How did we own the first period? And be able to hold out defensively, even with some lapses?",
        "label": "NEU"
    },
    {
        "comment": "Knies absolutely blew up that dude leading to that goal",
        "label": "NEG"
    },
    {
        "comment": "Vancouver has a scary young team. Probably not enough experience to get them deep into the Playoffs but they are likely to be the real deal in a few years. Also Demko with a 2.22 GAA and a crazy .926 sv%",
        "label": "NEU"
    },
    {
        "comment": "Is the real effort going to come out 2 min left in the game when it's too late?",
        "label": "NEG"
    },
    {
        "comment": "Don't what that dude was bitching about, ref coulda called him for interference, boarding or checking from behind. They'll call that one everytime",
        "label": "NEG"
    },
    {
        "comment": "On the plus side however him not signing has saved the flames from their own stupidity",
        "label": "NEU"
    },
    {
        "comment": "The kings are very good",
        "label": "POS"
    },
    {
        "comment": "Kane wasn't even in the lineup.",
        "label": "NEU"
    },
    {
        "comment": "RicFlairWoo.gif. technically 3 goals in 8 minutes. We got this! Let's go!!",
        "label": "POS"
    },
    {
        "comment": "Insane goal. Dynasty incoming",
        "label": "POS"
    },
    {
        "comment": "If Cole could just finish like Sissons",
        "label": "NEU"
    },
    {
        "comment": "GD it!",
        "label": "NEU"
    },
    {
        "comment": "It's fuckin Martin jones at the other end of the ice and we have 4 shots",
        "label": "NEG"
    },
    {
        "comment": "Yep. Lol at the people on this sub who think Bedard is gonna be fine with the Hawks battling for last place for the 2 seasons after this one.Dude is a competitor, not gonna be fun for him to be on such an awful team.",
        "label": "NEG"
    },
    {
        "comment": "GET ABSOLUTELY FUCKIN SLAFFED BOZOS",
        "label": "NEG"
    },
    {
        "comment": "I would absolutely love if we tied it up before the end of this period.",
        "label": "POS"
    },
    {
        "comment": "Lmao very clear shot of robo going \"FUCK\"",
        "label": "NEG"
    },
    {
        "comment": "Omg Kubalik sighting",
        "label": "POS"
    },
    {
        "comment": "How did we get this man on waivers??",
        "label": "NEG"
    },
    {
        "comment": "We are .500And yes I've noticed more forwards back checking and being open to exit, we were barely in our zone. We did that to the 2nd highest scoring team 5v5. Thats means something",
        "label": "POS"
    },
    {
        "comment": "Lol that was a straight up pick on bertuzzi",
        "label": "NEG"
    },
    {
        "comment": "We were never really in contention, we just had more games than the teams that are.",
        "label": "NEU"
    },
    {
        "comment": "So let's never pair Myers and Zadorov together again.",
        "label": "NEG"
    },
    {
        "comment": "But who will rayzor talk to between periods?",
        "label": "NEU"
    },
    {
        "comment": "A quick release would be good.",
        "label": "POS"
    },
    {
        "comment": "Glad the guys have the mental fortitude to push and win. Big 2 points there. Devils have won 4 out of the last 5. However, Vitek posted an .848 tonight. Consistently unacceptable",
        "label": "POS"
    },
    {
        "comment": "Duffer is back!",
        "label": "NEU"
    },
    {
        "comment": "Seth Jones' managed to get everyone on the same level as him just so we spread the criticism out a bit.",
        "label": "NEU"
    },
    {
        "comment": "Willy don't jinx the PK",
        "label": "NEU"
    },
    {
        "comment": "Um so... the positive take is... despite a god awful 2nd period, we managed to hold on for OT? *eye twitch*",
        "label": "POS"
    },
    {
        "comment": "Yeah I think so too, i feel like desmith should've started the Flames game but Demko seems overworked right now. I hope he'll get the start against the wild so Demko can mentally and physically reset",
        "label": "NEU"
    },
    {
        "comment": "It's insane the guys can't make a tape to tape pass",
        "label": "NEG"
    },
    {
        "comment": "that looked so painful",
        "label": "NEG"
    },
    {
        "comment": "Losing duclair kinda hurt us. Still nice to see we came back.",
        "label": "NEU"
    },
    {
        "comment": "Gary Bettman is a gutless coward and his referees are dickheads. Truly pathetic stuff, night in and night out.",
        "label": "NEG"
    },
    {
        "comment": "Dirty hits are fine as long as you turtle when they wanna fight.",
        "label": "NEU"
    },
    {
        "comment": "Whatever is going on with him really needs to be resolved and/or he needs to be sat. He's that bad.",
        "label": "NEG"
    },
    {
        "comment": "Insane to not fire dj",
        "label": "NEG"
    },
    {
        "comment": "LITERAL MINUTES people. Remember that.",
        "label": "NEU"
    },
    {
        "comment": "I love the guy but I'm still gonna place blame on Igor's play of late. Absolutely awful and it's not just the defense in front of him. If he's been playing hurt after coming off the IR they need to figure that shit out.",
        "label": "NEG"
    },
    {
        "comment": "True, but they could all be negative and still better than last year...",
        "label": "NEU"
    },
    {
        "comment": "Lol point we all saw it and you're an idiot",
        "label": "NEG"
    },
    {
        "comment": "I actually liked him with Ylönen. If they won't have him play with Caufield, I think Ylönen's a good partner for him. Fast, responsible, good shot.",
        "label": "POS"
    },
    {
        "comment": "THE TANK IS BACK ON",
        "label": "NEG"
    },
    {
        "comment": "Also give that to Johnston, I just added him to my fantasy team today",
        "label": "POS"
    },
    {
        "comment": "WOW WHAT A PIECE OF SHIT STENLUND IS!!!",
        "label": "NEG"
    },
    {
        "comment": "5/6 points on this home stand and gained a point on Florida tonight. Leafs played better tonight than they have in a while so that's good.",
        "label": "POS"
    },
    {
        "comment": "Not going to lie, the 1 goal lead at the end gave me anxiety.",
        "label": "NEG"
    },
    {
        "comment": "A little hyperbolic, but I get what you're saying. No one would ever accuse Jenner of being a good skater.",
        "label": "NEU"
    },
    {
        "comment": "7 fucking minute long penalty kill. That alone is enough to completely fuck any ice time argument.I'm fucking so angry after this game and the shit with Gudbranson that I can barely see straight and these dumb mother fuckers running their stupid fucking mouths about shit behind a keyboard is going to make me explode.",
        "label": "NEG"
    },
    {
        "comment": "This has been said today in this thread before, but this team this year seems to not quit on games as much as previous Habs teams which is honestly a very good positive to take away from this year, whether it's the coaching, leadership or what but the past 5 years down 3-0 Habs would've shut er down and mailed it in. At least this year they battle to the end (most nights)",
        "label": "POS"
    },
    {
        "comment": "The standout to me from last year is we aren't near the paint for rebounds.",
        "label": "NEU"
    },
    {
        "comment": "Wild players should be curb stomped",
        "label": "NEG"
    },
    {
        "comment": "Noticing good structure in the D end lately. Aside from a little portion of the game in the 1st, things looked good this game. W",
        "label": "POS"
    },
    {
        "comment": "Sharing the credit. That's good leadership right there.",
        "label": "POS"
    },
    {
        "comment": "Pushed in. That's bullshit",
        "label": "NEG"
    },
    {
        "comment": "Lav: Quinn?Bread: Nyet noI'm quoting Jaws",
        "label": "NEU"
    },
    {
        "comment": "Canucks 5 on 5 is just brutal",
        "label": "NEG"
    },
    {
        "comment": "Just came in. An unusual amount of sucking going on.",
        "label": "NEG"
    },
    {
        "comment": "Holy fuck, Quickie is superhuman!",
        "label": "POS"
    },
    {
        "comment": "#THIS IS WHAT IT SOUNDS LIKE, WHEN WE RIDE ON OUR ENEMIES",
        "label": "NEU"
    },
    {
        "comment": "bad bounces",
        "label": "NEG"
    },
    {
        "comment": "I wanna see a goal with Joey with the primary assist!",
        "label": "POS"
    },
    {
        "comment": "Vanecek vs. Wolf. There will be goals.",
        "label": "NEG"
    },
    {
        "comment": "On pace for that 10-0 loss. Everything is fine",
        "label": "NEG"
    },
    {
        "comment": "If you are a Devils fan, this game is frustrating.If you are a Canucks fan, this game is frustrating.If you are a neutral watcher, this game must've been some of the best television you've seen all season.",
        "label": "NEG"
    },
    {
        "comment": "And injury cursed. I'm convinced someone sold their soul to the devil to prevent injuries last season and it's coming back to bite us this year.",
        "label": "NEG"
    },
    {
        "comment": "Does it bother anyone else that Lindy doesn't say a word to the team during the game? I'm 6 rows behind him… never says a word to anyone except the occasional assistant coach",
        "label": "NEG"
    },
    {
        "comment": "Johnny I Hardly Knew Ya",
        "label": "NEU"
    },
    {
        "comment": "Acl has left the chat",
        "label": "NEU"
    },
    {
        "comment": "Only one goal in the first?Has Hynes lost the team?",
        "label": "NEG"
    },
    {
        "comment": "Complete game, and a shutout for Sammyy! Such a huge win for the team after the Woll news.",
        "label": "POS"
    },
    {
        "comment": "Damn, goalie pull already huh",
        "label": "NEG"
    },
    {
        "comment": "It's just so frustrating because we know how good they can be.",
        "label": "NEG"
    },
    {
        "comment": "That had to be the most active GDT of the season, at least.",
        "label": "POS"
    },
    {
        "comment": "WE ARE SO BACK",
        "label": "POS"
    },
    {
        "comment": "Yea his blue line turnovers have been brutal this year. He has left our tired forwards out to dry a few times trying to make a fancy play.",
        "label": "NEG"
    },
    {
        "comment": "This Bruins team is getting smoked come playoffs unless their goaltending pulls 9.60+ in the playoffs.",
        "label": "NEG"
    },
    {
        "comment": "OT is just one big skill competition. Looked decent for 40 minutes but that's not enough. We can't buy a win",
        "label": "NEG"
    },
    {
        "comment": "They were more interested in making highlight reel passes than shooting.",
        "label": "NEG"
    },
    {
        "comment": "I don't think anyone's in denial. There's still hope moves can be made. But we are definitely at the point where something *big* needs to be done.",
        "label": "NEU"
    },
    {
        "comment": "Slafkovsky has been developing very well, Monty has been a solid goaltender this year, we're not last in the Atlantic, we got a pick to take Sean Monahan that could turn into 2OA, Primeaus been taking strides, Jacob Fowler and Lane Hutson are doing very well in the NCAA",
        "label": "POS"
    },
    {
        "comment": "I think Jarmo will be gone at the end of the season. We are gonna be bottom 3 again.",
        "label": "NEG"
    },
    {
        "comment": "lol I can imagine Maroon making some smartass comments",
        "label": "NEG"
    },
    {
        "comment": "#[BLUUUUUES GOOOOOOOOOOOAL!!!!!](#🔔 1!",
        "label": "POS"
    },
    {
        "comment": "People who shit talk him be so mad rn",
        "label": "NEG"
    },
    {
        "comment": "I feel like myers will be able to be better as the playoffs go on, fewer penalties can only help his play",
        "label": "POS"
    },
    {
        "comment": "POSSIBLE TIMO TIME!",
        "label": "POS"
    },
    {
        "comment": "First ever 5-3 OT win in history",
        "label": "POS"
    },
    {
        "comment": "The only ray of light in tonight's game is hurt. Why god",
        "label": "NEG"
    },
    {
        "comment": "THEY DON'T ASK HOW, THEY ASK HOW MANY!",
        "label": "NEU"
    },
    {
        "comment": "Harnaryan trying to will the Flames back into this game. What a loser.",
        "label": "NEG"
    },
    {
        "comment": "You mean how he got tripped by three dudes with the ref staring right at him and no call?",
        "label": "NEG"
    },
    {
        "comment": "That last one with Petey felt like game management to get the puck down ice.  I didn't get the call.",
        "label": "NEG"
    },
    {
        "comment": "Just need to play Situational football",
        "label": "NEU"
    },
    {
        "comment": "It literally obliterates my brain that this team is 7-1-2 in their last 10 and people have been wanting Keefe fired. Saying the team is garbage. Saying Matthews is trash when he's tied for most goals in the league with 3 games in hand on the guy tied with him.Everyone in this sub must throw clown make up on before they hop in the sub.",
        "label": "NEG"
    },
    {
        "comment": "Back checking is awful.",
        "label": "NEG"
    },
    {
        "comment": "Probably the whole “Make a dumbfuck hire and then have to fire that guy and give the job to the dude who probably deserved it in the first place but he runs a completely different offensive system than this team ever has so everyone is learning on the fly against the best competition in the world” thing or whatever.",
        "label": "NEG"
    },
    {
        "comment": "Seems like Mikey and Protas were the perfect line mates to get Mantha back in the swing. Almost echoes the cup winning top line- the big body of Protas winning battles and possession like Wilson, the smarts and skates of Mikey setting up plays like Kuzy, and another big boi who can finesse some goals (obviously not quite Ovi). And without Lavi's system they can actually make creative plays together and get better as a line- could be the start of something real nice",
        "label": "POS"
    },
    {
        "comment": "60 is back on the menu boys",
        "label": "POS"
    },
    {
        "comment": "We've been laying a lot of hits! I wonder if it's starting to take a toll on Tampa?",
        "label": "NEU"
    },
    {
        "comment": "Fucking embarrassing",
        "label": "NEG"
    },
    {
        "comment": "You can tell how bad he wants it",
        "label": "NEU"
    },
    {
        "comment": "Settle down",
        "label": "NEU"
    },
    {
        "comment": "EICHEL'S GOT THAT PP!",
        "label": "POS"
    },
    {
        "comment": "So, two of the 'lunds have tried, it's Zetterlund's turn now!",
        "label": "NEU"
    },
    {
        "comment": "Definitely played a good game, but there's a cold Martin Jones in net, just throw the puck at him.",
        "label": "POS"
    },
    {
        "comment": "I fucking hate Tyler Meyers",
        "label": "NEG"
    },
    {
        "comment": "Lets go boys!!",
        "label": "POS"
    },
    {
        "comment": "The black and yellow just pops. I'd be curious to see our home kit with navy pants.",
        "label": "POS"
    },
    {
        "comment": "Which is crazy because that was probably the best part of Bratt's game already. But when he is playing well, he is one of the silkiest skates in the NHL there's no doubt",
        "label": "POS"
    },
    {
        "comment": "It's the guy who talks with his hands too much",
        "label": "NEU"
    },
    {
        "comment": "SEGGYYYYYY",
        "label": "POS"
    },
    {
        "comment": "That was a dope fucking game lol we pushed them to OT! Nuts",
        "label": "POS"
    },
    {
        "comment": "Chinnys my favorite. Quietly so good away from the puck and looking like he's going to be a force to reckon with when he has the puck.",
        "label": "POS"
    },
    {
        "comment": "Is that our boy Armia getting some top line reps?I love it.",
        "label": "POS"
    },
    {
        "comment": "I probably am not staying up all night cos I'm a tired bitch but like … not terrible. Hope we can go from “not bad” to “win the damn thing.” At any rate Levi's looking good",
        "label": "POS"
    },
    {
        "comment": "Wow we did not deserve that one especially with the few posts at the end.",
        "label": "NEG"
    },
    {
        "comment": "This team is dirty",
        "label": "NEG"
    },
    {
        "comment": "Booing your own team is bad enough. Booing a player EVERY TIME HE TOUCHES THE PUCK because he said \"no comment\" on a coach getting fired is fucking cringe.The only player you boo every time they touch the puck is Patrick Kane.",
        "label": "NEG"
    },
    {
        "comment": "Eichel needed to get back that was still on thompson regardless u don't let that get in",
        "label": "NEU"
    },
    {
        "comment": "Prime Patrick Roy would give up 3+ goals behind this defensive structure. That has to change before one of our goalies can break out",
        "label": "NEG"
    },
    {
        "comment": "anywhere but beside Keefe. lol",
        "label": "NEG"
    },
    {
        "comment": "Can we just get to 2nd intermission tied?",
        "label": "NEU"
    },
    {
        "comment": "Hold it together through the minor and spring Willy for the 5-3 goal.",
        "label": "NEU"
    },
    {
        "comment": "It was weird to let him go for the price that Detroit ended up paying for him. He got a very small contract for what he did, and we could have afforded it very easily.",
        "label": "NEG"
    },
    {
        "comment": "Yeah, honestly it was pretty bad. Lots of people calling him a POS and stuff like that. I'm all for fun and chirps, but people got downright personal, deserved or not idk.",
        "label": "NEG"
    },
    {
        "comment": "Kuz needs to shoot the damn puck, so frustrating that he's a non threat which allows the opp to square in on Pete's 1T",
        "label": "NEG"
    },
    {
        "comment": "This has been the complete game I've been waiting for. Fourth line functional. Winning pick battles. Full effort from pick drop. Keep it up boys! Let's go!",
        "label": "POS"
    },
    {
        "comment": "Honestly they didnt even look that good tonight.. Id say they just played their game and we didnt play oursMaybe thats not giving them enough credit, but we looked totally lost repeatedly, puck watching, dumping and chasing.. doing nothing that we did earlier in the season to be successful.",
        "label": "NEG"
    },
    {
        "comment": "yeah for sure, he could do a great job showing him the ropes in how to play too like panerin has been doing with lafreniere on the rangers too, half mentor and half the other half in a great duo",
        "label": "POS"
    },
    {
        "comment": "Finally broke the shutout!",
        "label": "POS"
    },
    {
        "comment": "They kept the shitty part of their game to just 10 mins this time, I consider that progress",
        "label": "NEU"
    },
    {
        "comment": "Personally I think hanafin is having a good year. Lindy and Vladar need to go",
        "label": "NEU"
    },
    {
        "comment": "“Original 6” that's cute. Sorry they're not in the original 3.",
        "label": "NEU"
    },
    {
        "comment": "What a period Bratt is having",
        "label": "POS"
    },
    {
        "comment": "Oh Fabes they fucked you over with that shift",
        "label": "NEG"
    },
    {
        "comment": "Wolf should've started in the first place. That was so weak",
        "label": "NEG"
    },
    {
        "comment": "The Post Game show had it, here is the link of them talking and showing it.[Wolf and Solo Blessing the goalie net](",
        "label": "NEU"
    },
    {
        "comment": "I'm hoping you're right. Last game he got effectively benched in the third in favor of Danforth taking Boone's minutes.",
        "label": "NEU"
    },
    {
        "comment": "It's the last time we're playing them this year so I figured why not. The tickets were cheap too.",
        "label": "POS"
    },
    {
        "comment": "It's evident that we need another vet or 2 to work with Bedard and Reichel. Asking these guys to do it all this early is not developing them.",
        "label": "NEU"
    },
    {
        "comment": "Luke continues the streak. 5 career goals. Jack is still the only player to get a primary assist on any of them.",
        "label": "POS"
    },
    {
        "comment": "Sens lead cut in half!",
        "label": "NEG"
    },
    {
        "comment": "I almost stopped, then I decided to stick it out for all the people that paid a small fortune to be there in person. Glad I did!",
        "label": "POS"
    },
    {
        "comment": "One man Armia!!!",
        "label": "POS"
    },
    {
        "comment": "Minny doesn't bother me. It's succinct.",
        "label": "NEU"
    },
    {
        "comment": "*Flashbacks to a preds team with Gudbranson and Ben Harpur on D*",
        "label": "NEU"
    },
    {
        "comment": "Yeah, honestly it sucks that Nylander blew a tire and was slow getting up/back in, but that replay they showed of Tavares just after the game was a big fucking oof.",
        "label": "NEG"
    },
    {
        "comment": "What the fuck lmao Terrible call that happens 20 times a game",
        "label": "NEG"
    },
    {
        "comment": "Timo with Nico? Hmm…mayhaps we should let them cook",
        "label": "POS"
    },
    {
        "comment": "Nylander failed to clear the puck twice in 10 seconds on that third Ottawa goal.",
        "label": "NEG"
    },
    {
        "comment": "It doesn't EVER change. Not EVER!!!",
        "label": "NEG"
    },
    {
        "comment": "Man this is an entertaining game",
        "label": "POS"
    },
    {
        "comment": "refs fucking us again",
        "label": "NEG"
    },
    {
        "comment": "Hopefully he just got the wind knocked out of him and nothing more",
        "label": "NEU"
    },
    {
        "comment": "I was comparing the past few weeks to the same team we've seen the past 10 or so years. Management is doing everything right. They've built themselves a very nice point cushion, but they have to break out of whatever slump they've got themselves into. They have a lot of work to do.",
        "label": "POS"
    },
    {
        "comment": "The Granlunds, the Baertschis, the Sutters, the Veys",
        "label": "NEU"
    },
    {
        "comment": "Kopi!",
        "label": "NEU"
    },
    {
        "comment": "If we retain I think it is possible we can have someone who can slot in that “first line” especially if it's a package trade throw in a Vladar on the house",
        "label": "NEU"
    },
    {
        "comment": "What a play. Let's go!!!!",
        "label": "POS"
    },
    {
        "comment": "The devils speed just illustrated the Canucks weaknesses",
        "label": "NEG"
    },
    {
        "comment": "That was as well as we could have played without scoring (that counted)",
        "label": "NEU"
    },
    {
        "comment": "That was a hell of a game of hockey against a really top quality team. Would have loved to have had a PPG tonight, but I'll take it. Nemec still crushing it with 27 shifts including PP, PK and OT duty. Absolutely cool to see. VV - great game. Hope that was a further confidence booster, as he nailed it. OT - Mikey for the draws, Luke, Jesper, Jack ... just a cheat code. We wrestled the puck off the enemy several times, and punished them with a gorgeous GWG Jesper to Jack. 5/7 would recommend (/s)",
        "label": "POS"
    },
    {
        "comment": "Man they're a bunch of goons.Watch those wrists popsicle, Hartman plays for them",
        "label": "POS"
    },
    {
        "comment": "JONNY HOCKEY",
        "label": "NEU"
    },
    {
        "comment": "We're here in Vancouver! Let's go boys!!",
        "label": "POS"
    },
    {
        "comment": "If playing 11/7 keeps that 4th line off the ice - go for it.  Like DJ said I was giving shifts to Timmy, Vladi and Drake.  Rather see them than that 4th line.",
        "label": "NEU"
    },
    {
        "comment": "hate to seem like a bandwagoner but watching the canuck's this year has been such a breath of fresh air compared to the perpetual disappointment my sens have been",
        "label": "NEG"
    },
    {
        "comment": "You're not going to get points if you only play 9 minutes in a full game.",
        "label": "NEG"
    },
    {
        "comment": "No trip?",
        "label": "NEU"
    },
    {
        "comment": "TAGE",
        "label": "NEU"
    },
    {
        "comment": "As soon as the sharks turned to shit this season, I thought, \"cool, we'll lose to them for sure.\"",
        "label": "NEG"
    },
    {
        "comment": "I thought I was seeing things (i still might be seeing things), but turbo is back out on the ice!!!",
        "label": "POS"
    },
    {
        "comment": "He's had top tier linemates ever since too....",
        "label": "POS"
    },
    {
        "comment": "In oooooovvverrrrrtiiiiiimeee",
        "label": "NEU"
    },
    {
        "comment": "Surprised that wasn't a boarding penalty",
        "label": "NEG"
    },
    {
        "comment": "EKKKYYYY!!!!!",
        "label": "POS"
    },
    {
        "comment": "This team sucks",
        "label": "NEG"
    },
    {
        "comment": "I had the audio turned down a bit because wife is sleeping and didn't even notice the GLG chants. Now I'm disappointed and wish I'd heard it.",
        "label": "NEG"
    },
    {
        "comment": "Lundell seeing even one second of ice time while losing is how you show you don't really care about winning the game. What a fucking shitty player. Destroys every single line he's on no matter who plays with him. It's embarrassing to see this out of a first round pick in his D+3 year. Completely unacceptable.",
        "label": "NEG"
    },
    {
        "comment": "Holy hammer",
        "label": "NEU"
    },
    {
        "comment": "If you mean for a jolt to the D to get their act together, sure. But none of these have been on him so far.",
        "label": "NEU"
    },
    {
        "comment": "Yep. I feel like this season is a huge crossroads for the team. A ton of wasted potential if they bottle this.At least the D is banged up/young. No excuse for this goaltending, which has to be worst in the league without even checking.",
        "label": "NEG"
    },
    {
        "comment": "Hey it's 18 year old Sam Bennett",
        "label": "NEU"
    },
    {
        "comment": "Fucking fire Seth into the sun",
        "label": "NEG"
    },
    {
        "comment": "He was okay, but not great. The one goal was egregious, but that third goal was also on him quite a bit. Got very turned around in his crease, like on the second goal. He was very clearly playing hurt this game, he was visibly struggling a couple times, and he looked very off. He's normally very calm and collected, and efficient in his crease. Tonight, he was noticeably worse in all those categories.",
        "label": "NEG"
    },
    {
        "comment": "It's guddy... He cut the power.. he's coming for cousins 🤣🤣🤣🤣🤣",
        "label": "NEG"
    },
    {
        "comment": "Weegar taking a nap? How does that happen",
        "label": "NEU"
    },
    {
        "comment": "\"If only Richardson could pull them together and tell them to play better.\"You mean a timeout?",
        "label": "NEU"
    },
    {
        "comment": "I can understand the boarding call. It's a soft one, but I get it. To review it and then decide it's also a misconduct? That blows my mind",
        "label": "NEG"
    },
    {
        "comment": "Chrome domes 4 life",
        "label": "NEU"
    },
    {
        "comment": "I, for one, blame Igor.",
        "label": "NEG"
    },
    {
        "comment": "Even then, Tre's drafting was probably more a product of him trusting his analytics and scouting teams and not necessarily him being actively involved himself. Not a very high bar.I have no doubt Conroy's front office will keep the same level of drafting up going forward. Maybe even better...last season's draft crop is looking awesome already.",
        "label": "NEU"
    },
    {
        "comment": "YOURE MY WEDGEWALL!! and afteralllll",
        "label": "POS"
    },
    {
        "comment": "The problem is the king's don't have any bonafide superstars, and the results show in the playoffs.",
        "label": "NEG"
    },
    {
        "comment": "God that was an ugly win.  Ruffs defensive system and the goaltending is hard to watch.",
        "label": "NEG"
    },
    {
        "comment": "Well that was exciting...  Most WINS in the NHL.   On 🔥.",
        "label": "POS"
    },
    {
        "comment": "I also think it's time for Tocch to rip the team now, he's been quiet and really way to kind to the guys for playing 500 hockey, with this game and Minny should have been easy wins, they have a tough schedule coming up and it could be ugly really quick.Lucky the pacific lowkey sucks because if you look at the central holy we'd be a wildcard team the way Arizona and the Blues have been playing.",
        "label": "NEG"
    },
    {
        "comment": "atrocious rebound control, terrible awareness. Yes, defense is also trash but vitek is just a good backup and schmid is a rookie, we need a real starter.",
        "label": "NEG"
    },
    {
        "comment": "I don't think the glass broke, I think the thing between them didn't hold",
        "label": "NEU"
    },
    {
        "comment": "He should be packed and be ready to be moved. Cleary 3C going forward are Tage, Cozens and Mitts. 4th line center has to bring different skillset than Krebs",
        "label": "NEG"
    },
    {
        "comment": "It's been Ott running the PP since Monty was here. Things just worked better with Monty whispering in everyone's ear",
        "label": "POS"
    },
    {
        "comment": "Fuck yes!!!",
        "label": "POS"
    },
    {
        "comment": "The boys looked like contenders tonight, against a tough team. Great game from... all of them.",
        "label": "POS"
    },
    {
        "comment": "Speeds",
        "label": "NEU"
    },
    {
        "comment": "Really missing our T(anev)-1000",
        "label": "NEG"
    },
    {
        "comment": "Scored 2 goals in a road game for the first time this season. Great...",
        "label": "POS"
    },
    {
        "comment": "Sharangovich is full of confidence right now",
        "label": "POS"
    },
    {
        "comment": "That's it never talking again",
        "label": "NEG"
    },
    {
        "comment": "Holy fuck what a flop",
        "label": "NEG"
    },
    {
        "comment": "HOLY FUCK THAT WAS HILARIOUShe couldn't even reach big Z LMAO",
        "label": "POS"
    },
    {
        "comment": "Tuch is gonna be kicking himself for that all night.",
        "label": "NEG"
    },
    {
        "comment": "Size and skating ability is a pretty special skill set he had. As a #2 guy he's fantastic. As the #1 he's out of his element. Still a very good d man that 31 other teams would love to have.",
        "label": "POS"
    },
    {
        "comment": "After a coaching change fails to bring results",
        "label": "NEG"
    },
    {
        "comment": "Zadina OT winner would be 😩",
        "label": "POS"
    },
    {
        "comment": "That was fucking insane",
        "label": "POS"
    },
    {
        "comment": "There is the 2nd early goal lmao",
        "label": "NEU"
    },
    {
        "comment": "Pp was bad, but the Pk also looked horrendous. I really believe this team needs a coaching change, because it's apparent there is talent on this team.",
        "label": "NEG"
    },
    {
        "comment": "that shouldnt have been a penalty shot... he tried a reverse hit and failed....",
        "label": "NEG"
    },
    {
        "comment": "Frank Wycheck passed away and buffalo was uncursed",
        "label": "NEG"
    },
    {
        "comment": "UHHH Meier",
        "label": "NEU"
    },
    {
        "comment": "boldy.",
        "label": "NEU"
    },
    {
        "comment": "WOOOOOOOOOOOOOOOOOO EICHEL!",
        "label": "POS"
    },
    {
        "comment": "Fuck Brady cannot hit the puck tonight",
        "label": "NEG"
    },
    {
        "comment": "Fuck",
        "label": "NEG"
    },
    {
        "comment": "What do we think the D pairings will be since Key is out tonight? Is jones going to slot in with Trouba? Or is Gus/Schnieder going to move up a line?",
        "label": "NEU"
    },
    {
        "comment": "Watching after hours right now, Brock is such a genuine, nice and gentle guy. I thought I couldn't love Brock more.",
        "label": "POS"
    },
    {
        "comment": "Boldy is just on a fuckin heater",
        "label": "POS"
    },
    {
        "comment": "Samuelsson is a bit casual lol talking to Panger",
        "label": "NEU"
    },
    {
        "comment": "the PP literally couldn't be any worse, why not try slaf on pp1move slaf to the bumper, cole to his strong side, and zukes to the one t side",
        "label": "NEG"
    },
    {
        "comment": "Spoke too soon.  Unfortunately not for us",
        "label": "NEG"
    },
    {
        "comment": "Sharks are pinning the puck in their defensive zone while they are down by two with like 6 minutes left? Interesting strategy, let's see if it pays off",
        "label": "NEU"
    },
    {
        "comment": "yeah lets not do that hughes bros",
        "label": "NEG"
    },
    {
        "comment": "Ysh it's like... Could I possibly be shot by cops, or random shooter? Think I ll just stay home",
        "label": "NEG"
    },
    {
        "comment": "Marchand trying to jump Levi like what the fuck",
        "label": "NEG"
    },
    {
        "comment": "BENSON!!!!!",
        "label": "POS"
    },
    {
        "comment": "Tyler saying the truth.  Did nothing right that period.  AKA: We sucked.",
        "label": "NEG"
    },
    {
        "comment": "It was honestly a bit refreshing to see",
        "label": "POS"
    },
    {
        "comment": "You want the !sharks goal horn song to play in the Fortress?! This whole comment is unacceptable. 😂",
        "label": "NEG"
    },
    {
        "comment": "League probably told them to stop for distraction or something idk",
        "label": "NEU"
    },
    {
        "comment": "Wonder if the league will use this as cover to dig into other stuff on him. \"Oh we were just looking at this hit and we also noticed you've been gambling on games. Soooo....\"",
        "label": "NEU"
    },
    {
        "comment": "It's not even \"spin the wheel\", more of a \"toss a bent, rusty coin\".",
        "label": "NEG"
    },
    {
        "comment": "Wedgewood didn't even move lol wtf",
        "label": "NEG"
    },
    {
        "comment": "Sorry Bedard, you picked the wrong year to be a rookie. Marco Rossi exists in the league",
        "label": "NEG"
    },
    {
        "comment": "Balllss",
        "label": "POS"
    },
    {
        "comment": "GUESS WHOS BACK, NOVAK'S BACK!Seriously tho this is a huge boost, Novy is a stud",
        "label": "POS"
    },
    {
        "comment": "Some of these Wolf goals against are almost impossible to stop manGive my son a break",
        "label": "NEG"
    },
    {
        "comment": "Missing Joe and Locker right now",
        "label": "NEG"
    },
    {
        "comment": "Saw that one coming a mile away. Gotta clear it!",
        "label": "NEU"
    },
    {
        "comment": "Oh boy, I can hear Steve Dangle“If you're a goaltender… TEND THE GOAL!!!!”",
        "label": "NEU"
    },
    {
        "comment": "They also missed a pretty obvious hold on Johansson with the net empty earlier on",
        "label": "NEG"
    },
    {
        "comment": "Messed up on the Canadian anthem lyrics",
        "label": "NEG"
    },
    {
        "comment": "The sign of a good player is being able to move through the line up and excel regardless.People may have Legitimate gripes about some of MSLs line making decisions but moving him after an injury to put a loaded top line together and let the rest play out isn't reasonable at all.First, we have no idea what the lines will look like next game.Second, those are by far the have current 3 best players. You go down a guy and you are looking at riding your top guys a lot the rest of the night, and they can all double shift if needed too. Anyone questioning that move is just looking to complain in my opinion.",
        "label": "NEU"
    },
    {
        "comment": "<3 <3 <3",
        "label": "POS"
    },
    {
        "comment": "Refs had to make sure myers gave away a penalty",
        "label": "NEU"
    },
    {
        "comment": "Yeah I wanna see someone pull a Gudbranson and show the refs that shit don't fly",
        "label": "NEG"
    },
    {
        "comment": "Bad coverage there",
        "label": "NEG"
    },
    {
        "comment": "0% chance we win this. Toronto will score in the first 30 seconds.",
        "label": "NEG"
    },
    {
        "comment": "Not even close to one of our *worst* games, plus pay attention to who we're playing before you say something like that.",
        "label": "NEG"
    },
    {
        "comment": "Was it a bad call by Doughty trying to pinch there too after Juice's shot?  Just seemed risky on top of risky.",
        "label": "NEG"
    },
    {
        "comment": "Stars come first, but Western Conference comes second 🤘🏼",
        "label": "POS"
    },
    {
        "comment": "JOHNNY",
        "label": "POS"
    },
    {
        "comment": "a great defensive play by hronek ruined by the refs",
        "label": "NEG"
    },
    {
        "comment": "Seems like Mysh had a good game.",
        "label": "POS"
    },
    {
        "comment": "It's nice but I'm not even sure it's an achievement this season. Which if you think about it is even better.",
        "label": "POS"
    },
    {
        "comment": "Wolf looked great.  Settled in after those first 2",
        "label": "POS"
    },
    {
        "comment": "I predict Francis is going to be a busy guy during the deadline. I don't think it'll be a full on sale but I'd like to bring in some young guys with upside who aren't cracking some teams rosters, if possible. Kuzmenko could be cool",
        "label": "NEU"
    },
    {
        "comment": "Three's a crowd.",
        "label": "NEU"
    },
    {
        "comment": "This team needs to start checking and hitting hard. Nobody does it anymore.",
        "label": "NEG"
    },
    {
        "comment": "Wait he embarrassed himself? First I'm hearing this lol",
        "label": "NEG"
    },
    {
        "comment": "It's ok we can get younger next year. Also faceoffs don't matter as I've heard on the radio",
        "label": "NEU"
    },
    {
        "comment": "Cheered with everything we got. Repping him with his preds jersey tonight",
        "label": "POS"
    },
    {
        "comment": "The most optimistic thought with this roster is that Bedard and Hall would be able to score enough, and they were hoping Reichel would be the guy who could make the second line a threat. That clearly blew up in their face.",
        "label": "POS"
    },
    {
        "comment": "Those are some lovely forward lines! Now just sit Schenn for Stastney and they should be cooking.",
        "label": "POS"
    },
    {
        "comment": "Oilers lose!",
        "label": "NEG"
    },
    {
        "comment": "So we're now playing well for the first ten but completely give up after that. There's no winning with this team",
        "label": "NEG"
    },
    {
        "comment": "Sabres 1 - Bruins 0 - Refs 2",
        "label": "NEG"
    },
    {
        "comment": "He's doing nothing wrong - these are absolutely spectacular saves",
        "label": "POS"
    },
    {
        "comment": "That's an insane penalty call on Greig. Absolutely insane.",
        "label": "NEG"
    },
    {
        "comment": "Hmmm winning without dahlin?? Is he the problem??????",
        "label": "NEU"
    },
    {
        "comment": "Please don't fire DJ, I think he needs more time /s",
        "label": "NEG"
    },
    {
        "comment": "Deflection or not, pucks on net by 55 good things happen",
        "label": "POS"
    },
    {
        "comment": "Honestly a great period. Love the forecheck and seems like we arent dumping the puck in as much as we were before.",
        "label": "POS"
    },
    {
        "comment": "This team is a fucking yoyo",
        "label": "NEG"
    },
    {
        "comment": "Petey for Selke?",
        "label": "POS"
    },
    {
        "comment": "Josh Anderson with a big FU to tristen Jarry.",
        "label": "NEU"
    },
    {
        "comment": "Yup! Stoney just made them pay for turning it over to him.",
        "label": "NEU"
    },
    {
        "comment": "Sillinger playing 4D chess knowing we suck on the PP so he took one to even it up. Give him an assist on that goal.",
        "label": "NEU"
    },
    {
        "comment": "HOWS THAT SHOULDER, TJ???",
        "label": "NEU"
    },
    {
        "comment": "I like trying Benson and Mitts on the PK",
        "label": "POS"
    },
    {
        "comment": "HOLY FUCK BOYS THEY DID IT",
        "label": "POS"
    },
    {
        "comment": "OFFSIDES MUCH",
        "label": "NEU"
    },
    {
        "comment": "Sweet baby jesus that was intense",
        "label": "POS"
    },
    {
        "comment": "Maccelli 🤌",
        "label": "POS"
    },
    {
        "comment": "ROR has always been a Predator. He's just been under cover.",
        "label": "NEG"
    },
    {
        "comment": "Almost looks like a home game, do we always have that many fans in Buffalo?",
        "label": "POS"
    },
    {
        "comment": "AWOOOOOOOOOOOO (only two goals were tips) Ooooooooooo.",
        "label": "POS"
    },
    {
        "comment": "“Go leafs go” chant in MSG.  That should make everyone upset.",
        "label": "NEG"
    },
    {
        "comment": "Tomas Hertl.. potty mouth! Hahaha",
        "label": "NEU"
    },
    {
        "comment": "Missing tanev.",
        "label": "NEU"
    },
    {
        "comment": "Hello darkness my old friend",
        "label": "NEG"
    },
    {
        "comment": "We said the same about Carly last year and boy did we miss him.  Kuzy will get it together.  He does too much and his talent alone is worth it",
        "label": "POS"
    },
    {
        "comment": "The only reason I tune in anymore is to watch Dahlin. Man what a beaut!",
        "label": "POS"
    },
    {
        "comment": "It might genuinely be worse...",
        "label": "NEG"
    },
    {
        "comment": "Only 83 mph on that goal. Is Tage ok?",
        "label": "NEU"
    },
    {
        "comment": "Wtf is this goal song",
        "label": "NEG"
    },
    {
        "comment": "The reaction on that follow up is amazing 😍🤩",
        "label": "POS"
    },
    {
        "comment": "THANK THE HOCKEY GODS! 🖤❤️👹LET'S❤️‍🔥GO❤️‍🔥DEVILS!!!🏒🖤❤️",
        "label": "POS"
    },
    {
        "comment": "I feel like inconsistent teams are simply bad teams",
        "label": "NEG"
    },
    {
        "comment": "100% correct.",
        "label": "POS"
    },
    {
        "comment": "Please no overtime but if you have to then win",
        "label": "NEU"
    },
    {
        "comment": "I think Keefe overplayed the stars in OT. I would have liked to see Domi/Robertson get a look.",
        "label": "NEU"
    },
    {
        "comment": "Would be cool if they saw Karlsson do the same thing to Trocheck a few seconds later.",
        "label": "NEU"
    },
    {
        "comment": "Haula hasn't missed a game until his recent absence. Miller and Nosek started at scratches or in the AHL. We had a healthy, NHL roster to start the season, and we've seen the same problems with or without injuries.",
        "label": "NEU"
    },
    {
        "comment": "He looked in his glove thinking there was actually going to be another puck in there",
        "label": "NEU"
    },
    {
        "comment": "Benson is special",
        "label": "POS"
    },
    {
        "comment": "Fantastic 5v3 kill there, never let them get set up",
        "label": "POS"
    },
    {
        "comment": "God damn we deserved some puck luck!",
        "label": "NEU"
    },
    {
        "comment": "Schmid wasn't good, but I can't put the game on him considering he should not have started to begin. Vanecek is bad, but why wouldn't you throw him out there against the Sharks who are worse instead of playing the guy who faced 47 shots the previous night? It makes no sense whatosever.",
        "label": "NEG"
    },
    {
        "comment": "Damn that was a nice try BJA",
        "label": "POS"
    },
    {
        "comment": "two weak goals for sammy unfortunately and 2 posts for matthews, damn so close",
        "label": "NEG"
    },
    {
        "comment": "\"Worst penalty kill in the league\" they said.  Ah no no no, you see our Power-play unit is the best penalty kill in the league.  simple mistake I understand",
        "label": "NEG"
    },
    {
        "comment": "hell yeah brodz he deserves it",
        "label": "POS"
    },
    {
        "comment": "Omg if this comes back.....",
        "label": "NEU"
    },
    {
        "comment": "Serious question though.Is Francis stoned between every period? Dudes eyes barely open every damn time compared to pre game.",
        "label": "NEG"
    },
    {
        "comment": "ok don't let them cook too much",
        "label": "NEU"
    },
    {
        "comment": "I didn't say that we did. I'm saying the prediction in the article was that he would be Number 1 by the all-star break.",
        "label": "NEU"
    },
    {
        "comment": "We should try firing the coach, that sometimes works :/",
        "label": "NEG"
    },
    {
        "comment": "GUS 🚌",
        "label": "POS"
    },
    {
        "comment": "We're booing Zads right?",
        "label": "NEG"
    },
    {
        "comment": "This team really misses Schwartzy… it might be a long 6-8 weeks.",
        "label": "NEG"
    },
    {
        "comment": "Can't play down to your opponent if you're the worst team to make the playoffs.*taps head*",
        "label": "NEG"
    },
    {
        "comment": "Jiricek took 2 penalties and does not play on the penalty kill. I'm not sure where else you feel he should be playing because this kind of makes it impossible to throw him out there.",
        "label": "NEG"
    },
    {
        "comment": "Here we go with the broken sticks",
        "label": "NEG"
    },
    {
        "comment": "Post game interview cozens just admitted they're way too soft and they're to easy to play against",
        "label": "NEG"
    },
    {
        "comment": "His Bambi legs are back… he looked so strong to start the season, I'm sure he's super frustrated with whatever (groin?) injury it is.",
        "label": "NEG"
    },
    {
        "comment": "Just when you think this team just doesn't have it, they put in an effort like that to make us believe again.",
        "label": "POS"
    },
    {
        "comment": "Right?! That slew foot needed to be called.Tell me the refs don't have favorites...",
        "label": "NEG"
    },
    {
        "comment": "That's just bad puck luck",
        "label": "NEG"
    },
    {
        "comment": "It was such a weak call. That happens 10 times a game and doesn't get called",
        "label": "NEG"
    },
    {
        "comment": "HOW THE FUCK ISNT THAT BOARDING",
        "label": "NEG"
    },
    {
        "comment": "This is my third Stars game in Tampa. I've yet to see them wins. Maybe it's me...",
        "label": "NEU"
    },
    {
        "comment": "Well that was unfortunate. We played well after Brady sparked the team with his fight. However the game was half over by then. Something's got to give. This team is so brittle right now, and we need to get going.",
        "label": "NEG"
    },
    {
        "comment": "Of course we're the first team all year to let up more than a goal to San Jose",
        "label": "NEU"
    },
    {
        "comment": "They are so FUCKING good in OT",
        "label": "POS"
    },
    {
        "comment": "HOW DO YOU NOT GET A SINGLE SHOT ON NET IN 9 MINUTES OF PLAY??????",
        "label": "NEG"
    },
    {
        "comment": "Jarnkrok has played really really well tonight. The first goal against was 100% his guy but since he's skated great, absorbed hits and played the puck well",
        "label": "POS"
    },
    {
        "comment": "Completely different team tonight. Love to see it, keep it up for seven more minutes boys!",
        "label": "POS"
    },
    {
        "comment": "Holy fuck Vegas literally does get to do whatever they want. Holds. Hooks. Trips. But if someone falls against Myers? Penalty. Immediately. Fucking hate the Knights.",
        "label": "NEG"
    },
    {
        "comment": "wasted a Monahan goal sending him soo late.",
        "label": "NEG"
    },
    {
        "comment": "I cant believe i was so excited for this game. This was so disappointing. I hope the boys find their groove soon.",
        "label": "NEG"
    },
    {
        "comment": "McCabe I said it earlier this game but it's awesome having a D core that's stepping up on guys.  Love to see it! And it's why we all were on Schenns dick. McCabe has absoluy trucked two guys in the last two games. I can't believe they didn't take Lindgren in for concussion protocol. In a game with Trouba on the ice and we have the biggest hit of the night.  Kampffs pots another.Chefs kiss",
        "label": "POS"
    },
    {
        "comment": "Canes fans thinking we have a goalie problem might seem quaint to them.",
        "label": "NEU"
    },
    {
        "comment": "Schneider gets drilled from behind and OTT gets a powerplay. I couldn't imagine being as bad at my job as these refs are",
        "label": "NEG"
    },
    {
        "comment": "Shit…",
        "label": "NEU"
    },
    {
        "comment": "my eastern conference dad johnny t got the 1000th point against the former team, glad we don't have the fear that",
        "label": "NEU"
    },
    {
        "comment": "JO-EY JO-EY JO-EY 🩵",
        "label": "POS"
    },
    {
        "comment": "Remember when we thought Andlauer was our saviour? Good times.",
        "label": "POS"
    },
    {
        "comment": "We got smacked. Learn from it, move on.",
        "label": "NEG"
    },
    {
        "comment": "Matty you gotta finish!! Good effort",
        "label": "POS"
    },
    {
        "comment": "5 greasy trips from Vegas in a row, no calls. Talk about game management. Bettman must have personally called the refs in between periods and threatened their salaries Jesus fucking christ",
        "label": "NEG"
    },
    {
        "comment": "Wasn't much to cheer for. Kadri gliding into Wolf is inexcusable from a player who makes that much money",
        "label": "NEG"
    },
    {
        "comment": "I really need the Stars to just start flexin on MFers",
        "label": "NEU"
    },
    {
        "comment": "On pace for 11 shots...",
        "label": "NEU"
    },
    {
        "comment": "Go watch the Checkers games. Knight has been pretty solid. Checkers defense is atrocious. Lundell had a rough game vs the Canadiens, but the kid wins a shit ton of faceoffs and plays an aggressive two way game that saved at least one breakaway last night. He's getting sog and just not connecting.The dooming on Lundell is crazy.Edit: I just saw you're rocking Chairot flair. OH BOY",
        "label": "NEG"
    },
    {
        "comment": "That's game. Shit 5v3.",
        "label": "NEG"
    },
    {
        "comment": "Upside to a pospisil scratch is he has terrible injury history so no harm in a bit of load management with him, especially with Duehr waiting in the wings",
        "label": "NEU"
    },
    {
        "comment": "Honestly I felt we played really well. It was fair to criticize the D and goaltending in some of our last few games. This game however, we seemed to actively address our defense, zone exits, etc.",
        "label": "POS"
    },
    {
        "comment": "This first line looks absolutely fucking lost. Two panthers by the crease and both D men are looking at the point",
        "label": "NEG"
    },
    {
        "comment": "If y'all want a nice distraction,  turn on the Yotes game. It's fucking awesome so far as long as you don't like the Caps.",
        "label": "POS"
    },
    {
        "comment": "Experience flames hockey",
        "label": "NEG"
    },
    {
        "comment": "2 minutes for being bigger than the other guy?",
        "label": "NEG"
    },
    {
        "comment": "He's making the transition as a winger.  Bordeleau looked incomplete as a center in the NHL.",
        "label": "NEU"
    },
    {
        "comment": "It's not just about low percentage areas, it's about how it's predictable. Goalies and dmen know how to read Ottawa's offense really easily because it's the same every time they have the puck. They know what's coming.",
        "label": "NEU"
    },
    {
        "comment": "Yak attack!",
        "label": "POS"
    },
    {
        "comment": "The good news, Hubey has been the best Flame tonight.The bad news, that's not a hard task.",
        "label": "POS"
    },
    {
        "comment": "I am now obsessed with QB getting a hat trick. Please hockey gods",
        "label": "POS"
    },
    {
        "comment": "Im done with Pete for a while. Get your fucking shit together. You hold out in contract talks because you want to “focus on the season” and fucking disappear for 12 fuckin games straight, Well. Not even disappear, be visible in the worst fucking way you can as an “all star” player. Man's asking for Matthews money while putting up 5 points in 12 games. Please.",
        "label": "NEG"
    },
    {
        "comment": "Are they running without puck netting above the glass?",
        "label": "NEU"
    },
    {
        "comment": "zuuuuuuuuuucccccc",
        "label": "NEU"
    },
    {
        "comment": "How do we trick Zibanejad into thinking they're always on the powerplay Alternatively, is there a way we can always be on the powerplay?",
        "label": "NEU"
    },
    {
        "comment": "Task failed successfully.",
        "label": "NEU"
    },
    {
        "comment": "Nah, wasn't a high stick. He caught him on the follow-through shooting the puck into the zone.",
        "label": "NEU"
    },
    {
        "comment": "This is the team I've been waiting to watch all season",
        "label": "POS"
    },
    {
        "comment": "Imagine using one period as a representative save percentage",
        "label": "NEU"
    },
    {
        "comment": "Tro got the 3rd",
        "label": "NEU"
    },
    {
        "comment": "AW DeSmith looks so happy too!!!!",
        "label": "POS"
    },
    {
        "comment": "Panarin vs ex Rangers night",
        "label": "NEU"
    },
    {
        "comment": "FUCCCCCK THE NHL FUCK THE NHLFUCKTHE NHL",
        "label": "NEG"
    },
    {
        "comment": "thats a vintage sam excuse me right there",
        "label": "NEU"
    },
    {
        "comment": "Fuck that would have been a beautiful pass and finish between Garland/Joshua",
        "label": "POS"
    },
    {
        "comment": "This has been Wolf's best period in the nhl",
        "label": "POS"
    },
    {
        "comment": "He didn't even try and he's still out there.",
        "label": "NEG"
    },
    {
        "comment": "way better player than connor \"rossi's biatch\" Bedard for sure",
        "label": "POS"
    },
    {
        "comment": "Fantastic start",
        "label": "POS"
    },
    {
        "comment": "Leah Hextall fucking sucks",
        "label": "NEG"
    },
    {
        "comment": "Nemec is going to fit right in. LFG",
        "label": "POS"
    },
    {
        "comment": "Man I could do with a 649 win. Don't even want that much. Enough to pay off the mortgage would be perfect.",
        "label": "POS"
    },
    {
        "comment": "Its time to start worry about Cozens, he\\`s been attrocious",
        "label": "NEG"
    },
    {
        "comment": "Dang that was a great set up",
        "label": "POS"
    },
    {
        "comment": "Okay VERY rough start, but hey we brought it back to even so all in all okay.",
        "label": "POS"
    },
    {
        "comment": "HAHA BYE BRUINS",
        "label": "NEU"
    },
    {
        "comment": "Papi!",
        "label": "POS"
    },
    {
        "comment": "Let's draft some more defensemen!",
        "label": "NEU"
    },
    {
        "comment": "Consistency? Never heard of her 😭",
        "label": "NEG"
    },
    {
        "comment": "He's looking pretty good once again. I wasn't sure if he was gonna be dependable enough but he can make some really athletic saves",
        "label": "POS"
    },
    {
        "comment": "This Vasilevskiy bloke is pretty good, huh",
        "label": "POS"
    },
    {
        "comment": "He wasn't telling the ref, he was stalling for time so his slow replay team could make the call.",
        "label": "NEU"
    },
    {
        "comment": "I didn't realize I was watching the Flames own team feed.",
        "label": "NEU"
    },
    {
        "comment": "Feel sorry for all the fans who paid with their hard earned money.   Samsonov should give the fans a refund",
        "label": "NEG"
    },
    {
        "comment": "Monty and Slaf looked great",
        "label": "POS"
    },
    {
        "comment": "Johnson Fantilli and Bemstrom are too creative. Bench em",
        "label": "NEG"
    },
    {
        "comment": "It is definitely hurting the marketability of the league. There are people who only watch hockey on the weekends just to listen to THIS",
        "label": "NEG"
    },
    {
        "comment": "I put that on Eberle. Why the hell would you drop it off to Oleksiak right there",
        "label": "NEG"
    },
    {
        "comment": "Why was that not icing?",
        "label": "NEG"
    },
    {
        "comment": "The refs are taking a physical beating today. Such a shame...",
        "label": "NEG"
    },
    {
        "comment": "#HOLY FUCK HAYS",
        "label": "NEU"
    },
    {
        "comment": "Edmonton hoped he'd turn into a top 6 scorer, but he hasn't developed that way. At this point I think we know he's a bottom 6 guy.",
        "label": "NEG"
    },
    {
        "comment": "EVERYBODY HIT EVERYBODY!",
        "label": "NEU"
    },
    {
        "comment": "1-8-0 when Trailing after 2 periods. Now that, is a DJ Smith stat.",
        "label": "NEG"
    },
    {
        "comment": "I'm gunna be honest, I would have gotten the same amount of entertainment if they would have lost that OT with the way this season is going. What an awkward locker room that's gotta be rn.",
        "label": "NEG"
    },
    {
        "comment": "Huberdeau actually infuriates me, I have never disliked one of our own players so much. What the hell happened. This is gonna go down as one of the worst NHL contracts in history",
        "label": "NEG"
    },
    {
        "comment": "refs with their worst week in a long time",
        "label": "NEG"
    },
    {
        "comment": "Like, 1st pass I'm pissed he didn't just shoot across the grain. But it was a sick pass and Barbie should have driven far side. Ugh",
        "label": "NEG"
    },
    {
        "comment": "Battle of the Lindgrens > Battle of the Hughes",
        "label": "NEU"
    },
    {
        "comment": "Why no sharo but lindholm",
        "label": "NEG"
    },
    {
        "comment": "Awful game to be at. I was also at the Panthers blow out a couple weeks ago.Safe to say I aint coming back for a while. Fucking pathetic",
        "label": "NEG"
    },
    {
        "comment": "#ME IS BIG SAD",
        "label": "NEG"
    },
    {
        "comment": "Nylander coasting but he was out of gas. Should have put a fresh player on.",
        "label": "NEU"
    },
    {
        "comment": "Known dirty dangler Drew Doughty",
        "label": "NEU"
    },
    {
        "comment": "Yep, which is nice to see finally. I hope Kuzy also gets his confidence back soon",
        "label": "POS"
    },
    {
        "comment": "Tripped over the blue line.",
        "label": "NEU"
    },
    {
        "comment": "he's got that youthful energy, only 18 years old. understandable that the 23 year olds would have to coast a bit, practically geriatric.",
        "label": "NEU"
    },
    {
        "comment": "Myers fuck",
        "label": "NEU"
    },
    {
        "comment": "This is needless Vitek besmirchment",
        "label": "NEG"
    },
    {
        "comment": "Jedi master Levi!",
        "label": "POS"
    },
    {
        "comment": "A little extreme bro",
        "label": "NEU"
    },
    {
        "comment": "Big Gordie Howe energy from Cozens there",
        "label": "POS"
    },
    {
        "comment": "I mean, he looked good in preseason I guess. I am not hating on the kid. All I am saying is that we drafted a dman with limited offensive upside (forget about the points, this has been a concern since before the draft) while we have no offensive talent.",
        "label": "NEU"
    },
    {
        "comment": "Someone knock Tom Wilson down please!",
        "label": "NEG"
    },
    {
        "comment": "Ughh",
        "label": "NEG"
    }
]