[
    {
        "comment": "had to look it up, we actually had a 9 game losing streak in the inaugural season, glad we didn't tie that one",
        "label": "NEG"
    },
    {
        "comment": "That's not irrational. For what he makes, expecting him to have a more consistent impact on games is fair. He has sucked this year",
        "label": "NEG"
    },
    {
        "comment": "Greig is such a pest lol",
        "label": "NEG"
    },
    {
        "comment": "The NHL and ad breaks, holy shit...",
        "label": "NEG"
    },
    {
        "comment": "The snake bite is real on Cozens. Should have buried that game-tying goal out front",
        "label": "NEG"
    },
    {
        "comment": "Move over Power, Clifton is my whipping boy tonight. He should ride the pine the rest of the way.",
        "label": "NEG"
    },
    {
        "comment": "Jesus KEVIN! ... your move behind the net there is not why I'd like to be shouting KEVIN!",
        "label": "NEG"
    },
    {
        "comment": "This team was over performing early on with lots of 1 goal wins. Reality is kicking in. Kred and Zib are terrible 5v5 and need someone else on that line… not a 4th liner. Wheeler is a complete bust. These  Hartford kids are not gonna get this done. We need a trade or a complete mix of lines …. Something",
        "label": "NEG"
    },
    {
        "comment": "I thought we looked mostly fine defensively tonight, and  excellent on D in the 2nd and 3rd in Calgary.  But...really the Devils did not play great D at Seatlle or Vancouver.   So can we really say the Devils look like the D is better without Hamilton?  Isn't the D still uneven?  Sometimes fine, other times not good?",
        "label": "NEG"
    },
    {
        "comment": "Alright, there's our 0-2.  Now the game can begin.",
        "label": "NEU"
    },
    {
        "comment": "I hate how bipolar this team is, last period was so good and now we look like a bunch of ECHLers",
        "label": "NEG"
    },
    {
        "comment": "I forget Bratt is on this team sometimes",
        "label": "NEG"
    },
    {
        "comment": "every time I see huberdeau, I hear dumb guy trombone music.  fuck this clown.",
        "label": "NEG"
    },
    {
        "comment": "FFFFUUUUUUUUUUU",
        "label": "NEG"
    },
    {
        "comment": "I spoke with Matty Ellis in between periods. He said whoever scores more goals wins and so far we're not doing that.",
        "label": "NEG"
    },
    {
        "comment": "I was there… fucking sucked. My friend completely lost his shit. Just a horrible melt down.",
        "label": "NEG"
    },
    {
        "comment": "What. The. Fuck. Happened. I switched to the cavs game at the end of the 2nd. Like... how.",
        "label": "NEG"
    },
    {
        "comment": "this is what drives me crazy about eye testers, the Devils *had a bad game defensively* and you're bringing up practice and shit? cmon man, take it for what it was, a bad game defensively that Schmid bailed them out for, they're still top 10 in xGA and HDCA.",
        "label": "NEG"
    },
    {
        "comment": "I'm really annoyed at that penalty. What the fuck The was the point of that Olivier???",
        "label": "NEG"
    },
    {
        "comment": "someone should tell them they'd fuckin win a lot more if they didn't wait until the 3rd to play like that",
        "label": "NEG"
    },
    {
        "comment": "I AM SO TORQUED",
        "label": "POS"
    },
    {
        "comment": "It's always hard to remember we're the top team right now when we have periods like that. I'd like a period where we remind them all why we are the top team, please.",
        "label": "NEG"
    },
    {
        "comment": "Streaky players make fans pull our hair out.",
        "label": "NEG"
    },
    {
        "comment": "I haven't caught this game till the 3rd. But looking over stats it's pretty consistent game after game that Mercer is just a black hole offensively atm. Idk what's with him, he looked like the future of NJ past 2 seasons and even towards the end of last season and during playoffs he was ripping some crazy shots to boot. This season hes just not working out. I'd even send him to ahl if we didn't need the bodies. The thing that makes sense to me is that if he's going to generate no offense and at least hold down the defense, they should staple him to the 4th line with McLeod and Bastian. As the season progresses they tried everyone to get him and holtz going and really only Haula barely managed to get the line going. People here complain that timo isn't playing well but frankly it's a repeating pattern that has continued. They tried Lazar, Haula, McLeod and now Meier. And damn if the stat line from the Vancouver game isn't devastating. Y'all can see it here , it's the worst performance for a NJ line I've seen this season or last. And that was a bad defensive game for them. Overall, theyre not caving in but dang if every single line he's a part of doesn't die offensively. I was alright to see if they get going because Haula was back to center Hughes and toffoli. But the second a top 6 player is out of the lineup, it's usually a shuffle of depth guys and wherever Mercer lands is bad. We got this salary cap from Hamiltons ltir, so I hope Fitz can acquire someone SOON cause we're so f****** thin. Every injury at this point is cause to lose games we shouldn't. And I don't wanna hear how well we've been doing. I know we had a solid road trip. It's just we haven't seen peak team performance and it absolutely looks like we're playing a man down even with a full roster. Of course we are. Last season we ended schedule with Mercer on the top line with Hischier and Tatar and they were actually playing like a top line. We're genuinely down a top 6 player that was a given, coming into this season.",
        "label": "NEG"
    },
    {
        "comment": "...what's with all the deleted posts lately?",
        "label": "NEG"
    },
    {
        "comment": "SJ is 0-10 on the road....come on, man.",
        "label": "NEG"
    },
    {
        "comment": "Wtf",
        "label": "NEG"
    },
    {
        "comment": "How the fuck LMAO",
        "label": "NEG"
    },
    {
        "comment": "Of course they score a goal off of a soft power play. Please Stars dont let that be the game winner",
        "label": "NEG"
    },
    {
        "comment": "PTSD from last year hearing OEL's name called",
        "label": "NEG"
    },
    {
        "comment": "Detroit game is so much more entertaining than the hawks game  our lack of offense make it hard to watch sometimes",
        "label": "POS"
    },
    {
        "comment": "fiala drives me fucking insane",
        "label": "NEG"
    },
    {
        "comment": "Can we uh.. not take a 2manyman next period pls",
        "label": "NEG"
    },
    {
        "comment": "I swear laf would be 25+ points if backups werent robbing him and his teammates missing freebies",
        "label": "NEG"
    },
    {
        "comment": "Things feel worse this season than last almost across the board.It's hard to believe even if we lose this game we are on the same pace as this time last year.",
        "label": "NEG"
    },
    {
        "comment": "Damn finally tie it up and let in that garbage",
        "label": "NEG"
    },
    {
        "comment": "Huberdeau almost plays like he's trying to not be noticed out there",
        "label": "NEG"
    },
    {
        "comment": "Isn't he playing with a different stick? He seems to not be able to keep passes on his stick rn. I wonder at a certain point if he goes back to ol reliable.",
        "label": "NEU"
    },
    {
        "comment": "Expectation: close game, but we get the winReality: another major injury, and we get destroyed",
        "label": "NEG"
    },
    {
        "comment": "I am ready to be hurt again",
        "label": "NEG"
    },
    {
        "comment": "Maybe 1 too many shots taken but w/e. Everyone in the building who draws breath knew that was going to happen.",
        "label": "NEG"
    },
    {
        "comment": "Rangers just love making shit teams look good",
        "label": "NEG"
    },
    {
        "comment": "When did he get shit on? As far as I could tell it flew under the radar and I even heard people defending him. The narrative on team 1200 was it's his \"passion\". It's too late to boo him now obviously but im saying he deserved it. It should have been a light booing and then we could move on. And im not going to get over being called out for spending my hard earned money on a dog shit team. If you're happy with a captain calling out fans that's fine with me but don't tell me how to fan.",
        "label": "NEG"
    },
    {
        "comment": "He was getting hooked the whole time... That should be a penalty shot, based on the pesky rules.",
        "label": "NEG"
    },
    {
        "comment": "Nope. Making his mistake even worse.",
        "label": "NEG"
    },
    {
        "comment": "Gonna sit this one out. Can't stand seeing you know who beat up on us again. Major respect the souls who will be watching.",
        "label": "NEG"
    },
    {
        "comment": "I feel like there are too many people trying to fix the glass 😂",
        "label": "NEU"
    },
    {
        "comment": "Wolf does break out pace to catch the change instead of the icing call. We ice it on the next pass.Experience flames hockey.",
        "label": "NEU"
    },
    {
        "comment": "Daccord has amply demonstrated he is not the problem here. 🤦🏻‍♂️",
        "label": "POS"
    },
    {
        "comment": "Oh no we suck again",
        "label": "NEG"
    },
    {
        "comment": "Mermis in for Goose per Russo and McLellan.",
        "label": "NEU"
    },
    {
        "comment": "You're holding up time. You gotta do something!",
        "label": "NEG"
    },
    {
        "comment": "no",
        "label": "NEU"
    },
    {
        "comment": "Hoping we score more than 1 goal.",
        "label": "POS"
    },
    {
        "comment": "That was Nemec pinching :(",
        "label": "NEG"
    },
    {
        "comment": "WHAT THE FUCK AAAAAAA YESSSSSSSS RAAAAHHH AWOOOOOOO",
        "label": "POS"
    },
    {
        "comment": "Nothing would make me happier than hanging 6 on the leafs",
        "label": "POS"
    },
    {
        "comment": "Chabot is back on the bench, man is an absolute workhorse",
        "label": "POS"
    },
    {
        "comment": "This is rigged as fucked",
        "label": "NEG"
    },
    {
        "comment": "who said what? WTF was that?",
        "label": "NEG"
    },
    {
        "comment": "really hope we don't have to play Chicago in a nationally televised game...",
        "label": "NEG"
    },
    {
        "comment": "Ooohh boy last I checked we were up 3-0 :-(",
        "label": "NEG"
    },
    {
        "comment": "BOYS WHAT IS GOING ON",
        "label": "NEG"
    },
    {
        "comment": "You haters and flaky asses can't celebrate. Congrats to all the loyalists who knew the slump would end",
        "label": "POS"
    },
    {
        "comment": "dubois looks kinda lost",
        "label": "NEG"
    },
    {
        "comment": "I want an Evans goal SO BAD",
        "label": "POS"
    },
    {
        "comment": "Pros: Lankinen continues to prove that he deserves starting time, or third period was our best, Parsnips and Evangelista got points tonightCons: literally everything else",
        "label": "POS"
    },
    {
        "comment": "Who's the asshole cutting onions in here?!",
        "label": "NEG"
    },
    {
        "comment": "Im assuming its with UK from « Suit Up » He does the sens and media guys. He did my wedding suit. 10/10 would recommend.",
        "label": "POS"
    },
    {
        "comment": "Are you kidding me right now with this lady?!",
        "label": "NEG"
    },
    {
        "comment": "So Petey got the GWG on a tip in from his own end, directly into center of the back of the goal. Was it going in without the tip? Either way his tip could not have been more perfect",
        "label": "POS"
    },
    {
        "comment": "BRING ON ST LOUIS",
        "label": "POS"
    },
    {
        "comment": "YESSSSS!",
        "label": "POS"
    },
    {
        "comment": "We played it Sunday. And completely abandoned it tonight.",
        "label": "NEG"
    },
    {
        "comment": "Losing their shit about Gilbert lol",
        "label": "NEG"
    },
    {
        "comment": "Damn this one really hurt... Love you Kraken fam<3",
        "label": "NEG"
    },
    {
        "comment": "Yeah but that's Calgary though. Choking runs deep in their veins.",
        "label": "NEG"
    },
    {
        "comment": "Vegas was Bigger, Heavier, Stronger, Faster, Tougher, Hungrier. Canucks have to step it up a notch to be amongst the elite contenders.",
        "label": "POS"
    },
    {
        "comment": "We totally did not deserve this game but heck we fought back and Igor stood on his head.",
        "label": "POS"
    },
    {
        "comment": "Leafiest way to do it. Point at least",
        "label": "NEU"
    },
    {
        "comment": "Thanks for scoring again for insurance 🫶🏻",
        "label": "POS"
    },
    {
        "comment": "Chabot needs to not softly lose the puck right in front of him .",
        "label": "NEG"
    },
    {
        "comment": "Well the wild don't have enough players to field a football team.",
        "label": "NEG"
    },
    {
        "comment": "Solo! Zary!",
        "label": "POS"
    },
    {
        "comment": "It could very well be those top teams have an extra gear we don't have yet when it matters",
        "label": "NEU"
    },
    {
        "comment": "Going to watch a little Redwings before the Hawks game. Kane is playing tonight.",
        "label": "NEU"
    },
    {
        "comment": "Good wire to wire effort and immaculate leadership by our captainFuck the Kings forever",
        "label": "POS"
    },
    {
        "comment": "More bag skates, let's Doja Lat for this team",
        "label": "NEG"
    },
    {
        "comment": "Personally I don't think we're there yet. I still think k we are a playoff team…just not a Stanley Cup team.",
        "label": "NEU"
    },
    {
        "comment": "Tristan Jarry goalie goal got me pumped for more hockey let's go Canucks",
        "label": "POS"
    },
    {
        "comment": "Holy fuck how did they not whistle sooner for Gus?",
        "label": "NEG"
    },
    {
        "comment": "Have tickets for Tuesday nights vs the Red Wings and I'm kind of dreading going.",
        "label": "NEG"
    },
    {
        "comment": "Sure, but it was boarding.",
        "label": "NEU"
    },
    {
        "comment": "Dakota Joshua has turned into a solid penalty killer. I don't remember how we got him but what a good pickup by chef allvin",
        "label": "POS"
    },
    {
        "comment": "The chemistry between karlsson and marchy is irreplaceable",
        "label": "POS"
    },
    {
        "comment": "PDO IS BACK ON THE MENU BOYS!!!",
        "label": "POS"
    },
    {
        "comment": "#BLUES KICKASS",
        "label": "POS"
    },
    {
        "comment": "Slaf winning board battles 1 vs. Many. Wtf.",
        "label": "POS"
    },
    {
        "comment": "Here we go with the \"confusing players with players from 15 years ago\" again.",
        "label": "NEG"
    },
    {
        "comment": "Coach stuff, trying to give the guy some confidence.",
        "label": "POS"
    },
    {
        "comment": "Ryan Carpenter proves he can score at MSG",
        "label": "POS"
    },
    {
        "comment": "They can't all be posters.",
        "label": "NEU"
    },
    {
        "comment": "Bieksa really is a freaking gem on this panel",
        "label": "POS"
    },
    {
        "comment": "Huberdeau jersey ordered !!!! This man is waking up",
        "label": "POS"
    },
    {
        "comment": "The issue is that they have repeatedly demonstrated that they are capable of absolutely exceptional play when they are in a come from behind situation but it seems like they just barely try until they have to.",
        "label": "NEG"
    },
    {
        "comment": "Well for one. Not having to come back to win every single game, or to win a game by more than one goal would be a nice change",
        "label": "POS"
    },
    {
        "comment": "EDDDDDDDDD",
        "label": "POS"
    },
    {
        "comment": "Clutch move Spurgeon!",
        "label": "POS"
    },
    {
        "comment": "We never had the lead... we don't want to end games like that in regulation.",
        "label": "NEG"
    },
    {
        "comment": "It's a new feature. Enjoy!!",
        "label": "POS"
    },
    {
        "comment": "That was heartbreakingBut at least not embarrassing",
        "label": "NEG"
    },
    {
        "comment": "I was pretty sure Command Centre was going to overturn that last goal on account of pass interference.Strange game. Really good win.",
        "label": "POS"
    },
    {
        "comment": "That better not be a bloody concussion",
        "label": "NEG"
    },
    {
        "comment": "I don't even wanna see Hughes and Hronek's TOIOh they're decent. Looks like Tocc gave up on the game",
        "label": "NEG"
    },
    {
        "comment": "It's not that his defense is old as AF?",
        "label": "NEG"
    },
    {
        "comment": "Jack and Luke running into each other is pretty fucking funny I can't lie",
        "label": "POS"
    },
    {
        "comment": "Damn that was a rough ending.  Could have been disastrous.  Thankfully we get the 2 pts and get the hell out of there.",
        "label": "NEG"
    },
    {
        "comment": "Great win! Lukie deserved it after that hit. Random question, it's my girlfriends birthday Tuesday and she wants to go to the game tomorrow night. Has anyone ever sat at the tables in section like 12-14? How is the view? Is food included? I can't find much on the sub. It looks like they're below the restaurant ledge",
        "label": "POS"
    },
    {
        "comment": "He's due for a 5 point game!",
        "label": "POS"
    },
    {
        "comment": "IN THE WIN COLUMN",
        "label": "POS"
    },
    {
        "comment": "Yeah the duality of this game was crazy. The first period was about as bad as we have played all season and the second and third were probably the best we have played in the last 14 or so games lol",
        "label": "POS"
    },
    {
        "comment": "Thank you brother!",
        "label": "POS"
    },
    {
        "comment": "Yeah you're right that Dj doesn't outwardly show much emotion but he allows his teams emotions to dictate the game. It seems like since he got here he's being trying to establish a high-energy, high emotion game that is \"hard to play against.\" He doesn't calm his team down and doesn't manage in game. Dude just learned what a time out is 5 days ago.",
        "label": "NEG"
    },
    {
        "comment": "They're both equally bad.",
        "label": "NEG"
    },
    {
        "comment": "The biggest area this team needs to improve is the first pass in our own zone. Partly personnel and partly just basic execution.",
        "label": "NEU"
    },
    {
        "comment": "great birthday present from the wild",
        "label": "POS"
    },
    {
        "comment": "JT BABY THATS ONE!",
        "label": "POS"
    },
    {
        "comment": "don't blame Soders!He's just doing his role towards 1OA!",
        "label": "POS"
    },
    {
        "comment": "What a nice play by Slaf!!",
        "label": "POS"
    },
    {
        "comment": "Its maybe just mental thing",
        "label": "NEU"
    },
    {
        "comment": "Am I reading this right? LA has played 5 less games than us? Edmonton has a 5 day break in between games?Must be nice to have some rest!",
        "label": "NEU"
    },
    {
        "comment": "Oh no we suck again",
        "label": "NEG"
    },
    {
        "comment": "Kevin Hayes heard all y'all talking shit and clapped back (he had to wait for us to draw first blood, obviously)",
        "label": "NEG"
    },
    {
        "comment": "Someone freaking help wedge",
        "label": "NEG"
    },
    {
        "comment": "I'm not a fan of shootouts. I hope this game doesn't go to one.",
        "label": "NEG"
    },
    {
        "comment": "Look at me, I'm Chris Vosters:Bedard!Jones!Bedard!Kurashev!",
        "label": "POS"
    },
    {
        "comment": "So many ad breaks fuck",
        "label": "NEG"
    },
    {
        "comment": "Yes",
        "label": "POS"
    },
    {
        "comment": "Winning teams don't give up 2 leads in a game",
        "label": "NEU"
    },
    {
        "comment": "Damn bro you're putting a lot of energy into this DJ hate. Do you have any other insight or input? Or the only thing your pea brain knows is fire dj?",
        "label": "NEG"
    },
    {
        "comment": "GUSTAVSSON THE BUSTAVSSON",
        "label": "POS"
    },
    {
        "comment": "You can't scratch that contract",
        "label": "NEG"
    },
    {
        "comment": "I too endorse the Nuclear Option.",
        "label": "NEU"
    },
    {
        "comment": "Brutal",
        "label": "NEG"
    },
    {
        "comment": "For all the doom and gloom about this team the Stars are yet to lose more than 2 games in regulation in a row under PDB.",
        "label": "NEU"
    },
    {
        "comment": "Interesting, that's fair. It was more the rolling R that got me though. Would that have been similar?",
        "label": "POS"
    },
    {
        "comment": "Okay. Well. Okay.",
        "label": "NEU"
    },
    {
        "comment": "I hate when a PP is split by periods",
        "label": "NEG"
    },
    {
        "comment": "I guess you kneed to see a doctor.",
        "label": "NEU"
    },
    {
        "comment": "\"How bad can Martin Jones be, really?\"Truly a cursed thought.",
        "label": "NEG"
    },
    {
        "comment": "Ugh. If we could have kept the first period going, we would have been good. On to tomorrow !!",
        "label": "POS"
    },
    {
        "comment": "Spencer Stastney seems better by the shift.",
        "label": "POS"
    },
    {
        "comment": "Sabres are fucking cunts",
        "label": "NEG"
    },
    {
        "comment": "Doomers in shambles",
        "label": "NEG"
    },
    {
        "comment": "alright rossi, now is your time to shine",
        "label": "POS"
    },
    {
        "comment": "Wow fucked again",
        "label": "NEG"
    },
    {
        "comment": "That's two games that Flames should have won in a row.... I'm going to drink beer now.",
        "label": "NEG"
    },
    {
        "comment": "I absolutely do not care that we won. Played like absolute dog shit and lost the guy who won us the game for an unknown amount of time. We won the battle but continue to lose the war.",
        "label": "NEG"
    },
    {
        "comment": "I love Zary.",
        "label": "POS"
    },
    {
        "comment": "Season's over see you guys at the draft",
        "label": "NEG"
    },
    {
        "comment": "Every single NHL ref is a useless asshole.",
        "label": "NEG"
    },
    {
        "comment": "Patience",
        "label": "POS"
    },
    {
        "comment": "A fight was a given to happen",
        "label": "NEU"
    },
    {
        "comment": "FUCK OFF TNT EVEN WHEN WE WIN YOU CANT GIVE US FULL CREDIT AHAHAHA FUCK YOU",
        "label": "NEG"
    },
    {
        "comment": "THANK YOU TYE 💜💜💜",
        "label": "POS"
    },
    {
        "comment": "HUGE game tonight, as your Ottawa Senators could move up from 16th in the conference, to 15th!!! If the CBJ lose, that is.",
        "label": "POS"
    },
    {
        "comment": "well the NHL is definitely loving this one",
        "label": "POS"
    },
    {
        "comment": "So we is allowed to play from the start. I'll give Thompson credit. He's gotten saved by the knights defense so far.Shocker it makes the goalie have to do shit when at least 1 guy crashes the net and hangs out there... Remind me again why it's the small 18 year old?",
        "label": "NEG"
    },
    {
        "comment": "The Kings certainly do!",
        "label": "POS"
    },
    {
        "comment": "is this finally the answer to the curse?",
        "label": "POS"
    },
    {
        "comment": "Fun Fact!The Devils are 4-1-1 on games where they don't look like shit in the first period.",
        "label": "POS"
    },
    {
        "comment": "More likely to get hurt when your team requires 10+ outrageous saves.",
        "label": "NEG"
    },
    {
        "comment": "#18-4-1#LGR!",
        "label": "POS"
    },
    {
        "comment": "Shelly carries though",
        "label": "POS"
    },
    {
        "comment": "Inquiring minds want to know -- how do you drink it?",
        "label": "NEU"
    },
    {
        "comment": "ahh... we're toast",
        "label": "NEG"
    },
    {
        "comment": "We put Boris on waivers but not soderblom?",
        "label": "NEU"
    },
    {
        "comment": "R.I.P Cousins, your death awaits buddy.",
        "label": "NEG"
    },
    {
        "comment": "Where would you put him? Vrana is just a guy, unfortunately",
        "label": "NEG"
    },
    {
        "comment": "Is Boone out?",
        "label": "NEU"
    },
    {
        "comment": "Score a goal. Take a penalty. Why break tradition?",
        "label": "NEU"
    },
    {
        "comment": "So it's Kaprizov, Hartman and Dewar?",
        "label": "NEU"
    },
    {
        "comment": "Hoping for a better night tonight against the rangers.  Also at the stars/lightning game in Dallas right now.  Duchene has had a pretty good start to the season but is entering a slump and looks lazy on the ice.  Still think it was a good GMBT move",
        "label": "POS"
    },
    {
        "comment": "Is that just the plot of Austin Powers?",
        "label": "NEU"
    },
    {
        "comment": "That dad looked bored as hell after that goal lmao",
        "label": "NEG"
    },
    {
        "comment": "Clearing the zone can't be this difficult",
        "label": "NEG"
    },
    {
        "comment": "Guy looked at their schedule as a new coach and went “well at least they won't hate me for the first game”",
        "label": "NEG"
    },
    {
        "comment": "whichever ref just announced that penalty sounds like he's still going through puberty",
        "label": "NEG"
    },
    {
        "comment": "We can't close on our chances at all tn",
        "label": "NEG"
    },
    {
        "comment": "Lmao vladdy 😂",
        "label": "POS"
    },
    {
        "comment": "SICK INDIVIDUAL",
        "label": "POS"
    },
    {
        "comment": "Bolds :(",
        "label": "NEG"
    },
    {
        "comment": "That's a pretty complete effort against a good team. Looked comfortable holding the lead and limiting most chances to the outside.Kucherov looked frustrated, and Boeser passed him in goals to tie the league lead.All in all, a really good night.",
        "label": "POS"
    },
    {
        "comment": "Capitals hockey.",
        "label": "NEU"
    },
    {
        "comment": "Lol caufield in his elite playmaker arc",
        "label": "POS"
    },
    {
        "comment": "How? How are there 3 worse looking PPs in the league?",
        "label": "NEG"
    },
    {
        "comment": "whoevers goal it was, that was a great play by Meier and hopefully it gets him going stronger",
        "label": "POS"
    },
    {
        "comment": "Kinda feels like we GOTTA win this. They are on a second half of b2b. And just not great in general. And I fucking hate them",
        "label": "NEG"
    },
    {
        "comment": "Fucking damn it",
        "label": "NEG"
    },
    {
        "comment": "I no longer care about wins, I just want Bedard to pick up points",
        "label": "NEU"
    },
    {
        "comment": "Thought so too!",
        "label": "NEU"
    },
    {
        "comment": "Thatcher Demko; do we need him?",
        "label": "NEU"
    },
    {
        "comment": "Shoot Myers into the sun Bench KuzyTeach Ian Cole defence I don't even know what the fuck to do with Petey",
        "label": "NEG"
    },
    {
        "comment": "Sens looked great for first 10 minutes. Sens regressed back to the gutter for the 30 minutes that followed.",
        "label": "NEG"
    },
    {
        "comment": "This is NOT the start I was hoping for 😔",
        "label": "NEG"
    },
    {
        "comment": "I don't see a huge boost in effort. I see a huge boost in better decisions with the puck.",
        "label": "NEU"
    },
    {
        "comment": "To me, that just makes it worse.  The team comes out embarrassingly flat, and a goalie keeps them in a game they have no business being in.  I don't want to watch Binner play out of his mind when the rest of the team can't be bothered.  The team needs to figure out why they can't show up on time like everyone else.",
        "label": "NEG"
    },
    {
        "comment": "Garland is the hardest working player on the team, guy shows up to every shift. Need that work ethic in our top 6, could have been a different game. Lets pump the Flames",
        "label": "POS"
    },
    {
        "comment": "jesus christ, I just realized : this idiot came from toronto????  maple leafs have not seen cup in almost 60 YEARS !!!  What can he possibly teach CAPS ? How to hit a worst dry spell in history of modern hockey?",
        "label": "NEG"
    },
    {
        "comment": "Not even noon, 11am on saturday!",
        "label": "NEU"
    },
    {
        "comment": "See when it happened I swear it hit his left shoulder but Vosters made it seem like it was the Blues defender",
        "label": "NEU"
    },
    {
        "comment": "#THOMMER",
        "label": "POS"
    },
    {
        "comment": "I knew it was Pettersson's all along but I really wished Zadorov got the GWG in his first game against his old team",
        "label": "POS"
    },
    {
        "comment": "We're about to get shutout by the bottom team in our division…",
        "label": "NEG"
    },
    {
        "comment": "I wish they'd stop hyping Cole up as some type of fighter. His game is improving, which is great, but he is not some huge, tough guy. He gets embarrassed in basically every fight. He needs to stop fighting and focus on scoring.",
        "label": "NEG"
    },
    {
        "comment": "Nemo taking shots here, I love to see that confidence!",
        "label": "POS"
    },
    {
        "comment": "Refs are certainly disappointed so far with the 0-3 pp for Tampa bay.",
        "label": "NEG"
    },
    {
        "comment": "Holy fuck now this is a game! Loving the pace and pressure here",
        "label": "POS"
    },
    {
        "comment": "Losing puck battles all over on that sequence",
        "label": "NEG"
    },
    {
        "comment": "Yall can't spread all this negativity for 6 months straight year after year and come back when he plays great, bc he will.",
        "label": "NEG"
    },
    {
        "comment": "That's like $100?",
        "label": "NEU"
    },
    {
        "comment": "Right? Love a good ol biased cats broadcast",
        "label": "POS"
    },
    {
        "comment": "I was thinking 15 minutes ago that it would be hard to win 1-0 against Floridait's a lot easier with 3 goals",
        "label": "NEU"
    },
    {
        "comment": "It was a bad shot by Laf but I'm real glad he took it. That itself is growth",
        "label": "POS"
    },
    {
        "comment": "This should have been such a great bounce back opportunity for us. I'm going to be fuming all the way through Saturday.",
        "label": "NEG"
    },
    {
        "comment": "Rielly has been absolutely stellar",
        "label": "POS"
    },
    {
        "comment": "Or just score goals!",
        "label": "NEU"
    },
    {
        "comment": "Barb approves",
        "label": "POS"
    },
    {
        "comment": "Oh damn he got it with his foot???",
        "label": "NEU"
    },
    {
        "comment": "God Nico is so good at just being at the right place at the right time all the time.",
        "label": "POS"
    },
    {
        "comment": "It's a win win, we either beat one of the best teams or Vegas barely beats a bottom feeder team lol",
        "label": "POS"
    },
    {
        "comment": "PP looking hot!",
        "label": "POS"
    },
    {
        "comment": "If the leafs had a real goalie they win that game.",
        "label": "NEU"
    },
    {
        "comment": "If Levi was in net it would be 12-0 already",
        "label": "NEU"
    },
    {
        "comment": "Gallant should be arrested and kept in the basement of the HHOF",
        "label": "NEG"
    },
    {
        "comment": "Just when you think we won't ever win again we go and beat down the best team in the conference!",
        "label": "POS"
    },
    {
        "comment": "Omg Kap missed a wide open net 😩",
        "label": "NEG"
    },
    {
        "comment": "Rather be lucky than good",
        "label": "POS"
    },
    {
        "comment": "Don't feel like making a whole thread on it, but Tyson Barrie was granted permission to talk to other teams in regards to a trade. Could he be an upgrade in a D for D swap?",
        "label": "NEU"
    },
    {
        "comment": "Bruh, Joey……..just stop trying to handle the puck so much",
        "label": "NEG"
    },
    {
        "comment": "Allvin said they wanted to move 1, most likely 2 contracts this season. With Beauvillier gone, you gotta assume it's Myers.",
        "label": "NEU"
    },
    {
        "comment": "Not at all but I see where you were going with it. Torres' forecheck was relentless but the biggest part of his game was his physicality. Hoggy uses his speed and skill somewhat like Hansen (like others have said). Would love another Raffi on our team but these guys don't exist anymore :(",
        "label": "NEU"
    },
    {
        "comment": "Oh what the tits",
        "label": "NEG"
    },
    {
        "comment": "Sens getting WORKED in the D zone omg",
        "label": "NEG"
    },
    {
        "comment": "Just a heads up if you don't already know this game will be on MAX streaming service and app to watch.",
        "label": "NEU"
    },
    {
        "comment": "Durzi out for the game 😢 hope it isnt serious",
        "label": "NEG"
    },
    {
        "comment": "It's always so funny to me when they lose their stick and just aren't quite sure what to do with their hands. Just 25 seconds of jazz hands, why the fuck not",
        "label": "NEG"
    },
    {
        "comment": "VLAD THE IMPALER",
        "label": "POS"
    },
    {
        "comment": "I honestly think weve looked pretty good. We've made two mistakes and theyve capitalized",
        "label": "POS"
    },
    {
        "comment": "Lol this team is always on the recieving of the most immaculate saves",
        "label": "POS"
    },
    {
        "comment": "slickolas nicholas",
        "label": "POS"
    },
    {
        "comment": "refs should just eject McDavid like Jokic",
        "label": "NEG"
    },
    {
        "comment": "that was soft as shit",
        "label": "NEG"
    },
    {
        "comment": "Oh for sure, but Mac was always pretty good when he was healthy. Emphasis on the health though. Kept breaking down after his first few seasons with NJ.",
        "label": "POS"
    },
    {
        "comment": "#IM READY TO RIP ALREADY BOIS, I GOT 2 SIX PACKS OF TALL BOYS ON ICE WAITING FOR ME TO GET OFF WORK AND IM OFF TOMORROW. LFG BOIS FUCK THEM RAGS",
        "label": "POS"
    },
    {
        "comment": "It's really embarrassing. This is one sub where I feel like most meatballs are not around, and there's always “something” downvoting everything. This sub is MUCH better than the bears or Cubs sub",
        "label": "NEG"
    },
    {
        "comment": "Woll for ROTY",
        "label": "POS"
    },
    {
        "comment": "Fugly ass hockey",
        "label": "NEG"
    },
    {
        "comment": "The right call Gallagher special.",
        "label": "POS"
    },
    {
        "comment": "Batherson was completely uncovered.",
        "label": "NEU"
    },
    {
        "comment": "Hate to agree with this…but I agree",
        "label": "POS"
    },
    {
        "comment": "Doesn't that include you DA? Jesus, the lack of accountability.",
        "label": "NEG"
    },
    {
        "comment": "Gotta come out swingin in the 3rd boys.",
        "label": "POS"
    },
    {
        "comment": "Vegas is in another tier.",
        "label": "POS"
    },
    {
        "comment": "The peepis is not large today",
        "label": "NEG"
    },
    {
        "comment": "We got some Dawgs on this team. Especially on defence, you love to see it.",
        "label": "POS"
    },
    {
        "comment": "Risking Boston dismantling Igor tmr could be a huge gamble on his confidence",
        "label": "NEG"
    },
    {
        "comment": "Siegenthaler playing much better this period.",
        "label": "POS"
    },
    {
        "comment": "Try “Onhockey.tv”. Every hockey game, literally the world. Including minors, college, Europe, etc. Even has Home/Away feeds and other languages.",
        "label": "NEU"
    },
    {
        "comment": "They already don't look good... Wonderful",
        "label": "NEG"
    },
    {
        "comment": "Perunovich is really good defensively. Go look at the numbers.",
        "label": "POS"
    },
    {
        "comment": "I had to look it up, games this season where we held the opponent to less than 3:2-1 L @ Blues4-2 W vs Preds7-1 W vs Sharks2-0 L @ Sens2-1 L vs Devils&#x200B;5 games out of 28",
        "label": "NEU"
    },
    {
        "comment": "Gustav😍",
        "label": "POS"
    },
    {
        "comment": "Major save!",
        "label": "POS"
    },
    {
        "comment": "I'm like 99% sure Tim is hurt and the team isn't disclosing it as per usual. Looks like a ghost of last year.",
        "label": "NEG"
    },
    {
        "comment": "Broh, the audio quality is actively degrading itself lol",
        "label": "NEG"
    },
    {
        "comment": "Who needs forwards!!!",
        "label": "POS"
    },
    {
        "comment": "The blues are just mid and we have to accept it.",
        "label": "NEG"
    },
    {
        "comment": "I'm excited for the meltdown of Wings fan when Perron gets a well-deserved 5+ game suspension.",
        "label": "POS"
    },
    {
        "comment": "Genuinely how do you call only Steel for that",
        "label": "NEG"
    },
    {
        "comment": "It fits her personality perfectly.",
        "label": "POS"
    },
    {
        "comment": "Lol I caught that too. I wonder if Foxy realized what he said",
        "label": "NEU"
    },
    {
        "comment": "Not the ending we wanted, but certainly better than the ending we expected.",
        "label": "POS"
    },
    {
        "comment": "Use the last 3 seconds to punch whoever is across from you on the faceoff",
        "label": "NEU"
    },
    {
        "comment": "He kinda had a good reason, that was a pretty dangerous trip by Carolina's goalie.",
        "label": "NEG"
    },
    {
        "comment": "When is our captain stealing a game for us? Fuck me",
        "label": "NEG"
    },
    {
        "comment": "If KJ's voice gets any deeper he will need AEP's permission to speak in post game interviews.",
        "label": "NEU"
    },
    {
        "comment": "That's what *she* said! :>",
        "label": "NEU"
    },
    {
        "comment": "I'm sure no one wants to hear it, but I want to give the coaches some credit. Something they practiced this morning was executed really well a couple times during the game.This low to high, forward to an aggressively pinching defenseman for the one timer play came up twice. Once for a goal, once for a dangerous Vince Dunn one timer on the power play. Eberle and Gourde both eyed the slot from down low, then as their second read they hit the D up high for the shot.And good eye by Allyson to call it out in her Cor-Sea newsletter this morning and spot it in game.",
        "label": "POS"
    },
    {
        "comment": "good PK right there",
        "label": "POS"
    },
    {
        "comment": "Not that I'm aware of",
        "label": "NEU"
    },
    {
        "comment": "Tavares looking dominant lately, everything on net and can't be moved from the crease",
        "label": "POS"
    },
    {
        "comment": "I mean they crushed it in the 2nd & 3rd, but when you can't get a full 3 periods it's gonna be hard to win",
        "label": "NEG"
    },
    {
        "comment": "Of course he's from MTL",
        "label": "NEU"
    },
    {
        "comment": "Agreed. It's like our cap is full but we have half a team and couldn't make any moves. Really shit way to start a season. And that's pretty much all on Doug.",
        "label": "NEG"
    },
    {
        "comment": "Demko injury from last game not dealt with. The team will play him until he has season ending surgery.",
        "label": "NEU"
    },
    {
        "comment": "this monday night panel is fuggin terrible loll",
        "label": "NEG"
    },
    {
        "comment": "20 wins in first 30 games. yah baby",
        "label": "POS"
    },
    {
        "comment": "HE KNEW THEY WOULD BOO guaranteed",
        "label": "NEG"
    },
    {
        "comment": "Kevin Bahl is fuckin stud",
        "label": "POS"
    },
    {
        "comment": "remove gary from the building",
        "label": "NEG"
    },
    {
        "comment": "Full blown \"having one of those nights\" the Matthews bar hit there rofl.....that's his 99/100.",
        "label": "NEU"
    },
    {
        "comment": "Yaaaaaaa",
        "label": "POS"
    },
    {
        "comment": "BEDARD POINT",
        "label": "POS"
    },
    {
        "comment": "Pretty sure tocchet knows more about how to coach and who to put out there far better than anyone here",
        "label": "POS"
    },
    {
        "comment": "Martin is on 🔥",
        "label": "POS"
    },
    {
        "comment": "Yeah fuck you Lavi",
        "label": "NEG"
    },
    {
        "comment": "Bigger fanbases = more people who clip stuff = more likely to see a postBe the change you want to see. Capture the plays and post them, you'll get upvotes when it's a nice play.",
        "label": "POS"
    },
    {
        "comment": "good afternoon, i'll be at the game!!",
        "label": "POS"
    },
    {
        "comment": "Why does every goalie we play most of the time plays Vezina caliber? LoLAnyways, just don't understand why we couldn't play like this start of the season. Cuz our record would be much better",
        "label": "NEG"
    },
    {
        "comment": "wooooooo",
        "label": "POS"
    },
    {
        "comment": "God, he'd probably just yell at you the whole time.",
        "label": "NEG"
    },
    {
        "comment": "Yeesh duclair scores one nice goal on us and now everyones dick riding for him to come back lmao.",
        "label": "NEG"
    },
    {
        "comment": "It was 4-3",
        "label": "NEU"
    },
    {
        "comment": "A worthy successor to Roly Poly Colby at the desk",
        "label": "POS"
    },
    {
        "comment": "Luukkonen? I had no hope of spelling that right just hearing it lol 🙏",
        "label": "NEG"
    },
    {
        "comment": "Omg, gotta bury a chance like that.",
        "label": "NEG"
    },
    {
        "comment": "Worst thing I keep hearing. \"Jones shoots.\"",
        "label": "NEG"
    },
    {
        "comment": "Good catch.",
        "label": "POS"
    },
    {
        "comment": "That line just scored because of your comment so thank you.",
        "label": "POS"
    },
    {
        "comment": "Shoulda thrown his helmet",
        "label": "NEG"
    },
    {
        "comment": "FUCK YEAH MARCH",
        "label": "POS"
    },
    {
        "comment": "checking in from behind enemy lines. was wearing my Sabres hat on the strip yesterday and a guy in a bumblebee costume roasted me for it I hate this place",
        "label": "NEG"
    },
    {
        "comment": "FUCK YES",
        "label": "POS"
    },
    {
        "comment": "Kevin Bahl with a great fuckin play",
        "label": "POS"
    },
    {
        "comment": "Eklund is damn good.  Can't wait to pair him with Smith and some of our other top prospects",
        "label": "POS"
    },
    {
        "comment": "Good god. Can we get a timeout here. This team is asleep on the ice",
        "label": "NEG"
    },
    {
        "comment": "##WE ARE SO FUCKING BACK",
        "label": "POS"
    },
    {
        "comment": "I cannot wait for Rossi to get a few more games under his belt with Kap and Zucc.. the chemistry is already noticeable and it's been like 3 games",
        "label": "POS"
    },
    {
        "comment": "Bjorkstrand making up for the luck he didn't have last season",
        "label": "POS"
    },
    {
        "comment": "It's Wolf's net tonight confirmed by Pat!",
        "label": "NEU"
    },
    {
        "comment": "49 shots, 20 of which are blind passes accidently on net",
        "label": "NEU"
    },
    {
        "comment": "IT'S HARLEY TIME, BABY!!! 🤠",
        "label": "POS"
    },
    {
        "comment": "Suzuki has to shoot it there",
        "label": "NEU"
    },
    {
        "comment": "Deflected puck lol",
        "label": "NEU"
    },
    {
        "comment": "Hi! I like hockey!",
        "label": "POS"
    },
    {
        "comment": "Didn't lose in regulation and got 1000. It was an alright night, I guess",
        "label": "POS"
    },
    {
        "comment": "Barron and Allen that was fucking great",
        "label": "POS"
    },
    {
        "comment": "Does CBJ still do the student discount? I made the drive from Athens to C-Bus to almost every Sabres game in 4 years there. $25 bucks to sit lower bowl from like 2013-2017 I think.",
        "label": "NEU"
    },
    {
        "comment": "Sounds like theyre saying shimone nemec",
        "label": "NEU"
    },
    {
        "comment": "Yeah. It's not just the top of the lineup out there winning games. We aren't walking away with Ws without our role guys, and Lafferty has been the best of the bunch.I think Lafferty is a big reason why Peteys line has looked a lot better lately. And before that he was hard carrying Beau all over the ice and still creating a ton of looks.Speed. Grit. Heart. Has skill to back it all up. This guy is gonna play himself up the lineup and price himself out of Vancouver at this rate",
        "label": "POS"
    },
    {
        "comment": "Holy fuck you killed him dude",
        "label": "NEG"
    },
    {
        "comment": "Duke has been our best player tonight by far imo, forechecking hard and set up Hertl for the goal. Everything else is as expected.",
        "label": "POS"
    },
    {
        "comment": "Funnelling everything through Norris is too predictable.",
        "label": "NEG"
    },
    {
        "comment": "Nick breaks his cold streak on a powerplay?  I feel faint. Too much awesomeness too soon.",
        "label": "POS"
    },
    {
        "comment": "Steel did not let up! Forechecked the heck of that play to set up Miro's empty netter!!",
        "label": "POS"
    },
    {
        "comment": "No wrong way! Drink it how you like it :)(I'm the same)",
        "label": "POS"
    },
    {
        "comment": "Ok Hughes trying to do too much now, no trust in anyone",
        "label": "NEG"
    },
    {
        "comment": "I'm at the game and no one cheered then they saw the replay. First time I've seen that.",
        "label": "NEG"
    },
    {
        "comment": "announcement: for the first time this season i will not be watching. getting sick of these fucking guys playing like shit for 30 minutes, trying really hard for 15 mins, and then sucking for the rest of the game",
        "label": "NEG"
    },
    {
        "comment": "We are not watching the same games.This team has looked pathetic for the last month.",
        "label": "NEG"
    },
    {
        "comment": "We are awful at clearing our zone",
        "label": "NEG"
    },
    {
        "comment": "Brutal decision to force Akira out for back to back.  That performance was brutal.  To me its on par with the “we won going 11/7, so lets try again” but everyone is tired and they lose.  Somethings really seem obvious.I think we do need an upgrade in net.  I haven't jumped on this because I was more convinced it was structure issues. But fuck man. Cover thePuck",
        "label": "NEG"
    },
    {
        "comment": "Fantilli is on fire offensively the last few games",
        "label": "POS"
    },
    {
        "comment": "Of course Robinson just happens to be on the ice when they pull the goalie.",
        "label": "NEU"
    },
    {
        "comment": "Holy shit Slaf had him ragdolled there",
        "label": "POS"
    },
    {
        "comment": "We're looking good early IMO. Team chemistry is  really a lot better than earlier in the season.",
        "label": "POS"
    },
    {
        "comment": "Everyone's starting to look a little frustrated out there.  I won't rehash what's been popping up a lot, but we gotta find that fun times sweet spot where things click again. Mika please stop taking penalties",
        "label": "NEG"
    },
    {
        "comment": "Good time to finally score, I'm fired the fuck up",
        "label": "POS"
    },
    {
        "comment": "Seriously",
        "label": "NEG"
    },
    {
        "comment": "Panthers will bounce back but this game is not great.",
        "label": "NEG"
    },
    {
        "comment": "Celebrini",
        "label": "NEU"
    },
    {
        "comment": "YOU GUYS.",
        "label": "NEU"
    },
    {
        "comment": "I am really getting sick of the Brady penalties",
        "label": "NEG"
    },
    {
        "comment": "We haven't won against tampa in our own building since 2016. 7 years.",
        "label": "NEG"
    },
    {
        "comment": "9.5 million max if he's gonna disappear every second season.  I know that Jack Hughes is a steal at 8 million per year, but he completely embarrassed Petey tonight.",
        "label": "NEG"
    },
    {
        "comment": "Really? That's your takeaway?!?",
        "label": "NEG"
    },
    {
        "comment": "I was there but sailed across to Aus now",
        "label": "NEU"
    },
    {
        "comment": "I can't believe this is my team, this feels like a dream, LFG",
        "label": "POS"
    },
    {
        "comment": "Watching but can't listen, Why is it 4v4 instead of a pp for us? that was clear as day interference.",
        "label": "NEG"
    },
    {
        "comment": "I would put Igor against the Ducks. Otherwise it is Boston with Igor and idk man...",
        "label": "NEU"
    },
    {
        "comment": "20 posts for Matthew so far this season.",
        "label": "NEU"
    },
    {
        "comment": "Yeah this is looking like an in between year.",
        "label": "NEG"
    },
    {
        "comment": "I like how fast Colorado plays. The rookie line is like the only part of the flames organization that even sniffs that speed",
        "label": "POS"
    },
    {
        "comment": "Inb4 we still get fuked by the draft lottery",
        "label": "NEG"
    },
    {
        "comment": "How long does Skinner get to hold onto the puck without a whistle?",
        "label": "NEU"
    },
    {
        "comment": "Hmm. Like u/Paladad I enjoy Bankier bc he's kind of an all-around prospect. He's kind of good at everything without a glaring weakness in his game other than maybe a question of how good his skating is, how much of \"that dawg\" he's got in him and just generally whether he'll be able to play with enough pace to succeed in the AHL and NHL. Kind of a boom/bust prospects in that sense. In some ways similar to Bankier  (and also transitioning to the Iowa WIld from the Kamloops Blazers) but on defense corps is Kyle Masters. My personal view on NHL defensemen right now is that the most important characteristics are intelligence, size, and skating - in that order. I see Masters as pretty good but not necessarily superlative in all three categories. I generally see him making high awareness plays and not making dumb shit plays (always easier to see from our view than ice level granted) so I think of him as relatively smart. As for size, depending on who's counting, he's 6'0\" and about 180-190#'s. That's not huge but its probably around median NHL defenseman size. Skating is probably his best attribute. He might not be \\*super\\* agile and nimble but he gets around pretty good. Its nowhere near Brodin or Faber tier or even Lambos tier but he's a pretty damn good skater. So overall you have a guy that's pretty good at everything but not superlative at anything.. kinda like Bankier. I mean Bankier is not a great skater but that's less important to me in a forward - you just need at least one or two forwards per line who can push the defense back and create space whereas you really want a defenseman to be a good skater on puck retrievals and if you want him to join the offense in a significant way.",
        "label": "POS"
    },
    {
        "comment": "That's it, Evan Rodrigues is a fucking bum. I gave him 25 games. He is dog shit.",
        "label": "NEG"
    },
    {
        "comment": "No it's not..  the sabres and the oilers have all the highest draft picks in the world in the last several years and have NOTHING to show for it..  Let's say we tank like you want..  you really want to watch a team struggle for years for MAYBE a chance at a cup years from now??  That's fucking dumb",
        "label": "NEG"
    },
    {
        "comment": "SEGGSY",
        "label": "POS"
    },
    {
        "comment": "This is just.....😂😂😂😂 I can't take this team seriously anymore.",
        "label": "NEG"
    },
    {
        "comment": "How bout that Kyrou boo-ersedit: they still booed him for the goal announcement",
        "label": "NEG"
    },
    {
        "comment": "We played 2 games in December and one of them was the one against the Devils last game. Not concerned about Demko. But I do like to see DeSmith start this one because Demko has not won a game against the Wild in his career.",
        "label": "NEU"
    },
    {
        "comment": "And on your cake day as well? The shame. Happy Cake Day!",
        "label": "POS"
    },
    {
        "comment": "The people blaming Marner are morons btw. Like what?",
        "label": "NEG"
    },
    {
        "comment": "Shit, they look awake and motivated tonight. What a great change of pace! ***Go Squid!!***",
        "label": "POS"
    },
    {
        "comment": "What the fuck",
        "label": "NEG"
    },
    {
        "comment": "Zach Wilson is at nearly 300 yards with 2TDs. Unbelievable.",
        "label": "POS"
    },
    {
        "comment": "Been doing things and am only kind of half paying attention. Didn't notice we nearly even up the shots. We must've been buzzing more than I realized in the last 5-10 mins of the 2nd.",
        "label": "NEU"
    },
    {
        "comment": "“*What shampoo do you use?*”",
        "label": "NEU"
    },
    {
        "comment": "He's innocent!",
        "label": "POS"
    },
    {
        "comment": "Well it's a rare site to see, we are on the other side of a terrible officiating there.",
        "label": "NEG"
    },
    {
        "comment": "I can't put my finger on it that what has changed since the LA game. But I don't believe we would have beat them playing like this. Skating circles around the goal and passes not connecting.",
        "label": "NEG"
    },
    {
        "comment": "I am just waiting for Connor to have a break out game and goes into beast mode.",
        "label": "POS"
    },
    {
        "comment": "Gudas dirty? What? That can't be! /s",
        "label": "NEG"
    },
    {
        "comment": "Pissed that one away",
        "label": "NEG"
    },
    {
        "comment": "You are correct, they didn't do anything. But to say at no point tonight did it look like they had a goal in them is silly. There were more than a couple really good scoring opportunities.",
        "label": "POS"
    },
    {
        "comment": "How can that be overturned? Oh wait it's the flames...",
        "label": "NEG"
    },
    {
        "comment": "Honestly I see it as a slight positive. All of our regulation losses have just been us not showing up to play and just skating around for 60 mins doing nothing. And our 1 OT loss was because we got a lead and then stopped giving any effort. This team has shown that where they're invested in a game and playing to their system that they can beat anyone in any style of game. Team knew they had a 3 day break and had \"meaningful\" games coming up this weekend against \"good\" opponents and just got lost looking ahead.",
        "label": "POS"
    },
    {
        "comment": "Finally a good offensive push",
        "label": "POS"
    },
    {
        "comment": "My opinion is that Smith's role is easily replaceable, there are lots of depth defensemen in this league that are simply better and still do all of the physical things he does, and can play the PK. Like I said he would be fine as a 7th guy but on a Stanley Cup contending team I think we should be looking to upgrade at that position",
        "label": "NEG"
    },
    {
        "comment": "Josh ANNNNDEEEERSOOOOOOON !!!!",
        "label": "POS"
    },
    {
        "comment": "I forget what the exact rule is but I think Toronto automatically reviews all goals in the last five minutes of a game or something like that. No coach's challenge involved",
        "label": "NEU"
    },
    {
        "comment": "Your team sucks lmao",
        "label": "NEG"
    },
    {
        "comment": "I have Sportsnet+ Premium and watch a lot of games.  I swear, no other team gets this kind of scrutiny on their goals.",
        "label": "NEU"
    },
    {
        "comment": "#Wedgie in the hizzy!",
        "label": "POS"
    },
    {
        "comment": "It needs to start with firing Granato.  If they can't accept that then they're weak.  Play fucking better",
        "label": "NEG"
    },
    {
        "comment": "Fuck so there's a 99% chance we lose now",
        "label": "NEG"
    },
    {
        "comment": "Can I come",
        "label": "NEU"
    },
    {
        "comment": "I like this",
        "label": "POS"
    },
    {
        "comment": "probably should cut their minutes so they can learn.",
        "label": "NEG"
    },
    {
        "comment": "It's the end of a long road trip, it's just a tough stretch. We'll be fine.",
        "label": "NEG"
    },
    {
        "comment": "Shoot. The. Puck.",
        "label": "NEU"
    },
    {
        "comment": "Korchinski getting gutsy! I love it! I think it's a Bedard effect where everyone gets more gutsy and just tries to score. No, not Guttman. But gutsy. Absolutely love how everyone is going bold and brash!",
        "label": "POS"
    },
    {
        "comment": "thanks",
        "label": "POS"
    },
    {
        "comment": "Shango, baby!!",
        "label": "POS"
    },
    {
        "comment": "Makes too much sense for shanasham to okay it",
        "label": "NEU"
    },
    {
        "comment": "brilliant, made me laugh out loud",
        "label": "POS"
    },
    {
        "comment": "That shift with Hughes and Nemec pinning the Sharks back in their own zone. People say this too much but that actually looked like a power play.",
        "label": "POS"
    },
    {
        "comment": "If history is any indicator, the Leafs will lose tonight.",
        "label": "NEG"
    },
    {
        "comment": "Great team effort against a soft and weak Rangers team. Love it!",
        "label": "POS"
    },
    {
        "comment": "This team ain't it tonight. Not a big deal, but they need to go back to how they were playing earlier in the year. This lax defense they've been playing the past few games, allowing a ton of goals isn't sustainable.",
        "label": "NEG"
    },
    {
        "comment": "In fact you can't even be paid league minimum and be this bad.",
        "label": "NEG"
    },
    {
        "comment": "In tonight's game Auston Matthews (318) passed both Draisaitl and Pasternak (both 317 with 2 extra seasons played) in career goals. He also passed McDavid (313, 1 extra season played) earlier this season. I don't expect him to look back.",
        "label": "NEU"
    },
    {
        "comment": "The rest of the defense owes Saros at least a year's worth of their salaries for doing both his job and theirs and making it look easy",
        "label": "POS"
    },
    {
        "comment": "That's always been the issue. Paying him top dman money for the next 7 years is such a liability. If it was $6.5 million or something it'd be worth it.",
        "label": "NEG"
    },
    {
        "comment": "Soderblom just isn't a guy who's going to win a shootout",
        "label": "NEG"
    },
    {
        "comment": "Not gonna happen with Kemps in net, gonna spot Vegas a few softies.",
        "label": "NEG"
    },
    {
        "comment": "Light the Fucking Lamp Boys 🔥",
        "label": "POS"
    },
    {
        "comment": "Why are we so indecisive with the puck behind the goals in defense? We're usually really sharp there.",
        "label": "NEG"
    },
    {
        "comment": "Damn Kane is a beast",
        "label": "POS"
    },
    {
        "comment": "Leafs seem to do a lot of flailing...",
        "label": "NEG"
    },
    {
        "comment": "Ooooh sick entry by Petey to draw the penalty",
        "label": "POS"
    },
    {
        "comment": "What is it about defencemen named after Ontario cities that makes them unable to defend?Barrie... Timmins...",
        "label": "NEG"
    },
    {
        "comment": "Team started playing better once I started watching, I missed the first and most of the second. My bad, I'll watch the full game next game. In all reality, they were just a better hockey team tonight. Tough, move onto the next one.",
        "label": "POS"
    },
    {
        "comment": "A confident Boldy is a legit 1RW",
        "label": "POS"
    },
    {
        "comment": "FFS",
        "label": "NEG"
    },
    {
        "comment": "they do say it at the very end of the video....special moment",
        "label": "POS"
    },
    {
        "comment": "no, it's giordano's dad",
        "label": "NEU"
    },
    {
        "comment": "I honestly forget Kubalik is on the team, guy is invisible 95% of the time.",
        "label": "NEG"
    },
    {
        "comment": "Same",
        "label": "NEU"
    },
    {
        "comment": "Put that 3rd period D in a bottle and use it every night.  Great D, without just sitting back and letting them play on the Devil zone.  Shows that they can play solid D.",
        "label": "POS"
    },
    {
        "comment": "No luck with my lady troubles everyone…I got dumped this week but at least I'm going to the games next Friday and Sunday. Let's go Knights! Did some therapeutic gear tending and put new laces on my skates and taped my stick for the first time.",
        "label": "POS"
    },
    {
        "comment": "Interesting to always check the other teams post game thread after games like this. Woof. CBJ fans are calling for a coach firing.",
        "label": "NEG"
    },
    {
        "comment": "His storytelling and his insight are so refreshing. He gives you a real good glimpse behind the scenes.",
        "label": "POS"
    },
    {
        "comment": "#COYOTES SUCK",
        "label": "NEG"
    },
    {
        "comment": "Ass",
        "label": "NEG"
    },
    {
        "comment": "What a looney tuney fucking game",
        "label": "NEG"
    },
    {
        "comment": "How many games has Myers lost us this season lol",
        "label": "NEG"
    },
    {
        "comment": "I'm about to freak out if they put the Knicks and fucking Islanders game on over the Rangers",
        "label": "NEG"
    },
    {
        "comment": "When did CV just decide to start being a really solid hockey commentator lmao",
        "label": "POS"
    },
    {
        "comment": "My heart skipped a beat there 👀",
        "label": "NEG"
    },
    {
        "comment": "This ref bullshit is becoming comical",
        "label": "NEG"
    },
    {
        "comment": "Doesn't to me.",
        "label": "NEU"
    },
    {
        "comment": "Maybe Rayzor stops to talk to Matty Ellis between courses",
        "label": "NEU"
    },
    {
        "comment": "Well.... at least Woll is good",
        "label": "POS"
    },
    {
        "comment": "That PK stat won't raise itself.",
        "label": "NEG"
    },
    {
        "comment": "PREACH. We absolutely don't need to be on offense 100% of the time. PLAY DEFENSE AND GOOD THINGS WILL HAPPEN",
        "label": "POS"
    },
    {
        "comment": "5 goals on 16 shots.This is the first time I've been able to go to a game all season and I have to watch this fucking war crime.",
        "label": "NEG"
    },
    {
        "comment": "Just saying:\\-Last year, all 4 lines were scoring lines.\\-We then got rid of the Line 4 and reduced the scoring power significantly due to cap reasons.\\-Now we consistently struggle to score 4 goals, which would have been enough to win most games so far. That is not to blame Line 4, they are doing what they are supposed to - but they are just not bailing out our expensive underperformers like last year's line did. I am looking forward to some contracts ending and that we hopefully either replenish the team with new Sprongs or invest in top line scorer who still has good goals/$ ratio.",
        "label": "NEG"
    },
    {
        "comment": "I love how disappointed the Hughes parents always look.",
        "label": "NEG"
    },
    {
        "comment": "I still like watching the boys even if they lose. Is it desirable? No. But I love hockey and I love this team. Otherwise, why watch?",
        "label": "POS"
    },
    {
        "comment": "Lol they won't even replay the penalty on ESPN. It must have been a terrible call.",
        "label": "NEG"
    },
    {
        "comment": "Bertuzzi and JT are a match made in heaven, they just need to start converting a bit more",
        "label": "POS"
    },
    {
        "comment": "foook",
        "label": "NEG"
    },
    {
        "comment": "I LOVE DYLAN STROME",
        "label": "POS"
    },
    {
        "comment": "Myers would've been diving for that 10/10 times",
        "label": "NEG"
    },
    {
        "comment": "THEYRE PLAYING HOLIDAY!!!",
        "label": "POS"
    },
    {
        "comment": "Thank god we didn't go 0/5 against one of the worst PKs in the league",
        "label": "NEG"
    },
    {
        "comment": "Fuck off. That was a dangerous play. Should never be offsetting minors.One day soon somebody is going to get paralyzed from something like that. And the NHL will have allowed it to happen because the punishment is fucking nothing.",
        "label": "NEG"
    },
    {
        "comment": "They pretty much took all the most obnoxious aspects of other teams.",
        "label": "NEG"
    },
    {
        "comment": "MORE KURI POWDER PLEASE!!!",
        "label": "POS"
    },
    {
        "comment": "The pants off kind, or…",
        "label": "NEU"
    },
    {
        "comment": "Pain",
        "label": "NEG"
    },
    {
        "comment": "Woll is putting on a show. Ive seen timmins on ice for how many breakaways now....",
        "label": "POS"
    },
    {
        "comment": "Absolute piss missile",
        "label": "POS"
    },
    {
        "comment": "Wes knows it all. Did **you** know that about Wes?",
        "label": "POS"
    },
    {
        "comment": "That's what we call a “welcome to the NHL” hit",
        "label": "NEU"
    },
    {
        "comment": "Don't forget, \"the bounces just didn't go our way tonight.\".",
        "label": "NEG"
    },
    {
        "comment": "Ahh missed that. Thanks.",
        "label": "POS"
    },
    {
        "comment": "miro dont even gaf",
        "label": "POS"
    },
    {
        "comment": "We are incapable of real Win streaks",
        "label": "NEG"
    },
    {
        "comment": "What the fuck happens to this team in 2nd intermission? EVERY. SINGLE. GAME.",
        "label": "NEG"
    },
    {
        "comment": "How does the zucarello goal count?",
        "label": "NEU"
    },
    {
        "comment": "What a play by Andersson there. So underrated as a player",
        "label": "POS"
    },
    {
        "comment": "OOOOOOH SHE EMPTY",
        "label": "NEU"
    },
    {
        "comment": "Love Has Won: The Cult of Mother God is crazy.",
        "label": "NEG"
    },
    {
        "comment": "prolly have to be cheap living there...jealous! enjoy the cruise!...and if its another trap game no worries this one is obviously just to build Patera up!",
        "label": "POS"
    },
    {
        "comment": "Left the middle wide open... Oh well.",
        "label": "NEG"
    },
    {
        "comment": "LETS GO BABY",
        "label": "POS"
    },
    {
        "comment": "WE ARE THE COMEBACK KING!!!!",
        "label": "POS"
    },
    {
        "comment": "Nice play Huberdeau",
        "label": "POS"
    },
    {
        "comment": "I'll take any points the team can get but playoff overtime isn't regular season overtime. No 3v3, no shootout, just more 5-on-5, and they're struggling at 5-on-5 right now. That's absolutely a fair concern",
        "label": "NEG"
    },
    {
        "comment": "Well Bedard, tonight would be the perfect night to score a coast to coast goal.",
        "label": "POS"
    },
    {
        "comment": "Call an ambulance.BUT NOT FOR ME!",
        "label": "POS"
    },
    {
        "comment": "It's what happens when they play the defensive style hockey that they were successful with at the start of the season. It felt like they tried to get away from it to try and increase offense instead of playing the long game. As living proof from last night when you play that gritty defensive game it will open the door for offense eventually.",
        "label": "POS"
    },
    {
        "comment": "What is Savard's role anyways? Eat pocket dogs and watch the pk constantly clearing the puck against the pp during practice",
        "label": "NEG"
    },
    {
        "comment": "1st not so great, but looked solid for 2nd,3rd. Good win, and VV needed this. Go Devils!",
        "label": "POS"
    },
    {
        "comment": "He has seemed to be exactly what we were looking for in a veteran signing. I love him more every time I see him.",
        "label": "POS"
    },
    {
        "comment": "Caps top line skated like they dared you to come take the puck off of them. Ours skated like they hope you keep 5 feet away from them. I'll take an early season struggle though. They just have to dig in to get their way out of it. On to the next game. LGR.",
        "label": "NEG"
    },
    {
        "comment": "Good. I also hope we don't get Debrusk as he's also terrible",
        "label": "NEG"
    },
    {
        "comment": "Somehow the most cocky fanbase with the biggest victim complex.",
        "label": "NEG"
    },
    {
        "comment": "How have we only witnessed 2 overtimes this season?",
        "label": "NEU"
    },
    {
        "comment": "I don't think we challenged. Refs reviewed on their own.",
        "label": "NEU"
    },
    {
        "comment": "Tbf I'd say Zadorov's goal (or Petey's goal, apparently) was also a bit of puck luck.  Though I agree with your statement, especially on the 5 on 3 we were so close but couldn't get the puck in the net",
        "label": "NEU"
    },
    {
        "comment": "Who's digging up shit from a team speech 4 years ago? This team is under such a microscope this year what's with thisEdit: down vote me all you want I feel there is a witch hunt going on here",
        "label": "NEG"
    },
    {
        "comment": "Guys who hit goals together, stay together",
        "label": "POS"
    },
    {
        "comment": "Nothing like getting all the stars to waste it.",
        "label": "NEG"
    },
    {
        "comment": "NEMEC!!!!!!!!!!",
        "label": "POS"
    },
    {
        "comment": "Fuck i love it when we actually attack off the rush instead of dumping it in. We are playing run and gun with the best team in the nhl and are right there with them",
        "label": "POS"
    },
    {
        "comment": "I saw quite a few Panthers fans in the crowd.  We've always had such a small fan base, it's exciting to see people cheering us on in other arenas!",
        "label": "POS"
    },
    {
        "comment": "Man slaf what a chance",
        "label": "POS"
    },
    {
        "comment": "Bahaha. Wideman...",
        "label": "NEG"
    },
    {
        "comment": "Boldy is so good at these man",
        "label": "POS"
    },
    {
        "comment": "Haven't seen this team since the first time we played the predators 🤷🏼‍♂️",
        "label": "NEG"
    },
    {
        "comment": "MONTY HUGGING ANDERSON OMGI LOVE MONTY",
        "label": "POS"
    },
    {
        "comment": "Evolving Hockey, who I think does a better job accounting for the score effect than natural stat trick and money puck, has Comrie facing 3.64 xGA. The Sabres gave up an above average amount of quality against and generated an amount that was well below average. Comrie may not have helped them win, but the Sabres skaters were by far the biggest problem yet again.",
        "label": "NEG"
    },
    {
        "comment": "He had THREE Canucks wide open on that side, it was as safe a play as there could be.",
        "label": "NEU"
    },
    {
        "comment": "Bedard deferring to jones is the stuff of nightmares.",
        "label": "NEG"
    },
    {
        "comment": "Don't let them turtle. Keep the pressure!",
        "label": "POS"
    },
    {
        "comment": "A shitty move that just keeps on shitting.",
        "label": "NEG"
    },
    {
        "comment": "7 points out of a Wild Card spot, with 4 games in hand. We're still very much in the fight.",
        "label": "POS"
    },
    {
        "comment": "Portzline said there's no chance they are looking at Elvis. He said they had scouts and a goalie coach at the Boston game, so probably Ullmark. Probably looking at us for defense because they know we have extra defenseman.",
        "label": "NEU"
    },
    {
        "comment": "What kind of call was that??",
        "label": "NEG"
    },
    {
        "comment": "They be calling everything lol",
        "label": "NEU"
    },
    {
        "comment": "3-1 in shootouts hoping to make it 4-1",
        "label": "POS"
    },
    {
        "comment": "i get the 2 man advantage, but i feel like they should read the room a bit. it seems pretty risky w a one goal lead when the pp has been so ineffective. when they pull the goalie normally at least there's a pretty good chance they'll ice it when they chuck it out of the zone, so it comes back to ozone. but i'm just some internet dork, these guys live and breath this, so i'll defer. just something i've always found weird",
        "label": "NEG"
    },
    {
        "comment": "Dickinson being a crafty son of a gun",
        "label": "POS"
    },
    {
        "comment": "Yes it's Ray Ferraro",
        "label": "NEU"
    },
    {
        "comment": "I don't understand how sometimes it's falling Petey and sometimes it's hitting Petey",
        "label": "NEU"
    },
    {
        "comment": "Haha ok ok. Lee can…. Get one of those painful hangnails, pull the skin off and use hand sanitizer!!",
        "label": "NEG"
    },
    {
        "comment": "How many times can we fire it right into the goalie's pads? Jfc.",
        "label": "NEG"
    },
    {
        "comment": "Gus bus coming throughGlad someone's trying to wake the team up.",
        "label": "POS"
    },
    {
        "comment": "Totally agree, still really new to hockey and picked the Kraken cause well they are also pretty new. Gonna support them for years to come just might take a 🥃 now and again 😂",
        "label": "POS"
    },
    {
        "comment": "All your D and G are belong to us- LTIR",
        "label": "NEU"
    },
    {
        "comment": "Fired Guerin, hire Dean as GM, and then hire Guerin as an assistant coach",
        "label": "NEU"
    },
    {
        "comment": "Canucks lead in goals and have a ton of wizards with the puck. I don't think shootouts would be that bad for them. It's not like the Sedin era where they couldn't score on the shootout",
        "label": "NEU"
    },
    {
        "comment": "That save by schmid is the EXACT thing that was missing a few weeks ago. Now it's up to the offense to respond. One save can change the game and a few weeks ago those saves weren't coming ever",
        "label": "POS"
    },
    {
        "comment": "Burky is back on the ice!",
        "label": "POS"
    },
    {
        "comment": "I love having Vally. Hope he never leaves.",
        "label": "POS"
    },
    {
        "comment": "Unfortunately, won't fix the most glaring problem with this team.",
        "label": "NEG"
    },
    {
        "comment": "Losing JBD is going to suck for the rest of the game.",
        "label": "NEG"
    },
    {
        "comment": "Always knew we play better with those blackout jerseys",
        "label": "POS"
    },
    {
        "comment": "In all seriousness, did Daddy call PDB a bald bitch or something?  Not even hating on Ty, I just don't fully understand the reasoning here",
        "label": "NEG"
    },
    {
        "comment": "TY KJ, for saving our asses.",
        "label": "POS"
    },
    {
        "comment": "I would have pronounced it like Beauvillier. But good think Caley and Chris pronounced it Beauvillier, because Beauvillier is wrong and Beauvillier is right. About time!",
        "label": "NEU"
    },
    {
        "comment": "Can't win many games giving up nonstop chances like that",
        "label": "NEG"
    },
    {
        "comment": "Bell Centre is bumping",
        "label": "POS"
    },
    {
        "comment": "This season is not a \"man they're gonna go on a run and who knows!?\" season for me, so I'm just watching the games to see what the future might look like.Wolf looked pretty great for his third NHL game, Zary had some nice looks, and Soloyov could be Tanev junior in a few years. I also love how Huberdeau is playing right now--hits, defensive pokes, all heart. Kadri looked good apart from taking out his own goalie while he was making a save.Weegar and Andersson have had two off games, not sure what's going on there.Dube looks like butt. Mangi is trying too hard.Coleman still looks pretty good, which is good because we're at the point in his contract where a guy his age in this situation might phone it in out of boredom or his body might start to give, but neither seems to be the case. Vladar must have read all the trade rumours after last game and decided to put them to rest. Not gonna get a lot for him after that.",
        "label": "NEU"
    },
    {
        "comment": "What the fuck. 4/17",
        "label": "NEG"
    },
    {
        "comment": "The benefit of all these waive Primeau brainiacs is it makes it easier to know who to block to avoid future annoying posts",
        "label": "NEG"
    },
    {
        "comment": "Booo Eichel booo",
        "label": "NEG"
    },
    {
        "comment": "Another game where Primeau is going to keep us in the game for two periods and our defense is likely going to collapse in the third. Then redditors with short term memory loss will hop on /r/habs saying Primeau is junk",
        "label": "NEG"
    },
    {
        "comment": "This is one of those that I take personally. I hope to fuck that Lee gets suspended. POS.",
        "label": "NEG"
    },
    {
        "comment": "VV looks sharp.  His timing and rebound control looks good so far.",
        "label": "POS"
    },
    {
        "comment": "They're going to turn it around guys, keep the faith",
        "label": "POS"
    },
    {
        "comment": "You were around for the 2014 playoffs, you can handle anything",
        "label": "POS"
    },
    {
        "comment": "gotta win this one for Korpi",
        "label": "POS"
    },
    {
        "comment": "Miracle that's a 1-1 game.Flames are playing with fire keeping tanev.",
        "label": "NEG"
    },
    {
        "comment": "Krug! C'mon!",
        "label": "NEG"
    },
    {
        "comment": "He's been caught for a goal twice like that this season. This is going to be a long road trip",
        "label": "NEG"
    },
    {
        "comment": "What the fuck are we paying all these 10 million dollar forwards and centers for when we cant even score any goals???",
        "label": "NEG"
    },
    {
        "comment": "Well, in the advanced stats dept, Matheson had best game of any Hab all season.",
        "label": "POS"
    },
    {
        "comment": "Smashed em! Buzzing buzzing!",
        "label": "POS"
    },
    {
        "comment": "The Publix ads have me craving their chicken, and I just had chicken!",
        "label": "POS"
    },
    {
        "comment": "Fuckin sloppy.",
        "label": "NEG"
    },
    {
        "comment": "The radio host just straight-up insulted Garland for being short, lol",
        "label": "NEG"
    },
    {
        "comment": "lol fair enough",
        "label": "NEU"
    },
    {
        "comment": "HOLY SHIT WENNBERG!",
        "label": "POS"
    },
    {
        "comment": "I think you might need a break, my guy",
        "label": "NEU"
    },
    {
        "comment": "Not a good trade but who else is there? This team is fucking soft and not built to win",
        "label": "NEG"
    },
    {
        "comment": "Someone call Toronto",
        "label": "NEU"
    },
    {
        "comment": "If Ottowa can score 3 in a period so can the Rangers.",
        "label": "POS"
    },
    {
        "comment": "Sacrificed the bodies tonight. Big respect. Could only listen to the radio except the last 10 minutes. Sounded like the sens played, dare I say, good?",
        "label": "POS"
    },
    {
        "comment": "we need changes",
        "label": "NEG"
    },
    {
        "comment": "Slaf first line first pp omg",
        "label": "POS"
    },
    {
        "comment": "Bless you Tanev",
        "label": "POS"
    },
    {
        "comment": "INTENT TO BLOW THE WHISTLE? WHY DONT YOU BLOW ME TORONTO",
        "label": "NEG"
    },
    {
        "comment": "joe b pulls of a three piece suit so well",
        "label": "POS"
    },
    {
        "comment": "More Suzuki shots please.",
        "label": "POS"
    },
    {
        "comment": "Why'd we just let the Capitals score their first power play goal in 5 weeks :(",
        "label": "NEG"
    },
    {
        "comment": "This is fucking insane. There needs to be a players meeting. No one gives a shit.",
        "label": "NEG"
    },
    {
        "comment": "Even though the Avs are clearly the better team holy fuck are the Flames jerseys 100x nicer. Got that going for us at least",
        "label": "POS"
    },
    {
        "comment": "Holy shit Sharks",
        "label": "NEG"
    },
    {
        "comment": "Can a surly redditor enlighten me again about how this team is actually better than last year?",
        "label": "POS"
    },
    {
        "comment": "Those smirking ass motherfuckers doing selfies in our goddamn arena.",
        "label": "NEG"
    },
    {
        "comment": "The Johnson suck fest is getting super annoying….wake up Buffalo!",
        "label": "NEG"
    },
    {
        "comment": "Shootouts are fake hockey",
        "label": "NEG"
    },
    {
        "comment": "I am loving it!",
        "label": "POS"
    },
    {
        "comment": "Thank you Bratt for saving us. Another amazing team offensive display that will yet again be overshadowed by almost blowing yet another lead. As someone who has been saying its been more on the defense these past weeks, it's no longer a debate. It's the goaltending. Start Schmid going forward and bench Vitek until he actually improves or trade for a goalie. This cannot continue. But very happy we managed to get a win against a great team.Also, Quinn, please come to Jersey. You know you wanna.",
        "label": "POS"
    },
    {
        "comment": "Show some life. PLEASE dont get shut out",
        "label": "NEG"
    },
    {
        "comment": "Brodie is the worst defenceman on the ice tonight",
        "label": "NEG"
    },
    {
        "comment": "My cousins were his next door neighbors in Maple Grove. I shot pucks in his garage back and played pond hockey with him still can't believe that happened. my entire family has been rooting for him from the Gophers to now the Wild crazy journey for him been really exciting watching his career.",
        "label": "POS"
    },
    {
        "comment": "damn, 6 shots already???",
        "label": "NEU"
    },
    {
        "comment": "He looks like he parks on his lawn",
        "label": "NEG"
    },
    {
        "comment": "I missed the goal because I knocked a fuckin glass ornament off the tree",
        "label": "NEG"
    },
    {
        "comment": "Poor Jason purrhees. :(",
        "label": "NEG"
    },
    {
        "comment": "He played just over 1/4 of the available ice time, which is good - typically 1/4 (i.e. 15 mins) will be your demarcation point for top 6 vs bottom 6. Hog has been stuck below that number for most of the season, but the last two games have been right up on that line (just shy against Jersey, 45s over last night). There's still a fairly large gap between the top line and pairing and everybody else, but Hoggy finally getting some love, and I think it's good because honestly I think he's playing the best hockey of his career so far.",
        "label": "POS"
    },
    {
        "comment": "We're already 3/4 on this road trip. I'm hoping for a W but I'd be ok if we drop this one. Second half of a back to back are always dicey",
        "label": "NEU"
    },
    {
        "comment": "Sammy needed that. Good job boys",
        "label": "POS"
    },
    {
        "comment": "No chance, defense got caught flat footed there",
        "label": "NEG"
    },
    {
        "comment": "Great shift",
        "label": "POS"
    },
    {
        "comment": "I want the boys to come out swinging today!",
        "label": "POS"
    },
    {
        "comment": "That was bad defensive play there. Wedge was doing what he was supposed to do and warning them of the guy coming out of the box. Neither defenseman cared. Luckily the post bailed us out.",
        "label": "NEG"
    },
    {
        "comment": "It's honestly some of the worst neutral zone defense I've ever seen. Our centers are so bad at defense.",
        "label": "NEG"
    },
    {
        "comment": "SO BACK",
        "label": "POS"
    },
    {
        "comment": "Worst part about tonight so far: The passing is atrocious. Too many times I see the puck passed to no one or to a player skating away from where the puck is heading. It's just like a total lack of awareness going on tonight.",
        "label": "NEG"
    },
    {
        "comment": "It really feels like this team is at its best when they simplify the game. Don't know what it is about our guys but it seems like they're perpetually trying to make highlight reel plays",
        "label": "NEU"
    },
    {
        "comment": "WTF IS HAPPENING",
        "label": "NEG"
    },
    {
        "comment": "What was 6 doing there",
        "label": "NEG"
    },
    {
        "comment": "Going full Atlanta Falcons yet again",
        "label": "NEG"
    },
    {
        "comment": "And of course right after I complain Matthews scores lol",
        "label": "NEU"
    },
    {
        "comment": "🤬🤬🤬",
        "label": "NEG"
    },
    {
        "comment": "German stereotypes coming thru with JJ",
        "label": "NEG"
    },
    {
        "comment": "I watched the Preds broadcast and they kept talking about the surprise they had for Leafs physicality and how it was too much for the Preds.",
        "label": "NEU"
    },
    {
        "comment": "WINNING THE FUCKING CUP",
        "label": "POS"
    },
    {
        "comment": "A lot of red sweaters in the crowd. Sabres need to win to spite those scumbags.",
        "label": "NEG"
    },
    {
        "comment": "Caufield has some sneaky feistiness that people don't talk about enough in my opinion",
        "label": "POS"
    },
    {
        "comment": "I mean I think games ending in a tie is silly, but even the NFL does it and I understand why. But rewarding points for a LOSS, is wild to me.",
        "label": "NEG"
    },
    {
        "comment": "Oh okay ya that's weird behavior",
        "label": "NEG"
    },
    {
        "comment": "Washington just pulled a kraken.",
        "label": "NEG"
    },
    {
        "comment": "Yep he definitely should. Call it load management if you need a reason for the press. The real question is what's actually going on with Ovi? Is there an injury he's just playing through? Something with home/family? Russia stuff? There's just zero effort for 60 minutes. Every once in a while he'll throw a soft check to make it seem like he's involved and then fade into the distance.",
        "label": "NEG"
    },
    {
        "comment": "Looks like Big Sexy wants the honor of fighting Jeannot.",
        "label": "NEU"
    },
    {
        "comment": "Sharkey! Gets us a PP goal!",
        "label": "POS"
    },
    {
        "comment": "14 seconds against the penguins and 18 seconds tonight!",
        "label": "NEU"
    },
    {
        "comment": "I think it's been obvious for a while that he has cognitive issues of some kind going on. It's really hard to listen to.Never cared for the guy at all but I hope he is well.",
        "label": "NEG"
    },
    {
        "comment": "Man, we finally figured out the second period just to forget how to play the third, huh?",
        "label": "NEG"
    },
    {
        "comment": "**BELLS!! WOOOOOO!! HOLY HELL!!**",
        "label": "POS"
    },
    {
        "comment": "Is Tuch ok? I was working last night so couldn't watch but listened to the postgame on the way home and heard he left with a hand injury?",
        "label": "NEU"
    },
    {
        "comment": "Another bad decision by Slaf, you have the slot take the shot why would you pass to CC who is glued to the ramp there",
        "label": "NEG"
    },
    {
        "comment": "#MORGAN",
        "label": "POS"
    },
    {
        "comment": "These Mofos don't lose in regulation",
        "label": "POS"
    },
    {
        "comment": "YES HE CANNER",
        "label": "POS"
    },
    {
        "comment": "The boys can't play in the 2nd, eh?",
        "label": "NEG"
    },
    {
        "comment": "Kadri taps his stick repeatedly to let Maroon know he approves of the dumb penalty.",
        "label": "NEG"
    },
    {
        "comment": "LETS GOOO WE ARE WINNING A GAME FOR ONCE AND ROBINSON SCORED",
        "label": "POS"
    },
    {
        "comment": "Fuck sake. I missed that headline. I was praying he'd get canned.",
        "label": "NEG"
    },
    {
        "comment": "It was coach colitan that didn't like him. We shoulda kept strome and ditched the coach sooner",
        "label": "NEG"
    },
    {
        "comment": "Let's hope the ice crew gets a stern talking to. Players falling and pucks jumping all over the rink. Not a bad period, Vanacek was OK but once again leaves one in prime territory off what should have been a glove save.",
        "label": "NEG"
    },
    {
        "comment": "Wiki says he's working for NHL Network and Norte Dame hockey",
        "label": "NEU"
    },
    {
        "comment": "Wow I didn't even realize that went in",
        "label": "NEU"
    },
    {
        "comment": "Raddysh and Johnson's line is so bad",
        "label": "NEG"
    },
    {
        "comment": "Both Florida teams absolutely shit-mixed in one week. Beautiful stuff.",
        "label": "POS"
    },
    {
        "comment": "Why isn't there more conversation on the sens gm search? It's been a few weeks since Pierre has been gone. Is the team waiting until the end of the season to hire a gm?",
        "label": "NEG"
    },
    {
        "comment": "is there not a preds broadcast of this since it's HNIC?",
        "label": "NEU"
    },
    {
        "comment": "How bad does it have to feel to create a break as Connor Bedard and look across to see Nikita fucking Zaitsev across from you on the 2 on 1?",
        "label": "NEG"
    },
    {
        "comment": "I don't think I love the twin towers pairing",
        "label": "NEG"
    },
    {
        "comment": "Mackinnon is so fucking fast holy shit",
        "label": "POS"
    },
    {
        "comment": "alright who paid off the refs during intermission this is some bullshit lol",
        "label": "NEG"
    },
    {
        "comment": "Canucks had a New Jersey hangover for the 1st period. Good thing DeSmith was sharp, well deserved shutout. He could get a few more starts. Last 2 periods were all Canucks. If they bury even half the PP and breakaway chances, the game is a laugher.",
        "label": "NEU"
    },
    {
        "comment": "Why is Ryan Johnson so slow to the puck?",
        "label": "NEG"
    },
    {
        "comment": "lol",
        "label": "POS"
    },
    {
        "comment": "Nashville can alley-oup the puck from behind the net but that's a missed game stoppage? Fuck off",
        "label": "NEG"
    },
    {
        "comment": "Anyone else having a super slow ROOT feed? Really irritating...",
        "label": "NEG"
    },
    {
        "comment": "I'm at the game and everybody is yelling to shoot more lol. That period sucked",
        "label": "NEG"
    },
    {
        "comment": "This blues team is fucking unpredictable",
        "label": "NEG"
    },
    {
        "comment": "That Myers penalty was bullshit tho",
        "label": "NEG"
    },
    {
        "comment": "Flower has gotta be so annoyed",
        "label": "NEG"
    },
    {
        "comment": "I can't believe we had all that cap space and this is the team we put together. Like I know we still in tank mode but this is cruel to put a team like this together. It's like watching beer leaguers",
        "label": "NEG"
    },
    {
        "comment": "Local man blames Jarmo for individual players failings...more at 6.Seriously. The assembled team is fine. They dominated the first two periods. There's got to be some kind of lack of player leadership.",
        "label": "NEG"
    },
    {
        "comment": "We're still 6-3-1 in the last 10. Next 6 games are very winnable. Hopefully we'll be back to normal by the time we go back to Vegas.",
        "label": "POS"
    },
    {
        "comment": "Jones has been everything you could ask for from a 3rd string goalie",
        "label": "POS"
    },
    {
        "comment": "They're off until Saturday, empty the tank and put it all out there in the third. Plenty of time to rest!",
        "label": "POS"
    },
    {
        "comment": "He only has 3 goals so I doubt his value is very high.",
        "label": "NEG"
    },
    {
        "comment": "What was really funny was when I saw him next to Big Rig",
        "label": "POS"
    },
    {
        "comment": "🚨 kreider hatty watch 👀",
        "label": "POS"
    },
    {
        "comment": "Oh god noooo",
        "label": "NEG"
    },
    {
        "comment": "Oh come on Zach… ugh.#KILL THIS",
        "label": "NEG"
    },
    {
        "comment": "At this point it's a need",
        "label": "NEU"
    },
    {
        "comment": "What a bullshit call",
        "label": "NEG"
    },
    {
        "comment": "If the last two games have taught me anything it's that the Flames are better off just being down 1-0 at puck drop",
        "label": "NEG"
    },
    {
        "comment": "Bonino Train? There's only one train in this town and it's the Trouba Train.",
        "label": "POS"
    },
    {
        "comment": "Damn Gregor should have shot that right away",
        "label": "NEG"
    },
    {
        "comment": "Fuck at least we get a point",
        "label": "NEG"
    },
    {
        "comment": "So tired of paying so much money to watch the Panthers only to have so many games not be on ESPN+.",
        "label": "NEG"
    },
    {
        "comment": "hattywatch AND gordiewatch?",
        "label": "POS"
    },
    {
        "comment": "Ah shit",
        "label": "NEG"
    },
    {
        "comment": "Sweep Florida games and Canucks will be back on track",
        "label": "NEU"
    },
    {
        "comment": "THAT'S IT, TIME TO SHAVE EVERYONE'S HEAD",
        "label": "NEG"
    },
    {
        "comment": "Fucks sake... Why does this team crumble on a 6on5 it's like we pulled the goalie Everytime",
        "label": "NEG"
    },
    {
        "comment": "Yup. He adds nothing to a checking line. Would love to see him on the second line with Monahan.",
        "label": "NEG"
    },
    {
        "comment": "Tom Wilson just can't not be a fuckwad",
        "label": "NEG"
    },
    {
        "comment": "Remember that 2-0 leads are bad in MSG",
        "label": "NEG"
    },
    {
        "comment": "Why are all of our guys hesitating to hit? They only call the retaliation",
        "label": "NEG"
    },
    {
        "comment": "Do you guys think our drafted guys (Lamoureux, Simashev, etc.) are going to be the answer to our defensive issues in the coming years? Or do you think we'll have to sign quality defensemen from outside the organization?",
        "label": "NEU"
    },
    {
        "comment": "Yep. Been saying it since ESPN+ became a thing.  It's almost as irritating as watching this team.",
        "label": "NEG"
    },
    {
        "comment": "Got my Doritos and edibles ready, let's fucking go boys",
        "label": "POS"
    },
    {
        "comment": "And we've tried to get a few plays in the crease but for the most part failed.  They protect the house well and our D shooting has been very meh tonight.",
        "label": "NEG"
    },
    {
        "comment": "Sharks seem to have lost interest in getting the puck out of the zone.",
        "label": "NEG"
    },
    {
        "comment": "maybe they (as a whole) should spend some time in the AHL because this team doesnt currently play like it belongs in this league",
        "label": "NEG"
    },
    {
        "comment": "Got a bad feeling this team is about to enter an “off the rails” stretch.",
        "label": "NEG"
    },
    {
        "comment": "Demko makin these Panthers look like pussycats!Really impressed with the team over these last few wins, they've really played some solid hockey. Another great night.",
        "label": "POS"
    },
    {
        "comment": "Wild that this team can't put more than 1 puck past one of the worst goalies in the league this year.",
        "label": "NEG"
    },
    {
        "comment": "Noted offensive duo Esa Lindish and Jani Hakanpaassist. Fun game tonight. Lots of action and a full team effort from start to finish. I know we can't win every game, but we should have that level of compete nightly. Great win.",
        "label": "POS"
    },
    {
        "comment": "Benson has more IQ than most of our team as an 18 year old",
        "label": "POS"
    },
    {
        "comment": "Edström is going to get a goal tonight. I'm willing it into existence.",
        "label": "POS"
    },
    {
        "comment": "Wow... what a move by Evengelista",
        "label": "POS"
    },
    {
        "comment": "I don't even know what's \"supposed\" to happen in a Canucks game any more and that's pretty cool",
        "label": "POS"
    },
    {
        "comment": "I'd like to see more Edstrom",
        "label": "POS"
    },
    {
        "comment": "Kid has a ton of growing up to do before he'll be an elite captain for sure.",
        "label": "NEU"
    },
    {
        "comment": "pain",
        "label": "NEG"
    },
    {
        "comment": "Kadri and the kids… best line in hockey",
        "label": "POS"
    },
    {
        "comment": "I wonder what was said!",
        "label": "NEU"
    },
    {
        "comment": "Remember how our defensive system was allowing the fewest odd man rushes in the league? How about we go back to that?",
        "label": "NEU"
    },
    {
        "comment": "Can we get kyrou back on the pp please.",
        "label": "NEU"
    },
    {
        "comment": "Best game of the season. Call it pesky, call it gutsy, call it gritty, call it lucky, I call it a WIN. This team looks so unbeatable when they play fast, win puck battles and make passes. Love to see the fellas play with focus. Great to have Ridley back. Now let's see it a few more games in a row and get this season back on the rails.",
        "label": "POS"
    },
    {
        "comment": "Sharks relearn how to play hockey all of a sudden",
        "label": "POS"
    },
    {
        "comment": "Where the hell was soderblom looking lmao",
        "label": "NEG"
    },
    {
        "comment": "Sounds like DeSmith is getting the start. That NJD didn't help Demko's numbers. At one point it was like 4 goals on 8 shots or something :/",
        "label": "NEG"
    },
    {
        "comment": "God I hate Sportsnet. Glazing the opponent at no end... Never any incling of \"homership\" for what makes up at least 3/4 of their viewers.",
        "label": "NEG"
    },
    {
        "comment": "So much of the lower bowl was empty after the 1st period. Granted the game had terrible weather, like freezing rain, but man it emptied out after the 1st. I was sandwiched between Sens fans in the top of the arena and we had a blast!",
        "label": "POS"
    },
    {
        "comment": "We're standing still",
        "label": "POS"
    },
    {
        "comment": "Still can't believe Petey straight missed the net there, what a setup from Boeser",
        "label": "NEG"
    },
    {
        "comment": "Well, NGL this loss was probably the worst for me this season. I'm still hopeful they'll do well in the playoffs but if they don't figure it out they're not going to go that far. I'll be at the garden tomorrow… 🙏🏻",
        "label": "NEG"
    },
    {
        "comment": "Don't worry. San Jose is catching up quickly",
        "label": "NEG"
    },
    {
        "comment": "VC absolutely deserved it. He quit on the team while still under contract.",
        "label": "NEG"
    },
    {
        "comment": "When did Bonino become a Ranger?",
        "label": "NEU"
    },
    {
        "comment": "They got sent to AHL",
        "label": "NEU"
    },
    {
        "comment": "BIG MILLAH",
        "label": "POS"
    },
    {
        "comment": ">these OTL loser points are actually hurting us by making our draft position worse It's a valid point but I don't want us to become the Mariners.  Keep on fighting Kraken.",
        "label": "NEG"
    },
    {
        "comment": "Put Tye back on the ice!",
        "label": "POS"
    },
    {
        "comment": "bro served up some spicy marinara right there",
        "label": "POS"
    },
    {
        "comment": "Omg Ovi shot soooo.cloooose",
        "label": "POS"
    },
    {
        "comment": "The blue line needs to go to the box, it keeps tripping our players",
        "label": "NEG"
    },
    {
        "comment": "Let's get a HATTY Rossi!! Beautiful play boys!",
        "label": "POS"
    },
    {
        "comment": "BUT ALSO MARK FUCKING STONE",
        "label": "POS"
    },
    {
        "comment": "I saw something, somewhere earlier today (great sources, i know) that it may be a longer term thing... I will see if I can find it. Might have been Garrioch.",
        "label": "NEU"
    },
    {
        "comment": "Feel the Bern!",
        "label": "POS"
    },
    {
        "comment": "He's about to regret it.",
        "label": "NEG"
    },
    {
        "comment": "Oh, it's a Christmas miracle!",
        "label": "POS"
    },
    {
        "comment": "Bedard vlasic and Marazek the only positivities of this season. And folignos leadership other than that not one positive thing",
        "label": "NEG"
    },
    {
        "comment": "Not a 3rd period team for some reason",
        "label": "NEG"
    },
    {
        "comment": "That was an excellent PP even without scoringBut goddamn none of those going stings a little",
        "label": "POS"
    },
    {
        "comment": "He was probably drunk.Still a dick move.",
        "label": "NEG"
    },
    {
        "comment": "Should've won the NYR game too. They haven't played well when injuries hit. Myers is still a problem, and our top players are getting out performed. Eichel line slapped JT aroundMakar out played QuinnPetey is MIA. Maybe they're tired and the home stand will help but it's on our top guys. 3rd and 4th line are doing their job. Defence needs some help, and I'm sure they'll be fine when Zadorov, Soucy, and hopefully Bear draw in. Should drastically change how we look.",
        "label": "NEG"
    },
    {
        "comment": "The duality of this freakin sub lol",
        "label": "NEU"
    },
    {
        "comment": "I know Richardson is here to guide us through a rebuild and help grow the young talent, but this coaching staff makes Trent Yawney and co. look competent.",
        "label": "NEG"
    },
    {
        "comment": "On the plus side, it's doubtful the Hawks will give up a goal during the intermission.",
        "label": "POS"
    },
    {
        "comment": "Definitely. I'd be happy getting to game 6/7 in the first round. (Who am I kidding I'll still cry)",
        "label": "POS"
    },
    {
        "comment": "They're not playing to score anymore. This is horrible.",
        "label": "NEG"
    },
    {
        "comment": "Can't wait to watch some of you hate-watch your favourite team tonight!",
        "label": "POS"
    },
    {
        "comment": "Sure it does. It counts as points in the standings, which decides playoff seeding. Also being in a lot of close 1 goal games, shows the boys can hang around with anyone. Few huge wins or losses, which don't happen in playoffs. Worse loses to be upset about",
        "label": "NEU"
    },
    {
        "comment": "Hey it's actually our traded player who gets the goal this time whooo !",
        "label": "POS"
    },
    {
        "comment": "Preds goalie making the difference, a tale as old as time. So glad that Saros' 38 saves didn't go to waste. Now if the guys could limit turnovers and play for more than 10 minutes that would be great.",
        "label": "POS"
    },
    {
        "comment": "Feel a little bad for Korpi, 3 goals on 13 shots isn't great for him, but he's been pretty well screened",
        "label": "NEG"
    },
    {
        "comment": "ESPN goes above and beyond to broadcast an  interview nobody wants, but fixing the audio is a bridge too far.",
        "label": "NEG"
    },
    {
        "comment": "Hog is hoggin",
        "label": "POS"
    },
    {
        "comment": "I'm gonna lose my mind if I have to hear this announcer's québécois “kadli” instead of “Kadri” once more.",
        "label": "NEG"
    },
    {
        "comment": "Potentially worst in league history. At least Rick Dipietro was hurt all the time so he was out of sight out of mind.",
        "label": "NEG"
    },
    {
        "comment": "Army could have kept Petro, but didn't want to give the player that much power with a no movement clause. Petro was a RHD PPQB? And Faulk was in the org at the time and capable of running the PP, Dunn was a LHD that was capable of the running the PP as well, Dunn and Wallman are both smaller D man that didn't get the correct chance/development in this org. They've since flourished else where. There's a ton of nervousness around smaller D players in this org. Krug and Leddy were both over reaction signings. Perron was devastated to leave here.  There's no world where you pay Leddy and not Perron.As far as Tkahuck goes, the 90 days following his trade the pendants all spoke that the Blues fell out of the race when they would not include Kyrou in a package.",
        "label": "NEU"
    },
    {
        "comment": "Boy I sure do love being considered \"in market\" and blacked out for games against Colorado, Seattle and Vegas out here in central fucking Montana!🌊☠️🏴‍☠️🦜🌊Boy I sure do love sailing the high seas even though I supposedly have the service I'm supposed to in order to legally watch my favorite hockey team!",
        "label": "NEG"
    },
    {
        "comment": "And here I thought the football game would end first…",
        "label": "NEG"
    },
    {
        "comment": "Three canucks right near the net moving left to right and no one actually keeping an eye on the front of the net. Like if you're panicking wouldn't it make sense to watch the front of the net? I don't know what that was.",
        "label": "NEG"
    },
    {
        "comment": "I love having Yanni and Canner on the same line",
        "label": "POS"
    },
    {
        "comment": "Thank God for Juuse being back.",
        "label": "POS"
    },
    {
        "comment": "Fiala looks to be the only one playing how we know he Can which he hasn't done a whole lot of this year lol",
        "label": "NEG"
    },
    {
        "comment": "The best logo in sports? It is practically a square. Chill lol",
        "label": "POS"
    },
    {
        "comment": "🍞🍞🍞",
        "label": "POS"
    },
    {
        "comment": "All I want for Christmas is a save % above league average",
        "label": "NEG"
    },
    {
        "comment": "We are now.",
        "label": "NEU"
    },
    {
        "comment": "Well played",
        "label": "POS"
    },
    {
        "comment": "No. But no defensive structure and starting a goalie on b2b nights after 50 shots against is questionable",
        "label": "NEG"
    },
    {
        "comment": "This is the best anthem renditions I've ever heard, other than the organ going a bit too hard, it's perfect.",
        "label": "POS"
    },
    {
        "comment": "Really dislike this goalie. What a disappointment",
        "label": "NEG"
    },
    {
        "comment": "I need Tavares to get 2 points tonight. Biggest crybaby franchise in sports.",
        "label": "NEG"
    },
    {
        "comment": "Get tf outta here. We are still on commercial because Bally fucked up.",
        "label": "NEG"
    },
    {
        "comment": "I HAVE NEVER SAID ANYTHING BAD ABOUT DAVID KAMPF",
        "label": "POS"
    },
    {
        "comment": "I didn't really see the close up replay but it sort of looked like Sherwood offered and McCabe accepted.",
        "label": "NEU"
    },
    {
        "comment": "People are going to blame Shesty on that but if you know hockey you know Jones crossed his path of vision right as the shot was released. Thats a big no no",
        "label": "NEG"
    },
    {
        "comment": "EXCELLENT KILL",
        "label": "POS"
    },
    {
        "comment": "My only reason for living lol",
        "label": "POS"
    },
    {
        "comment": "Ducking bench huberdeau huska you pussy",
        "label": "NEG"
    },
    {
        "comment": "Are we still fucking doing the 4th line after a goal??  Give me a fucking break",
        "label": "NEG"
    },
    {
        "comment": "I'm kidding. This place is great. But we could use a bit more swagger!",
        "label": "POS"
    },
    {
        "comment": "Exactly.  Devils give up too many goals.  Not a weird puck luck game.  Just the same old Devils skaters making mistakes plus poor goaltending.  This is what they are.",
        "label": "NEG"
    },
    {
        "comment": "Give Woll the C",
        "label": "POS"
    },
    {
        "comment": "well deserved contract extension for Monty too!",
        "label": "POS"
    },
    {
        "comment": "I changed my mind, retire his number",
        "label": "POS"
    },
    {
        "comment": "On a good note, Panarin has drew the last 4 penalties",
        "label": "POS"
    },
    {
        "comment": "Holy canoly",
        "label": "POS"
    },
    {
        "comment": "I don't want him to but you know how much scarier Byfield would be if he dropped the gloves every once in a while?",
        "label": "NEG"
    },
    {
        "comment": "QB on the bench watching Moore's goal.",
        "label": "NEG"
    },
    {
        "comment": "Dangles gonna be in a mood for sure.",
        "label": "POS"
    },
    {
        "comment": "I have work at 6am let's wrap this tf up guys",
        "label": "NEG"
    },
    {
        "comment": "There we go! Insane effort right there",
        "label": "POS"
    },
    {
        "comment": "didn't say he won't be really good, but comparing him to a dude who will go down as a top 5 player all time? cmon",
        "label": "NEG"
    },
    {
        "comment": "Weak defense there",
        "label": "NEG"
    },
    {
        "comment": "Apparently, benching leads to goal scoring.  Sooooo…..bench Ovie!  😆",
        "label": "POS"
    },
    {
        "comment": "*shit my pants noise*",
        "label": "NEG"
    },
    {
        "comment": "I mean Ferland played one season with Carolina and never broke 50pts with us. At least Lindy was more consistent with Carolina before then but I also didn't start watching hockey until 2020 season so I have 0 clue on eye tests which are also important",
        "label": "NEG"
    },
    {
        "comment": "Our passing was total garbage tonight. I can't tell if the players just couldn't connect their passes or if Vegas was predicting correctly every recipient. Even the simple D to D passes were struggling. I've honestly never seen such horrendous passing.",
        "label": "NEG"
    },
    {
        "comment": "I don't know about you, but I think it's swell when the leafs beat up on a team.",
        "label": "POS"
    },
    {
        "comment": "Get fucked Nichushkin lol",
        "label": "NEG"
    },
    {
        "comment": "Can we get relegated?",
        "label": "NEG"
    },
    {
        "comment": "Just making errant passes everywhere, looking really sloppy.",
        "label": "NEG"
    },
    {
        "comment": "That pass was *sexy*",
        "label": "POS"
    },
    {
        "comment": "Incredibly sloppy",
        "label": "NEG"
    },
    {
        "comment": "Poor Senko just can't score, he's gotten many good chances too!",
        "label": "NEG"
    },
    {
        "comment": "What a rebound",
        "label": "POS"
    },
    {
        "comment": "\"Kadri\" is pronounced \"Godfrey\"?",
        "label": "NEG"
    },
    {
        "comment": "But what's gained from pointing it out? You think Vitek's gonna read reddit comments saying he sucks and be like \"damn they're right\"? Just enjoy the win",
        "label": "NEG"
    },
    {
        "comment": "top tier schizo post",
        "label": "POS"
    },
    {
        "comment": "Nice fucking save Jet!!Thies has done some real good work with this kid.",
        "label": "POS"
    },
    {
        "comment": "Kuzy with suter is interesting... in a good way. I liked suter better with garly and dak but theyve been fine with bluger. I never would have thought of this until seeing lns game, but if that line can keep rolling with bluger and we can give kuzy a more offensively capable center in suter, who is still a 200 ft player who can cover for him defensively, and play them against bottom competition that could acc be great for us short term and help kuz get his confidence back.The top 6 seems to be playing fine recently (despite millers coments but kuzy wont play on that line anyways), so for now a pair of suter and kuzy on the bottom line is some lethal depth. Could make for 4 rlly dangerous lines. Just a thought.That being said, if kuzy keeps playing like this id guess hes back on the top line for a trial game the next time we lose. Some interesting options here when the team is healthy tho.",
        "label": "POS"
    },
    {
        "comment": "JUST TUNED IN FOR 1 MINUTE AND 3 GOALS WITHIN THAT TIME… AM I THE ONE",
        "label": "POS"
    },
    {
        "comment": "The refs literally joining the opponent's offense is actually a new one for me.",
        "label": "NEU"
    },
    {
        "comment": "\"The first 6 on 5 goal the leafs have allowed this year\" - yah bud, this is only the fuckin 6th game theyve had a lead in the last 2 minutes",
        "label": "NEG"
    },
    {
        "comment": "Great PK by the sens",
        "label": "POS"
    },
    {
        "comment": "Trumpers?",
        "label": "NEU"
    },
    {
        "comment": "Go Sens Go!!!",
        "label": "POS"
    },
    {
        "comment": "Where were yall watching this 😭😭 I couldn't find it",
        "label": "NEU"
    },
    {
        "comment": "Rob Ray will use that as proof why reading is dangerous for your health",
        "label": "NEG"
    },
    {
        "comment": "2 goals by guys undefended point blank. He also stopped more than one borderline breakaways",
        "label": "NEG"
    },
    {
        "comment": "Any team that needs a goalie this year should be taking a long look at Mrazek. Dude is giving it everything he's got this year with very little talent surrounding him.",
        "label": "POS"
    },
    {
        "comment": "LUUUUUUUUUUUUUUUUU",
        "label": "POS"
    },
    {
        "comment": "Not the hero we deserve",
        "label": "POS"
    },
    {
        "comment": "That's what we call a narcissist",
        "label": "NEG"
    },
    {
        "comment": "Anytime the game is being played tight they resort to strictly forehand plays up the wall and never look to reverse. It's like they're coached to put everything up ice and take no risk",
        "label": "NEG"
    },
    {
        "comment": "Are Lindholm and Huberdeau playing?",
        "label": "NEU"
    },
    {
        "comment": "no, penalty shot was the right call",
        "label": "NEU"
    },
    {
        "comment": "I find it really funny that everyone here who shits on Donato gets downvoted like he's an all-star or something.",
        "label": "NEG"
    },
    {
        "comment": "Because it's not gonna happen",
        "label": "NEG"
    },
    {
        "comment": "Start the period with a slash and a breakaway",
        "label": "NEG"
    },
    {
        "comment": "That roster makes us look competent",
        "label": "NEG"
    },
    {
        "comment": "I actually think it's an internal unsaid agreement among officials that the Stars get shit on after the controversial cup win. I'm probably just an obsessed fan bitching about our team's bad luck but it seems plausible to me",
        "label": "NEG"
    },
    {
        "comment": "What even happened? I missed it",
        "label": "NEU"
    },
    {
        "comment": "All I know is where they should be--the AHL",
        "label": "NEG"
    },
    {
        "comment": "Crowd's so quiet the broadcast mics are picking up the dome foam and pocket dog farts",
        "label": "NEG"
    },
    {
        "comment": "I have been to New Jersey once (Camden to be exact) and it truly is a dump. Reminds me of DTES with the zombies concentrated in one area and nuclear wasteland in Fallout 3 with the vast emptiness and destroyed buildings and infrastructure. My Uber driver was bewildered why I was there on the first place. Not saying that place is representative of the entire state but I was not impressed but horrified. NJ doesn't exactly conjure great images and thoughts. I doubt Quinn would go there by choice even if his bros are there.",
        "label": "NEG"
    },
    {
        "comment": "BEAUTIFUL play!",
        "label": "POS"
    },
    {
        "comment": "Hughes vs Hughes tonight",
        "label": "NEU"
    },
    {
        "comment": "While this is probably true, this statement continues to divide instead of unite. It wont change their mind but will instead comtinue them on their toxic spiral. Its better to never mention anything about them. Lets be better.",
        "label": "NEG"
    },
    {
        "comment": "And that's why, after securing a deal with Detroit, he went to the press and told the world that he would totally be back if only that meanie Kyle would call him. This whole conversation about him coming back if Davidson picked up the phone was designed to make Davidson look bad, and doing that has no downside for Kane whatsoever. Man's smart.",
        "label": "NEU"
    },
    {
        "comment": "Oh my fuckYES ADAMO",
        "label": "POS"
    },
    {
        "comment": "What the fuck Jeff got hurt and they throwing hits while hes on the ice. Fuck these shitbags",
        "label": "NEG"
    },
    {
        "comment": "To choke ourselves with?",
        "label": "NEG"
    },
    {
        "comment": "5 vs 3 and they got 1 single mf shot how can it get worse in a single game.  Can't even finish this comment before it gets worse",
        "label": "NEG"
    },
    {
        "comment": "Bruh his stick was hooked around Robo stfu",
        "label": "NEG"
    },
    {
        "comment": "I was to shy to say it but yeah slaf game reminds me of armia",
        "label": "NEU"
    },
    {
        "comment": "HES SO GOOD",
        "label": "POS"
    },
    {
        "comment": "Some classic leafs periphery hockey here",
        "label": "NEG"
    },
    {
        "comment": "game changing situations happen in games that are out of their control. what they can control is how they decide to play out of these situations.            these things cannot be happening, or they cannot happen anymore in this season. we do not want repeats of game 4 vs Edmonton. you have a multi-goal lead, you close the game out.",
        "label": "NEG"
    },
    {
        "comment": "I think I like the Tkachuks more than any opposing players",
        "label": "POS"
    },
    {
        "comment": "Heh, Regina",
        "label": "NEU"
    },
    {
        "comment": "Fucking Perron.",
        "label": "NEG"
    },
    {
        "comment": "I love the Martin - Gudbranson snow angel save 🥹",
        "label": "POS"
    },
    {
        "comment": "Dear situation room: kindly get fucked",
        "label": "NEG"
    },
    {
        "comment": "Holy crap, they actually got a play set up with the powerplay and fed Lindholm in the slot! And he missed the net",
        "label": "NEU"
    },
    {
        "comment": "You're thinking of his boy, Mike Richards",
        "label": "NEU"
    },
    {
        "comment": "That's a heck of a record to beat",
        "label": "POS"
    },
    {
        "comment": "I get off work late. Get the game on in time for OT. #See BUCH WIN IT!!!!!",
        "label": "POS"
    },
    {
        "comment": "Anyone know where the nearest pig farm is.  I need a new hog.  Mine has been cranked to death.",
        "label": "NEG"
    },
    {
        "comment": "Love struble and think he's a great player, I just feel for X to lose his job while injured, fan favorite too definitely a shitty situation with the logjam at LHD we have",
        "label": "POS"
    },
    {
        "comment": "Miro, idk if the expectations are getting to your head or if you're injured but we really need you to get back in form. I am confident he will figure it out.",
        "label": "NEG"
    },
    {
        "comment": "Two games we had…gone",
        "label": "NEG"
    },
    {
        "comment": "It's the year 2123. Most players in the NHL are descended from the Hughes brothers. All jerseys display first names and the first letter of the last name due to the prevalence of the name \"Hughes\".",
        "label": "NEU"
    },
    {
        "comment": "Please bury the whistle and let them play before the refs screw this one up too",
        "label": "NEG"
    },
    {
        "comment": "Meier gotta still be fighting through an injury he hasn't taken the body all game",
        "label": "NEG"
    },
    {
        "comment": "If Silly isn't hurt, does Patty get healthy scratched again?",
        "label": "NEU"
    },
    {
        "comment": "Vas got pulled",
        "label": "NEG"
    },
    {
        "comment": "At least 2 goals kahk would like to have back this game, offense having a rough night in general",
        "label": "NEG"
    },
    {
        "comment": "At this point if we did Levi twice a month through the rest of the season with the rest in the A I think there would be more games like this which would honestly be perfect.",
        "label": "POS"
    },
    {
        "comment": "Very good game last night. Hopefully we can get another streak going",
        "label": "POS"
    },
    {
        "comment": "is it too late to sign Rayzor to a 24 hour contract?",
        "label": "NEU"
    },
    {
        "comment": "This third period is just Seattle attacking and attacking and attacking.Come on boys! Hold on!",
        "label": "POS"
    },
    {
        "comment": "Is this even gonna be worth watching?  Back to back after a poor third last night?",
        "label": "NEG"
    },
    {
        "comment": "Papi loves scoring in Toronto !!!!!!",
        "label": "POS"
    },
    {
        "comment": "This is gonna be a shutout for sure lol",
        "label": "POS"
    },
    {
        "comment": "Stromer saves us from the broken play!!!",
        "label": "POS"
    },
    {
        "comment": "> Leafs down 3 NHL defensemen and playing Max LajoieFour guys out ahead of Lajoie tonight (Liljegren, Giordano, Klingberg, Lagesson). We're in \"just claim *anyone* on waivers\" territory right now.",
        "label": "NEU"
    },
    {
        "comment": "they could have also been stopped by a goalie.",
        "label": "NEU"
    },
    {
        "comment": "YAMAMOTO MY HEROOOOOO",
        "label": "POS"
    },
    {
        "comment": "1 step down!",
        "label": "NEU"
    },
    {
        "comment": "There should never be a call that can't be reviewed imo",
        "label": "NEG"
    },
    {
        "comment": "Chinny just said fuck you",
        "label": "NEG"
    },
    {
        "comment": "Need the otter plush.",
        "label": "NEU"
    },
    {
        "comment": "Pain",
        "label": "NEG"
    },
    {
        "comment": "I fucking love Mika, but he has been fucking wack tonight",
        "label": "NEG"
    },
    {
        "comment": "Suck it Fat Pat",
        "label": "NEG"
    },
    {
        "comment": "GG from a Devils fan, you guys thoroughly outplayed us in most of the second and all of the third. We might as well hire the post to be our goalie now. Was a crazy few seconds at the end there!",
        "label": "POS"
    },
    {
        "comment": "MIRO THE HERO HEISKANENNNNNNNN",
        "label": "POS"
    },
    {
        "comment": "Oh cmon…",
        "label": "NEG"
    },
    {
        "comment": "This is gonna be choke bowl",
        "label": "NEG"
    },
    {
        "comment": "Getting good goals taken away on irrelevant technicalities is just plain cheating.",
        "label": "NEG"
    },
    {
        "comment": "I have to mute this every time until the broadcast comes back on. Absolute pain",
        "label": "NEG"
    },
    {
        "comment": "The crap team from Washington isn't special enough to alter the way I type. FOH.",
        "label": "NEG"
    },
    {
        "comment": "VO WAY TO STEP UP",
        "label": "POS"
    },
    {
        "comment": "Gotta love it",
        "label": "POS"
    },
    {
        "comment": "No Shutout!",
        "label": "NEU"
    },
    {
        "comment": "All of a sudden, Zary and Kadri don't look that good anymore.Dube is poison. Get him off that line.",
        "label": "NEG"
    },
    {
        "comment": "Boo this man! Boo!",
        "label": "NEG"
    },
    {
        "comment": "I know the yotes are the joke of the league but the flatness and lack of urgency the blues show while playing them is fucking embarrassing. They have good pieces and we need to wake the fuck up.",
        "label": "NEG"
    },
    {
        "comment": "That's exactly why I used that logic. Neither team has accomplished anything so all you can look at is individual accomplishments.Who's better, Zib or Brassard?Rangers won that trade handily.",
        "label": "NEU"
    },
    {
        "comment": "Zadorov-Myers are gonna bleed chances against",
        "label": "NEG"
    },
    {
        "comment": "They think they can win just by showing up and it's clear that they don't have any fire playing under the same old guy who has been here for multiple seasons",
        "label": "NEG"
    },
    {
        "comment": "Im honestly curious what the 1st line would like with Anderson or Entwistle or Dickinson up there instead of Kurashev lol just basically a body and someone that wants to bring energy",
        "label": "NEU"
    },
    {
        "comment": "Five goals on ten shots. PHENOMENAL LMFGY",
        "label": "POS"
    },
    {
        "comment": "He fell into the goalie once. Then helped Larkin score. Then fell again in the O zone.",
        "label": "NEU"
    },
    {
        "comment": "If this is what a 60 min effort means for the Canucks, then I hope Tocchet plays the tape over and over again. Great result, they need to string together more wins as Oilers just got their 8th W in a row.",
        "label": "POS"
    },
    {
        "comment": "Provy has been our best defenseman by far. He's really good",
        "label": "POS"
    },
    {
        "comment": "It's already funny to read but it'll be even funnier in 10 years to look back at all the \"Byfield is a bust!\" comments.Dude needed some time to develop, we have it to him and are reaping the rewards.",
        "label": "POS"
    },
    {
        "comment": "Damnit Dewey! I want you to get one!!",
        "label": "POS"
    },
    {
        "comment": "I mean yea but that shit happens literally all the time and goes uncalled",
        "label": "NEG"
    },
    {
        "comment": "wouldn't be a wild game without my heart rate going wild too",
        "label": "NEG"
    },
    {
        "comment": "Bratt looks confused that Palat scored",
        "label": "NEU"
    },
    {
        "comment": "Vasy looks horrific. Dont even care that I put him in my fantasy lineup. Destroy em",
        "label": "NEG"
    },
    {
        "comment": "Will the Flames be able to score first?find out after these messages.",
        "label": "NEU"
    },
    {
        "comment": "I so want to hear his call",
        "label": "POS"
    },
    {
        "comment": "That was gross",
        "label": "POS"
    },
    {
        "comment": "Last year, it seems more often than not that the Rangers didn't play with as much energy and discipline in front of Halak as they did when Shesty was in net. This year, the Rangers look better when Quick is in net. 0.o",
        "label": "NEU"
    },
    {
        "comment": "That's karma. Buffalo was hunting",
        "label": "NEG"
    },
    {
        "comment": "He's not gonna win us anything ever",
        "label": "NEG"
    },
    {
        "comment": "Thots and prayers to Jeff Skinner for suffering such a horrific spine injury 🙏😞🏥🍆😩💦",
        "label": "NEG"
    },
    {
        "comment": "Solid win, but they need to clean up the stupid penalties or else Tampa is gonna kill them. Way better pp coming in on tuesday.",
        "label": "POS"
    },
    {
        "comment": "These Jerseys are fresh idc what anyone says",
        "label": "POS"
    },
    {
        "comment": "Defence was actually pretty good. Most of the flyers shots came from the outside",
        "label": "POS"
    },
    {
        "comment": "Reddit is also tired on a back to back.",
        "label": "NEG"
    },
    {
        "comment": "Gally deflected that in front of the net and Pearson got the rebound. Give my man Gally his assist for his 700th game you fools !",
        "label": "NEG"
    },
    {
        "comment": "Ondrej, you idiot",
        "label": "NEG"
    },
    {
        "comment": "Real shame Miller's dog died right before that goal",
        "label": "NEG"
    },
    {
        "comment": "Holy shit",
        "label": "NEG"
    },
    {
        "comment": "I think tomorrow will be the true test. If we strap in and play well against LA, then the past few games have truly been a combo of lazy hockey and bad luck bc they think they don't need to try against bad teams.",
        "label": "NEU"
    },
    {
        "comment": "Why is the 4th line out there after an icing",
        "label": "NEG"
    },
    {
        "comment": "juraj my boy what a nasty goal!!! well deserved",
        "label": "POS"
    },
    {
        "comment": "Seats are 114 near the Zamboni entrance. Not sure if that's much of an upgrade for you. :)",
        "label": "NEU"
    },
    {
        "comment": "Hate Geekie.",
        "label": "NEG"
    },
    {
        "comment": "Why must we always crap the bed with NJ no matter how garbage they are smh, its actually annoying",
        "label": "NEG"
    },
    {
        "comment": "Smash that like button.",
        "label": "POS"
    },
    {
        "comment": "Ipad kid Connor Bedard is having his screen time limited lol.I keep thinking of him rapidly tapping his thumb to review a play he messed up a few weeks ago",
        "label": "NEG"
    },
    {
        "comment": "#CONN SMYTHESSAULT!!!",
        "label": "POS"
    },
    {
        "comment": "and no Tarasenko",
        "label": "NEU"
    },
    {
        "comment": "Fucken Rob Ray takin one for the team!!!",
        "label": "POS"
    },
    {
        "comment": "‘Normal guy would've been carried outta here' ‘It felt good'. Never change Rayzor",
        "label": "POS"
    },
    {
        "comment": "This is wild.",
        "label": "NEG"
    },
    {
        "comment": "lol here come the ice time bitching comments",
        "label": "NEG"
    },
    {
        "comment": "2 goals and 2 posts, nice",
        "label": "POS"
    },
    {
        "comment": "I agree the physical play woke us up in yesterday's game, but Minnesota was a serious bruiser of a team last year. Not sure we can get away with playing that game tonight.",
        "label": "NEG"
    },
    {
        "comment": "I'll tell myself this is fate due to our LA win",
        "label": "POS"
    },
    {
        "comment": "Forsy!!! He's heating up!",
        "label": "POS"
    },
    {
        "comment": "This game is out of control now. Double screening night to finish out this ridiculousness.",
        "label": "NEG"
    },
    {
        "comment": "we just need one Binnington tantrum to finish this game 8-3.edit, and us getting the tie should help with that.",
        "label": "NEG"
    },
    {
        "comment": "Neighbors deserves a goal tonight",
        "label": "POS"
    },
    {
        "comment": "I'm guessing he's running on about 41 minutes of sleep in the last 72 hours.",
        "label": "NEG"
    },
    {
        "comment": "The best worst good bad goaltender this season",
        "label": "NEG"
    },
    {
        "comment": "Weegs is cooking a gourmet meal tonight",
        "label": "POS"
    },
    {
        "comment": "Kyrou hasn't made a good decision since he scored that goal. I don't get it.",
        "label": "NEG"
    },
    {
        "comment": "the fall of Petey  literally",
        "label": "NEG"
    },
    {
        "comment": "because this team isnt good enough to push losses into OT",
        "label": "NEG"
    },
    {
        "comment": "How has Struble played since being called up? I haven't had the chance to watch many games lately.",
        "label": "NEU"
    },
    {
        "comment": "Gaudreau-Danforth-Texier is uuuhh… certainly a line",
        "label": "NEG"
    },
    {
        "comment": "We're beating the Hawks at being the worst team in the league.",
        "label": "NEG"
    },
    {
        "comment": "Saw it live on the post game show",
        "label": "NEU"
    },
    {
        "comment": "Is Meier still hurt? He's looked awful since coming back",
        "label": "NEG"
    },
    {
        "comment": "They were playing great until Huby missed a wide open net with lots of time. The team hasn't been the same since.",
        "label": "NEG"
    },
    {
        "comment": "Hahaha foligno giving em the noogie",
        "label": "NEU"
    },
    {
        "comment": "So Kuzmenko actually has the exact same assists/GP last year, if he shoots 1.75 shots/GP with a 13.5 (half as last year) shooting %, same assists/GP as current hed score 19 goals 35 assists 54 points",
        "label": "NEU"
    },
    {
        "comment": "It can be rough when you don't bandwagon as a fan.  It could be worse though.  I'm not a basketball fan but the lions also have more wins in this last calendar year than the pistons.",
        "label": "NEG"
    },
    {
        "comment": "Oh yeah sick let's foster a losing culture I bet that'll help",
        "label": "NEG"
    },
    {
        "comment": "Schnieds man you can't let him stand there.",
        "label": "NEG"
    },
    {
        "comment": "Jesus fuck there's 5 minutes left send Okposo to the fucking parking lot",
        "label": "NEG"
    },
    {
        "comment": "LETS GOOOOOOOO",
        "label": "POS"
    },
    {
        "comment": "I think someone way up in the rafters was chirping him, and he was trying to hit them.",
        "label": "NEU"
    },
    {
        "comment": "They'll be gone by April, don't worry",
        "label": "NEG"
    },
    {
        "comment": "Local burger place's December special!",
        "label": "POS"
    },
    {
        "comment": "Gudas is a fucking neanderthal",
        "label": "NEG"
    },
    {
        "comment": "As I have been saying all season, Bedard point watch.",
        "label": "POS"
    },
    {
        "comment": "So glad this one worked out for us. So, next off-season, everyone trains with Jo!",
        "label": "POS"
    },
    {
        "comment": "You lost me on that Timo besmirchment. Otherwise I agree with everything else.",
        "label": "NEG"
    },
    {
        "comment": "3 goals from the dmen.",
        "label": "POS"
    },
    {
        "comment": "I would hope so, special teams have been lacking lately but still need to work on that 5V5 play even though they did a tad better tonight I thought.",
        "label": "NEG"
    },
    {
        "comment": "Hold on to your feet, damn.",
        "label": "NEG"
    },
    {
        "comment": "Good to see. Finally!",
        "label": "POS"
    },
    {
        "comment": "Why Huber no back hand?!?",
        "label": "NEU"
    },
    {
        "comment": "Am I taking crazy pills or was he brought up and looking good last year too..?",
        "label": "POS"
    },
    {
        "comment": "Comedy is real and Minnesota sports invented it",
        "label": "NEG"
    },
    {
        "comment": "Also valid",
        "label": "POS"
    },
    {
        "comment": "Do you think he gets called Shoresy in the locker room?",
        "label": "NEU"
    }
]