[
    {
        "comment": "Yeah his game ain't perfect but he'll get better.",
        "label": "NEU"
    },
    {
        "comment": "NO GOAL NO GOAL HOLY SHIT",
        "label": "NEG"
    },
    {
        "comment": "The 2023 Sabres are allergic to win streaks",
        "label": "NEG"
    },
    {
        "comment": "Right there with you. Last season I could somewhat see it as a casual fan. Season one I could see it because season one. But not this year.",
        "label": "NEU"
    },
    {
        "comment": "Key word: *GOALTENDING*",
        "label": "NEG"
    },
    {
        "comment": "“Richardson, Luke Richardson” - How I feel Chicago coach introduces himself",
        "label": "NEU"
    },
    {
        "comment": "Not a playoff team.  It's not even January.  This is depressing the regression this year",
        "label": "NEG"
    },
    {
        "comment": "Kind of weird how neither Captain Spaulding nor Dano have realized that it was Nemec's first point yet.Edit: There we go, he finally said it.",
        "label": "NEU"
    },
    {
        "comment": "Man I miss the wings in the west The loss of rivalry with Detroit and Dallas over the years has been sad because I enjoyed those rivalries a lot but just don't care for the Vegas rivalry at all",
        "label": "NEU"
    },
    {
        "comment": "Matt \"**Slick Mitts Wicked Wristers**\" Boldy",
        "label": "NEU"
    },
    {
        "comment": "Thank you for putting your old shirt back on, please leave the new shirt in the closet, and don't do that again please 😂",
        "label": "NEU"
    },
    {
        "comment": "1st goal allowed was soft, Charlie would've made that breakaway save, 3rd goal was just dumb",
        "label": "NEG"
    },
    {
        "comment": "Please can someone upload the clip of him saying that. I missed it!",
        "label": "NEU"
    },
    {
        "comment": "The fact we're still pressing while up 6-1, with less than a minute left…#I FUCKING LOVE IT",
        "label": "POS"
    },
    {
        "comment": "so close! christian mccafferyis in the nfl",
        "label": "POS"
    },
    {
        "comment": "Latest penalty call I've ever seen",
        "label": "NEU"
    },
    {
        "comment": "this is your villian arc",
        "label": "NEU"
    },
    {
        "comment": "I can't fucking believe",
        "label": "NEG"
    },
    {
        "comment": "they wanted to pull him earlier but he said no. he also did that during the playoffs against the leafs",
        "label": "NEU"
    },
    {
        "comment": "Wasn't that boring lol",
        "label": "NEG"
    },
    {
        "comment": "Gave this away on penalties",
        "label": "NEG"
    },
    {
        "comment": "# Cloudy with a chance of goals! 🚨 🚨",
        "label": "POS"
    },
    {
        "comment": "One step forward and two steps back. just like the last 2 rebuilds that didn't work",
        "label": "NEG"
    },
    {
        "comment": "THEY LISTENED",
        "label": "POS"
    },
    {
        "comment": "Knies :(Everyone's gettin' the damn flu. I am finally recovering after a real shitty few days",
        "label": "NEU"
    },
    {
        "comment": "Between the legs 5 hole goal is filthy. Can't even be mad",
        "label": "POS"
    },
    {
        "comment": "They tried to make up for the game THEY let go in the first place. Gave Danforth and OEL both game misconducts for basic shoving and yapping in front of the net",
        "label": "NEG"
    },
    {
        "comment": "That first line could be something dangerous in a couple of years",
        "label": "POS"
    },
    {
        "comment": "Defense sucked but can someone explain why we've lost to **FIVE backup goaltenders** already??? Are we incapable of scoring 7 goals on Martin Jones even though we did on Linus Ullmark?????",
        "label": "NEG"
    },
    {
        "comment": "LMAO of course",
        "label": "NEU"
    },
    {
        "comment": "Aside from Bedard, Vlasic, Korchinski, Kurashev, Reichel, and Seth Jones (due to the massive contract) who on this NHL roster can we project to be here long term?",
        "label": "NEU"
    },
    {
        "comment": "Is SA even the right word for what the Yotes are doing to us, feels more like a colonoscopy from a drunk doctor with parkinson's.",
        "label": "NEG"
    },
    {
        "comment": "GO EDSTROM!!!!!!!!! GET THAT FIRST NHL GOAL!!!!!!!!",
        "label": "POS"
    },
    {
        "comment": "Narrator: *\"... they couldn't.\"*",
        "label": "NEG"
    },
    {
        "comment": "New coach effect....6-1 Blues !",
        "label": "POS"
    },
    {
        "comment": "Have you ever been in attendance for a shutout game where they got stifled? I have. I understand the booing. Tickets aren't cheap and you'd at least expect a goal or two to make it feel worth your money.",
        "label": "NEG"
    },
    {
        "comment": "lol some of you are so insane. It's fine to admit a goalie didn't have a great game. Defensive mistakes are gonna happen, that's what you pay your goalie for. Obviously you don't want to see turnovers etc but it happens, look how many times it happened to st.Louis today. Their goalie just made more saves than ours.",
        "label": "NEU"
    },
    {
        "comment": "Bedsy hates Chicago, only 2 goals at home vs 9 on the road! /s",
        "label": "POS"
    },
    {
        "comment": "Ottawa making one of the worst PP in the league look fantastic",
        "label": "NEG"
    },
    {
        "comment": "I'm hoping for a barn burner. Slippery Pete gets his first hatty and the final score is 5-4.",
        "label": "POS"
    },
    {
        "comment": "I think the record for fewest shots is 6.  Maybe they can go for the record tonight",
        "label": "NEG"
    },
    {
        "comment": "John's Pizza on Bleacker Street. Good pies!",
        "label": "NEU"
    },
    {
        "comment": "Brutal call",
        "label": "NEG"
    },
    {
        "comment": "Apparently GMKA and Granato have a godlike ability to wring production out of 4th liners",
        "label": "POS"
    },
    {
        "comment": "I've been shouting this every game this week. It's simply too good. We have to make it a thing.",
        "label": "POS"
    },
    {
        "comment": "Doug Armstrong. GM of the Blues. Getting booed for firing Berube",
        "label": "NEG"
    },
    {
        "comment": "They cant keep getting away with this!         Kings: we'll fucking do it again",
        "label": "POS"
    },
    {
        "comment": "A $12 million dollar player should be better than PPG, so yes.",
        "label": "POS"
    },
    {
        "comment": "Jamie Rivers said on the broadcast that it used to be called that way but not anymore",
        "label": "NEU"
    },
    {
        "comment": "Disagree. Juuse needs a break again. He's not his usual self.",
        "label": "NEU"
    },
    {
        "comment": "Hartman waving that pokecheck off is funny af",
        "label": "POS"
    },
    {
        "comment": "Like.. is Timo okay?",
        "label": "NEU"
    },
    {
        "comment": "is this game not on espn+?",
        "label": "NEU"
    },
    {
        "comment": "I guess it's my fault. I turned it off when it was 5-0 and then tuned back in for OT.",
        "label": "NEU"
    },
    {
        "comment": "Man, ESPN is the undisputed leader of not showing footage of the things they are talking about.",
        "label": "NEU"
    },
    {
        "comment": "To add, their powerplay is anemic and is the reason they lost that game.",
        "label": "NEG"
    },
    {
        "comment": "Probably be the only one he'll have.",
        "label": "NEG"
    },
    {
        "comment": "I'm done with Anderson.",
        "label": "NEG"
    },
    {
        "comment": "what a cluster fuck",
        "label": "NEG"
    },
    {
        "comment": "Move out the way san jose",
        "label": "NEU"
    },
    {
        "comment": "This feels like the end of the 7th period",
        "label": "NEU"
    },
    {
        "comment": "They fucking started it. so stupid",
        "label": "NEG"
    },
    {
        "comment": "Every team in the league should be laying for 1/32nd of Hubies salary. He's an inside agent for all of them",
        "label": "NEU"
    },
    {
        "comment": "Looking like a 5-6 record in the last 11, where the team hasnt had a really solid game in that stretch, and are probably lucky to even have 5 wins. Games like these are telling just how far away from being a real contender they are.",
        "label": "NEU"
    },
    {
        "comment": "At least we weren't shut out but losing 6 in a row is just painfully disappointing. On to the next one.",
        "label": "NEG"
    },
    {
        "comment": "Cole going for the middle of the ice is a good sign.",
        "label": "POS"
    },
    {
        "comment": "Why does every Dal stream suck balls lately?",
        "label": "NEG"
    },
    {
        "comment": "Uhh okay. What, are you doing a bit or something?  Coulda fooled me.",
        "label": "NEU"
    },
    {
        "comment": "Disagree. The outpouring of support can do wonders for somebody dealing with mental health issues and I saw a heck of alot of supportive comments on those videos.",
        "label": "POS"
    },
    {
        "comment": "Please don't waste a game where VV isn't swiss cheese by playing straight up garbage hockey. Please I beg",
        "label": "NEG"
    },
    {
        "comment": "Gregor skates like literal lightning",
        "label": "POS"
    },
    {
        "comment": "I would actually take a 4 on 4 instead of a PP ngl",
        "label": "NEU"
    },
    {
        "comment": "Good game",
        "label": "POS"
    },
    {
        "comment": "Wasn't nervous for a second there (lie)",
        "label": "NEU"
    },
    {
        "comment": "After the 3 goal comeback in the bubble series against Columbus I decided I'm never turning off a leafs game early again. I turned that one off when Columbus scored the 4-1 goal for about 30 seconds. Then I thought \"ok but what it?\". Turned it back on for the comeback and I'm glad I did.   Ever since then, I just can't do it. Not with these jokers.",
        "label": "POS"
    },
    {
        "comment": "Hoggy was a stud last night. I think Tocchet is going to have an easy time admitting he may have miscast that kid. Tower one and two pairing had some shakey moments but overall much better. Second period was beast mode.",
        "label": "POS"
    },
    {
        "comment": "#OH MY",
        "label": "POS"
    },
    {
        "comment": "DJ needs to have these boys practice line changes",
        "label": "NEU"
    },
    {
        "comment": "OVi should not be on the PK.",
        "label": "NEG"
    },
    {
        "comment": "Vegas has depth. Alvin is trying to get us depth but we aren't there yet. Vegas has a solid team that plays as a complete unit as well. Most their team can play up and down the lineup. I don't think this had anything to do with who was healthier and it's really not an excuse as all teams face injuries.Soucy and Suter going down exposed our lack of depth and that's what's hurting us.... Especially if you consider that players of their calibre should not effect a team like this has. If your top goalie, top center or top dman go down... That's what should effect the team. Not a 3rd line center... Not a middle pair Dman.",
        "label": "NEU"
    },
    {
        "comment": "Unreal right there! Actually got up from my Sunday couch situation. Pat Foley would have lost his mind! Looking good dudes. Let's sink one!",
        "label": "POS"
    },
    {
        "comment": "Habs powerplay has to be the least talented powerplay in the leagueEmbarrassing puck movement",
        "label": "NEG"
    },
    {
        "comment": "You just hope that Bedard does something special like he did on that assist to Murphy because otherwise this team is so goddamn boring to watch. Passes to skates, guys not being ready for scoring opportunities, and constantly out of position. Just brutal to watch sometimes.",
        "label": "NEG"
    },
    {
        "comment": "God damn Tucker holy fuck bud.",
        "label": "NEG"
    },
    {
        "comment": "Wake up babe new worst loss of the season just dropped",
        "label": "NEG"
    },
    {
        "comment": "He was the biggest flames homer back in the day when he did the western game every Saturday. He was terrible then and he is even worse now",
        "label": "NEG"
    },
    {
        "comment": "Yeah, hindsight... except tons of people were saying that back then, too.   Fun fact: three days after Army signed Krug, Colorado got Toews from the Isles for two 2nds.",
        "label": "NEU"
    },
    {
        "comment": "Yes.  Simple Minds since 2021.  Before that was Van Halen and Green Day.",
        "label": "NEU"
    },
    {
        "comment": "So ... glass half full : getting wins in overtime by clawing back from deficits OR giving up leads are gutsy wins that show character.Or Glass half empty : having to claw back to force OT or giving up leads is systemic is will bite them down the line?",
        "label": "NEU"
    },
    {
        "comment": "Not surprised they lost, but the way they were able to lose was very interesting.",
        "label": "NEU"
    },
    {
        "comment": "Well it's gotta suck to have a history of greatness but a reality of... Meh.",
        "label": "NEG"
    },
    {
        "comment": "Fuck me that's deflating",
        "label": "NEG"
    },
    {
        "comment": "Holy shit, you remember that? That's impressive.",
        "label": "POS"
    },
    {
        "comment": "LOL love the Bronx Cheer for their 1st shot on goal over halfway through the 1st!",
        "label": "NEU"
    }
]