[
    {
        "comment": "You know what's a great way to win games? NOT PUTTING YOURSELF IN THE HOLE IN THE FIRST IN EVERY DAMN GAME!",
        "label": "NEG"
    },
    {
        "comment": "1 more till 1k😮‍💨",
        "label": "POS"
    },
    {
        "comment": "Is there a reason we don't bring up Wright at this point?",
        "label": "NEU"
    },
    {
        "comment": "LET'S FUCKING GO",
        "label": "POS"
    },
    {
        "comment": "Entwhistle never seemed like a guy that was going to be more than a career AHLer. Kudos to him for improving each year of his career.",
        "label": "POS"
    },
    {
        "comment": "Kurashev… you gotta skate that in the zone then pass at that point… that was a bad play to kill momentum.",
        "label": "NEU"
    },
    {
        "comment": "Did Chycrun just slapshot it out of midair? What the fuck? That's the coolest thing I've seen all month",
        "label": "POS"
    },
    {
        "comment": "FANTILLI HAD HIS BREAKOUT GAME, LEAGUE'S FUCKED",
        "label": "POS"
    },
    {
        "comment": "Yeeaaaaaaas",
        "label": "POS"
    },
    {
        "comment": "Timo is struggling",
        "label": "NEG"
    },
    {
        "comment": "doomers repent",
        "label": "NEG"
    },
    {
        "comment": "HIS NAME IS THATCHER LUONGO DEMKO",
        "label": "NEU"
    },
    {
        "comment": "That was beautiful did he one-hand that shit??",
        "label": "POS"
    },
    {
        "comment": "The first ten minutes he made multiple big stops. Including during the sustained two minutes possession.",
        "label": "NEU"
    },
    {
        "comment": "PISS INTO MY OWN ASS WTF",
        "label": "NEG"
    },
    {
        "comment": "Shoutout to Stolarz, clutch plays",
        "label": "POS"
    },
    {
        "comment": "I DON'T KNOW ABOUT YOU BUT I'M FEELING 22",
        "label": "POS"
    },
    {
        "comment": "What in the actual fuck was our PP?",
        "label": "NEG"
    },
    {
        "comment": "Soviet bluenion line",
        "label": "NEG"
    },
    {
        "comment": "That's my horse",
        "label": "POS"
    },
    {
        "comment": "OK #40 time to go Super Saiyan please",
        "label": "POS"
    },
    {
        "comment": "Don't look now, but Ryker/Dumoulin has been the best D-pair (based on analytics) in every game they've played together.  [Here]( is the stat card from tonight.",
        "label": "POS"
    },
    {
        "comment": "The tune up at the speed shop was worth it.",
        "label": "POS"
    },
    {
        "comment": "Full 3m in the O zone, that was awesome.",
        "label": "POS"
    },
    {
        "comment": "Chychrun is -3.  Brady and G -2.",
        "label": "NEU"
    },
    {
        "comment": "Oh shit…in my pants!!! GKG!!!!!",
        "label": "POS"
    },
    {
        "comment": "I just hope this team isn't this mid come playoffs",
        "label": "NEU"
    },
    {
        "comment": "Pietrangelo has become such a cunt since being traded.",
        "label": "NEG"
    },
    {
        "comment": "We just won another there pal",
        "label": "POS"
    },
    {
        "comment": "the sheer amount of benson friendly fire out there my god. somebody help him",
        "label": "NEU"
    },
    {
        "comment": "Not sure if it means anything but we have 5 losses on the season and in each of the 5 losses we've been absolutely shit pumped.",
        "label": "POS"
    },
    {
        "comment": "Wow that was dirty by Aho.  He totally tried to use the nudge from behind to sneak a cross check into Comrie's neck.",
        "label": "POS"
    },
    {
        "comment": "Haha I hear that, I had to do some bargaining. 😂Just had to rep the 509 and the our fellow Washingtonian for our first WC!",
        "label": "POS"
    },
    {
        "comment": "Petey has 4 PTS in the last 3 games, still somehow has 7 PTS in the last 10 games despite everybody knowing he isn't at his best And if you really want to go by points then, he's still 7th in the league for that - which is more than Matthews who currently sits at 30th. He literally is one of the highest scorers in the league Did we forget how Petey was 10th in points last year with 102 too? 9th if you want to go by P/GP? He had 2 points against the Devils and 2 points against the Flames. And yet, I keep seeing you say he's been invisible...but now you talk about how getting points means good games?",
        "label": "NEU"
    },
    {
        "comment": "Kampf > Ohtani",
        "label": "NEU"
    },
    {
        "comment": "My normal way of watching want working out. You saved the night. Thank you so much.",
        "label": "POS"
    },
    {
        "comment": "This was the nhl.com headline when they won 9, and it bugged the hell out of me that they chose it over “kings of the road”",
        "label": "POS"
    },
    {
        "comment": "Lol saw that coming for the past 15 minutes.  Been all Islanders since that Matthews goal.  Felt like they've lived in our zone since then.",
        "label": "POS"
    },
    {
        "comment": "fire pvs \"system\" into the sun...5-0 happened because the guys just played. and then all the judgement crept in. I get having discipline but no one performs under the threat of a benching or demotion. lift em up and stop dragging them down.",
        "label": "NEU"
    },
    {
        "comment": "Why try to draw a penalty? So that we can play worse and waste time?",
        "label": "NEU"
    },
    {
        "comment": "Holy shit we look like a good hockey team!",
        "label": "POS"
    },
    {
        "comment": "Pretty sure it's just for tonight.",
        "label": "NEU"
    },
    {
        "comment": "SATRUDAY",
        "label": "POS"
    },
    {
        "comment": "Yes I love the goal and I love Bratt and I love winning…but the Devils should just fucking slash and trip all they want the last minute of a tied game because it won't be called, we've seen it dozens of times",
        "label": "POS"
    },
    {
        "comment": "I think so too, they're just too raw",
        "label": "NEU"
    },
    {
        "comment": "I could get used to this",
        "label": "NEU"
    },
    {
        "comment": "Jack is really fighting it right now 😳",
        "label": "POS"
    },
    {
        "comment": "I'll get it back in a few years when I have enough to reimburse myself via HSA. Then use that 5k on a new car down payment.",
        "label": "POS"
    },
    {
        "comment": "I like that in French, D'Accord's name reads as \"Joey? Sure is.\"",
        "label": "POS"
    },
    {
        "comment": "I feel bad that kaprizov has to play with some absolute bricks on Minnesota",
        "label": "NEG"
    },
    {
        "comment": "HahahahEasiest goal he'll ever score",
        "label": "POS"
    },
    {
        "comment": "We have got to score on these breakaways",
        "label": "POS"
    },
    {
        "comment": "He was with bedard. And was a liability unfortunately.",
        "label": "NEG"
    },
    {
        "comment": "Preach! I think none of us would be upset if they played hard in every loss they had, the thing is they don't besides the rangers one, that one they worked very hard in but other than that this was another C- performance without the W",
        "label": "POS"
    },
    {
        "comment": "Kraken don't give an answer goal challenge, level: impossible",
        "label": "NEG"
    },
    {
        "comment": "They would never ;)",
        "label": "NEU"
    },
    {
        "comment": "They need all the advertising they can get. Recruiting is pretty scarce right now. Heh.",
        "label": "NEU"
    },
    {
        "comment": "Wtf does Boston have to do to get a penalty called against them?",
        "label": "NEU"
    },
    {
        "comment": "That playoff series when Cloutier got hurt still pisses me off lol",
        "label": "NEG"
    },
    {
        "comment": "JOSEPH WOLL",
        "label": "NEU"
    },
    {
        "comment": "Fuck off sammy",
        "label": "NEG"
    },
    {
        "comment": "Why the fuck would you want the opposing team fans to show life Pants? Come on dude...",
        "label": "NEG"
    },
    {
        "comment": "#INJECT THAT SHIT RIGHT INTO MY VEINS",
        "label": "NEG"
    },
    {
        "comment": "Lmao have fun being a little bitch",
        "label": "NEG"
    },
    {
        "comment": "He poked the bear and paid for it…",
        "label": "NEG"
    },
    {
        "comment": "Jeff Skinner will never play in a playoff game unfortunately",
        "label": "NEG"
    },
    {
        "comment": "WHAT A FEED FROM YANNI",
        "label": "POS"
    },
    {
        "comment": "what doesn't rielly understand about giving the goalie the shooter on a 2 on 1!?!! it's so stupid to watch",
        "label": "NEG"
    },
    {
        "comment": "If they play like tonight all the time they would be above 500. Goalies can steal a game and that's what Woll did. Leaf goals weren't pretty but that's what happens when you're controlling the play and Forsberg gets cold.",
        "label": "NEU"
    },
    {
        "comment": "Went to my first Caps practice today for morning skate. Guess I fired the boys up",
        "label": "NEU"
    },
    {
        "comment": "Missed this game. What went wrong?",
        "label": "NEU"
    },
    {
        "comment": "This team is something else, I wasn't even scared down 2-0",
        "label": "NEU"
    },
    {
        "comment": "Dude can't make a quick decision with the puck to save his fucking life.It's either one timer to the chest, or a giveaway.",
        "label": "NEG"
    },
    {
        "comment": "Sabres vs Montreal since 2018-19:8-5-1, 3.57 GFPG, 3.14 GAPG, 30.8% PP, 90% PK.Skinner 14GP 13G 11A 24PTuch 6GP 1G 7A 8PThompson 8GP 5G 3A 8P",
        "label": "NEU"
    },
    {
        "comment": "C'mon Wild, I even wore my wild socks today",
        "label": "NEU"
    },
    {
        "comment": "Me: \"Surely they'll talk about the game and show some highlights.\"  ESPN: \"**PATRICK KANE** **PATRICK KANE**  **PATRICK KANE**  Me: \"of course...\"",
        "label": "POS"
    },
    {
        "comment": "Wheeler needs to sit. He can't do anything.",
        "label": "NEG"
    },
    {
        "comment": "Morning skate was only Quick and Jones, so Igor looks to be in tonight and Quick tomorrow.",
        "label": "NEU"
    },
    {
        "comment": "Feels so good too see our little slovak boy grew up so fast",
        "label": "POS"
    },
    {
        "comment": "#3rd Period Olde Tyme Hockey is Coming",
        "label": "NEU"
    },
    {
        "comment": "What the fuck??? That was obviously too high. I have no idea what they looked at there.",
        "label": "NEG"
    },
    {
        "comment": "Yes.  Annoying as fuck",
        "label": "NEG"
    },
    {
        "comment": "I'll be there tonight! My lifetime record of watching the boys in person is 0-11-1. I'm so sorry for what is about to happen.",
        "label": "POS"
    },
    {
        "comment": "This team is lacking so much fire. No drive to win. No one cares. No grit or emotion on the ice. Looks like a bunch of ice cubes melting out there. So frustrating to see another last place team showing they won't give up  when it seems we have. Something has to change for this team to wake up.",
        "label": "NEG"
    },
    {
        "comment": "Dude can eat shit.  Biggest POS in the league.",
        "label": "NEG"
    },
    {
        "comment": "Keep Chara Jr. in the lineup….",
        "label": "NEU"
    },
    {
        "comment": "He had a crap year last year but he's not horrible.",
        "label": "NEG"
    },
    {
        "comment": "Fuck yeah! Looks like Armia really needed that stint in Laval",
        "label": "POS"
    },
    {
        "comment": "Actually saw some people criticizing Lavy for the lack of structure last night.  We are on three different coaches with this core group of guys ladies and gentlemen.  MAYBE IT'S THE PLAYERS!",
        "label": "NEU"
    },
    {
        "comment": "FILIP \"EUROPEAN BASEBALL\" GUSTAVSSON DOES IT AGAIN",
        "label": "POS"
    },
    {
        "comment": "Nylander's price keeps dropping. A couple more games like this and we could afford McDavid also.",
        "label": "NEU"
    },
    {
        "comment": "Marner you're a fucking beauty",
        "label": "POS"
    },
    {
        "comment": "Yea huska really seems like he hates pospisil for some reason he got like 5 and a half minutes of ice time",
        "label": "NEU"
    },
    {
        "comment": "Struble > McDavid.",
        "label": "NEU"
    },
    {
        "comment": "Much like some of the fans in here, the team needs to learn some emotional balance and consistency.",
        "label": "NEG"
    },
    {
        "comment": "To this day, Patrick Stefan is ashamed of himself.",
        "label": "NEG"
    },
    {
        "comment": "Dickie's hat trick was fun. I'll give you that.",
        "label": "NEG"
    },
    {
        "comment": "So they have established what doesn't work on the PP. Now to try a different approach",
        "label": "NEU"
    },
    {
        "comment": "Haven't seen too many tough saves",
        "label": "NEG"
    },
    {
        "comment": "YESSSSSSSSSSSSSSSSS",
        "label": "POS"
    },
    {
        "comment": "Man I'm totally in love with him!!",
        "label": "POS"
    },
    {
        "comment": "And that was the first regulation road loss for the LA Kings.",
        "label": "NEG"
    },
    {
        "comment": "Why? They played a near flawless game. Only took one penalty all night. The Kings were just swarming them. It was such a beautiful sight to see.",
        "label": "POS"
    },
    {
        "comment": "Download the SportaDay app. The radio feed is on there.",
        "label": "NEU"
    },
    {
        "comment": "Pay him some of Huberdeaus",
        "label": "NEU"
    },
    {
        "comment": "Sunny for mvp",
        "label": "NEU"
    },
    {
        "comment": "I still find myself overly nervous in the last minute of each period!",
        "label": "NEG"
    },
    {
        "comment": "FUCK. We need to do something. I want to push legislation to ban gambling ads during sports events.",
        "label": "NEG"
    },
    {
        "comment": "That's also what I saw. This is probably the worst officiated game I can remember.",
        "label": "NEG"
    },
    {
        "comment": "This 84 has been nothing but noticeable all night man",
        "label": "NEU"
    },
    {
        "comment": "lol we all loved him a day ago",
        "label": "POS"
    },
    {
        "comment": "The “Jersey” Jersey is so fucking ugly",
        "label": "NEG"
    },
    {
        "comment": "It's ok. This is just setting up a Boeser empty netter.",
        "label": "NEU"
    },
    {
        "comment": "Not a cookie, but I make 4” mini apple pies every Christmas and they are so, so good",
        "label": "POS"
    },
    {
        "comment": "It's 25% in something that should be a coin flip. In most of the shootout games we won it was because our goalie was perfect and we managed to score one.",
        "label": "NEU"
    },
    {
        "comment": "Weegs better retire in Calgary. Guy is an absolute stud. Makes some funny ass plays sometimes but the guy has a fucking clutch shot.",
        "label": "NEG"
    },
    {
        "comment": "Armia was our best forward tonight. For once MSL did an in-game adjustment based on real time play. Loved it.",
        "label": "POS"
    },
    {
        "comment": "Moral victory for limiting the Oilers to four goals with four rookies on the backend lol",
        "label": "POS"
    },
    {
        "comment": "How fckin smart is alex debrincat not resigning to this complete shitshow. big brain move.",
        "label": "POS"
    },
    {
        "comment": "LOL thanks!",
        "label": "POS"
    },
    {
        "comment": "Yes! Yes! Yes!!!!!!",
        "label": "POS"
    },
    {
        "comment": "Goodnight everyone.",
        "label": "POS"
    },
    {
        "comment": "Unfortunate result, and i know this sub is going to lose its mind over the OT goal, but it was an awkward 3v3 play with tired guys on the ice. Overall really exciting game, and i was there in person!Also shoutout to my wife for her *impeccable* timing: wife: \"they *never* lose when i go to a game with you!\"*bruins score 5 seconds later*🫤",
        "label": "NEU"
    },
    {
        "comment": "How is this team getting worse ?",
        "label": "NEG"
    },
    {
        "comment": "Johnny B is a mess in the Dzone but on his edges in the Ozone; for a guy who likes to shoot, he doesn't score much at this level.  But he has the wheels to keep up with 20&93",
        "label": "NEU"
    },
    {
        "comment": "Dipeitro isn't even in the top 10.",
        "label": "NEG"
    },
    {
        "comment": "KREIDONG!!!!",
        "label": "POS"
    },
    {
        "comment": "Are they making a push for the playoffs?",
        "label": "POS"
    },
    {
        "comment": "They set the tone… we need more speed. Good defence for Vegas tho.",
        "label": "POS"
    },
    {
        "comment": "Oh no Norris",
        "label": "NEG"
    },
    {
        "comment": "THANK YOU! This team seriously needs to consider dumping assets and trying another rebuild with a better core. Imagine the return you could get for Giroux.",
        "label": "POS"
    },
    {
        "comment": "It's hilarious lmao",
        "label": "POS"
    },
    {
        "comment": "I thought Debrincat was going to be our next captain but I think Vlasic should be here for awhile. He's a local kid and our best defenseman this season, imo.",
        "label": "NEU"
    },
    {
        "comment": "His first goal in 15 games. I'm glad we could give that to him. But like, can we not?",
        "label": "POS"
    },
    {
        "comment": "Rams got a dub so let's go get one",
        "label": "POS"
    },
    {
        "comment": "Come on Demmer",
        "label": "POS"
    },
    {
        "comment": "Softie",
        "label": "NEU"
    },
    {
        "comment": "To think we were better with Holl in the lineup. We need Holl and Will. Lol",
        "label": "NEU"
    },
    {
        "comment": "Rig actually grabbed someone for once",
        "label": "NEU"
    },
    {
        "comment": "They are not playing “winning” hockey, despite still winning quite a few games.",
        "label": "NEG"
    },
    {
        "comment": "who are these boys ? my jackets?!",
        "label": "NEU"
    },
    {
        "comment": "What's the deal with Mahura?",
        "label": "NEU"
    },
    {
        "comment": "Don't care enough to boo, a terrible prognostic sign",
        "label": "NEG"
    },
    {
        "comment": "Haha let's go Josh",
        "label": "POS"
    },
    {
        "comment": "Hope Zadorov can take over “laying out guys” so that Petey can focus on playmaking and scoring.",
        "label": "NEU"
    },
    {
        "comment": "Mang so snake bitten he can't even beat the MT.",
        "label": "NEG"
    },
    {
        "comment": "Refs suck. Regardless Toronto deserved the win.",
        "label": "NEG"
    },
    {
        "comment": "Good PP despite the mistakes. Chances were there",
        "label": "POS"
    },
    {
        "comment": "Kyrou made the most costly turnover of his career. RIP Chief",
        "label": "NEG"
    },
    {
        "comment": "Honestly if Beniers can score today I'll be happy",
        "label": "POS"
    },
    {
        "comment": "Let's fucking goooo",
        "label": "POS"
    },
    {
        "comment": "There's certainly that, but I think we need to start with being anything resembling a “team” first. A lot of teams are way better, but almost all teams would address a top player getting his head knocked off the boards, and we don't. Not saying it's the reason we lost, either, it's just true",
        "label": "NEU"
    },
    {
        "comment": "NICOOO BABYYY",
        "label": "POS"
    },
    {
        "comment": "Murphy taking some big hits tonight",
        "label": "NEU"
    },
    {
        "comment": "This is the penalty we don't need",
        "label": "NEU"
    },
    {
        "comment": "Game winning goals are generally considered more important.",
        "label": "NEU"
    },
    {
        "comment": "Even canadiens broadcast can't believe it. NHL is garbage",
        "label": "NEG"
    },
    {
        "comment": "Jakey stay in the blue paint",
        "label": "NEU"
    },
    {
        "comment": "Danforth just hustles all the time!!!",
        "label": "POS"
    },
    {
        "comment": "Can we not turtle please?",
        "label": "NEU"
    },
    {
        "comment": "that was fucking beautiful",
        "label": "POS"
    },
    {
        "comment": "Lets hope Tocc and Myers found the time to walk around Stanley Park before this game",
        "label": "POS"
    },
    {
        "comment": "Sleeper agent Eller",
        "label": "NEU"
    },
    {
        "comment": "WTF ARE KIDDING ME?",
        "label": "NEG"
    },
    {
        "comment": "Lol! I gotcha... Sorry, I thought a Maple Leaf fan wandered in here to talk smack...Go Kings Go!!",
        "label": "POS"
    },
    {
        "comment": "Ew I hate this so it must be very accurate",
        "label": "NEG"
    },
    {
        "comment": "HOnestly, that was a great penalty for Dumoulin to take.  I mean, the dude was in serious danger of skating out of the offensive zone had Dumo not done that.",
        "label": "POS"
    },
    {
        "comment": "What in the actual hell..?!",
        "label": "NEG"
    },
    {
        "comment": "We're lucky to only be down by 2. Everyone looked bad. No offense, porous defense, and shaky goaltending.",
        "label": "NEG"
    },
    {
        "comment": "Is the Matt Hatter going to make an appearance tonight??",
        "label": "NEU"
    },
    {
        "comment": "I honestly think that save should go to Scandella.",
        "label": "NEG"
    },
    {
        "comment": "Imagine we had a zary bedard Coronato line",
        "label": "POS"
    },
    {
        "comment": "I will miss things like being able to go see a team for 10-40$ with great sight lines and possibly too many places to get a cold one once the arena moves downtown. Shit during snowstorms I've scored 100s on the glass tickets for 5-50$ short notice a few times",
        "label": "POS"
    },
    {
        "comment": "I forgot he was on the kings for a moment",
        "label": "NEU"
    },
    {
        "comment": "The puck is coming off our blades like the ball comes off my club face at top golf",
        "label": "NEU"
    },
    {
        "comment": "Absolute heavyweight bought of baldies tonight",
        "label": "NEU"
    },
    {
        "comment": "What we should be doing with Laine too… but what do I know",
        "label": "NEU"
    },
    {
        "comment": "Does MSG  have them on demand or just the rewind broadcast?",
        "label": "NEU"
    },
    {
        "comment": "Hot goaltender? I mean I guess he's decent looking.",
        "label": "POS"
    },
    {
        "comment": "This team really became a joke as soon as the players were crying about the fans booing",
        "label": "POS"
    },
    {
        "comment": "On a personal level, I hope Reaves recovers quickly. But from a roster standpoint, the truth is that I feel like “oh no, anyway…”",
        "label": "NEU"
    },
    {
        "comment": "Beast mode play by Erickson Ek",
        "label": "POS"
    },
    {
        "comment": "It will be better for you in the long run. 🫁",
        "label": "POS"
    },
    {
        "comment": "Respect but boooo",
        "label": "POS"
    },
    {
        "comment": "CALL THAT ONE BACK YOU STRIPED FUCKS",
        "label": "NEG"
    },
    {
        "comment": "Split a new TV for the household between two of my brothers. Got a really high quality 65\" TV for like $600 bucks. That's after taxes and the extended warranty too.If I was still working, I'd likely buy a TV for everyone I know, lmao. You can get like a 24\" Samsung with all the bells and whistles for like $50 bucks, man. I've spent more than that on Lego for my nieces! Should have just got them a TV!",
        "label": "NEU"
    },
    {
        "comment": "Elvis has been on an absolute tear lately it's so nice to see him back in form this year",
        "label": "POS"
    },
    {
        "comment": "#FUCK MARK STONE",
        "label": "NEG"
    },
    {
        "comment": "It's almost official - we're a defensive juggernaut bois….🤣",
        "label": "POS"
    },
    {
        "comment": "Benson and Peterka have been our most consistent forwards all season (when healthy). The fact that they need to be on Cozens' line for him to look good is troubling.",
        "label": "POS"
    },
    {
        "comment": "We finally beat Tampa!",
        "label": "POS"
    },
    {
        "comment": "I'm gonna float you an upvote but Jesus man",
        "label": "POS"
    },
    {
        "comment": "I was guilty of this, and even mid-season I made a comment about it, but after tonight and seeing how consistent Wedgewall has been, I've completely rethought that idea. He can only do so much with the D in front of him, but generally this season he hasn't really let games get away from him. All hail the Wedgewall!",
        "label": "POS"
    },
    {
        "comment": "I fucking love Zary",
        "label": "POS"
    },
    {
        "comment": "OH MY GOD THEY DIDNT BLOW IT",
        "label": "NEG"
    },
    {
        "comment": "Missed the game but just rewatched the goals. That 4th one is on chychrun. Screening his goalie being super lazy. This guy needs a wake up call.",
        "label": "NEU"
    },
    {
        "comment": "Bonino is sloooow lol",
        "label": "NEG"
    },
    {
        "comment": "This game has been mid as fuck",
        "label": "NEG"
    },
    {
        "comment": "Not even shocked",
        "label": "NEG"
    },
    {
        "comment": "Anyone know where Hrudey is?",
        "label": "NEU"
    },
    {
        "comment": "Definitely can't have both gotta trade one of them for sure!Idiot",
        "label": "NEU"
    },
    {
        "comment": "I do NOT come in peace!! Pillage and burn, baby!",
        "label": "NEG"
    },
    {
        "comment": "The more I look at the good defensive play from slaf and his face off percentage (which is good without special training) the more I think he should be a center.But don't listen to me, I'm drunk.",
        "label": "NEG"
    },
    {
        "comment": "Say what you want about the rest of the team but 77 sure as hell isn't having a bad year",
        "label": "NEG"
    },
    {
        "comment": "are they playing Eiffel 65 >??????",
        "label": "NEG"
    },
    {
        "comment": "At the game..good showing from rangers fans tonight. We are asleep though with this offense!",
        "label": "POS"
    },
    {
        "comment": "> Ticket prices won't get any cheaper.They will if season ticket holders start to walk.I know a few people who are not big hockey fans and bought season tickets expecting that they could make back their money by selling most of the tickets (like they do with Mariners, Sounders, and Seahawks seats). But no one is making their money back on these seats.Instead of getting a discount for buying in bulk, season ticket holders are paying *above* market value in exchange for being locked in. Its a bad deal.",
        "label": "NEU"
    },
    {
        "comment": "\"WE DON'T NEED YOU JAAAHN\"",
        "label": "NEG"
    },
    {
        "comment": "I like them but I don't feel like we have a good win record when wearing them.",
        "label": "POS"
    },
    {
        "comment": "It wasn't just him. Take Hronek away from Hughes and he's just as bad. So many mistakes over the past few games",
        "label": "NEG"
    },
    {
        "comment": "I can see us easily losing the next 5 games in a row, B2b Seattle, Rangers, Leafs, Canes Redwings will probably pump us. And DJ still wont get fired.",
        "label": "NEG"
    },
    {
        "comment": "So hear me out. All we have to do is get up SIX goals and then we have the game on lock, right?",
        "label": "POS"
    },
    {
        "comment": "#VGK TAKE MY POWER PLAY ENERGY",
        "label": "POS"
    },
    {
        "comment": "Steamed assist and we have actual offense. Please finish if off if you are gonna give me hope",
        "label": "NEU"
    },
    {
        "comment": "Just tuned in. Love the score. Please tell me we've been playing with some fire in the belly…",
        "label": "POS"
    },
    {
        "comment": "desmith fucking owns us according to the stats so i am simply calling this game a wash. we're still so fucking back",
        "label": "POS"
    },
    {
        "comment": "Congrats to Zaitsev, is that his second goal of the year? Third?",
        "label": "POS"
    },
    {
        "comment": "Why of all of the D men does it have to have been Dumo with the best opportunity positions tonight when he doesn't have the offensive skills to really put them away lol",
        "label": "POS"
    },
    {
        "comment": "At the end of the last homestand, I thought it looked like they couldn't wait to get out on the road. Tonight it looks like they can't wait to get home.",
        "label": "NEG"
    },
    {
        "comment": "Best scoring in the league versus worse save percentage in the league. What could go wrong?",
        "label": "NEU"
    },
    {
        "comment": "Wow, I would not want to have to block a Toffoli slap shot",
        "label": "POS"
    },
    {
        "comment": "Samsonov's confidence gonna take a big hit after that.",
        "label": "NEU"
    },
    {
        "comment": "Since Thanksgiving we've lost 7 games in a row and possibly 4 starters, depending on Schultz and Grubauer. This is getting ridiculous. I don't even know what to say. See you tomorrow.",
        "label": "NEG"
    },
    {
        "comment": "Did that first Detroit goal ricochet off one of our guy's sticks? I'm at the game and didn't get a good look at the replay.",
        "label": "NEU"
    },
    {
        "comment": "All my homies hate Tom Wilson",
        "label": "NEG"
    },
    {
        "comment": "Praise Scorch!!",
        "label": "POS"
    },
    {
        "comment": "yesand happy cake day",
        "label": "POS"
    },
    {
        "comment": "Clean sheet thru 2!",
        "label": "POS"
    },
    {
        "comment": "Way to stay on that one Stephenson!",
        "label": "POS"
    },
    {
        "comment": "Christ what a team. Sick fucking shot",
        "label": "POS"
    },
    {
        "comment": "Cant wait for Okie to score a late goal when its all but over",
        "label": "POS"
    },
    {
        "comment": "LA lost in OT, a huge 3rd period Islanders comeback",
        "label": "NEG"
    },
    {
        "comment": "Guttman and Anderson should have been on the roster from day 1. They're hungry every game.",
        "label": "POS"
    },
    {
        "comment": "MEMO TO PASCAL VINCENT:  Your team has given up MULTIPLE goals in MULTIPLE games to MULTIPLE teams when they pull their goalie and come at you 6 on 5 with only a few minutes left in the game. Dedicate an entire practice, or 3 or 5, to just defending 6v5, and maybe, just maybe, trying to make the other team pay with an empty net goal ...",
        "label": "NEU"
    },
    {
        "comment": "That Fantilli kid....so hot right now!!!! 🥵🥵🥵🥵",
        "label": "POS"
    },
    {
        "comment": "FEED JAKE!",
        "label": "POS"
    },
    {
        "comment": "Atta boy huby! Playing to tank",
        "label": "POS"
    },
    {
        "comment": "Watched the Kraken's playoff run last season and their DJ is amazing",
        "label": "POS"
    },
    {
        "comment": "LA KINGS ML BIGGEST DONATION OF MY LIFE",
        "label": "POS"
    },
    {
        "comment": "(mats sundin voice)   yahncrooek",
        "label": "NEU"
    },
    {
        "comment": "bs call was a great play by Vlasic",
        "label": "POS"
    },
    {
        "comment": "Good sir he stepped into me. But sir HE stepped into ME!",
        "label": "POS"
    },
    {
        "comment": "Guhle 2 minutes for getting in Dahlin's way",
        "label": "NEU"
    },
    {
        "comment": "for the most part the fans are great but i somehow got stuck with the most annoying panthers fan right in front of me",
        "label": "NEG"
    },
    {
        "comment": "We can never have anything nice 🥲",
        "label": "NEG"
    },
    {
        "comment": "It's the hope that kills you",
        "label": "NEG"
    },
    {
        "comment": "ooooo rob wants in",
        "label": "NEU"
    },
    {
        "comment": "Huska pls just bench Dube. Or atleast get him off this line",
        "label": "NEG"
    },
    {
        "comment": "OT 10 mins 3v3 pls",
        "label": "NEU"
    },
    {
        "comment": "Another 100 push-up night, what else is new?",
        "label": "NEU"
    },
    {
        "comment": "Bieksa is such a clown. What a terrible take on cross checking a dude in the head.",
        "label": "NEG"
    },
    {
        "comment": "#I'M STILL STANDING",
        "label": "POS"
    },
    {
        "comment": "Send Soderblom back to Rockford.  This is ridiculous.  I just feel bad for him at this point.",
        "label": "NEG"
    },
    {
        "comment": "Yeah let's not show the obvious missed tripping call..Love the nhl",
        "label": "NEG"
    },
    {
        "comment": "Dowd with 2 goals and the GWG!!",
        "label": "NEG"
    },
    {
        "comment": "Hell of an effort Siegs",
        "label": "POS"
    },
    {
        "comment": "What is Ian Cole doing on that play my god man",
        "label": "NEU"
    },
    {
        "comment": "Technical issues? Kinda surprised they fucked up that bad.",
        "label": "NEG"
    },
    {
        "comment": "The Minnesota Mild featuring Patrick \"Big Dummy\" Maroon",
        "label": "NEU"
    },
    {
        "comment": "I've only been watching since 2021 so I don't have any emotional connection to this that most of you do but it's really cool seeing all these clips and learning a bit about the teams past!",
        "label": "POS"
    },
    {
        "comment": "Honestly zadorov shuffles things around enough where it should be fine for now. Not having to rely on Cole as a second line person gives him room to breathe",
        "label": "POS"
    },
    {
        "comment": "Garden is poppin. Good crowd tn",
        "label": "POS"
    },
    {
        "comment": "Under Armstrong the Blues have more wins than any other Western Conference team, they've won the franchise's first Cup, and were perennial contenders for over a decade. Teams can't contend forever. There needs to be a reset period eventually. Why this is so hard to understand for so many in this sub truly baffles me. The Blues not being good now doesn't condemn Armstrong, and it's wild to see people complaining about him. The view/expectations need to be geared towards the future. This is absolutely not a win-now team.If people would just come to terms with reality and realize that the team is/should be mid-reset, they'd see that Armstrong has them in a position now to build a contender again within the next ~3 years, which is far better than the alternative of a full tear-down + rebuild that other teams have gone through that can take 7-10 years (or more for some teams).",
        "label": "NEU"
    },
    {
        "comment": "Bro gunna pop a vein",
        "label": "NEU"
    },
    {
        "comment": "to be fair the cozens quinn combo was really strong",
        "label": "POS"
    },
    {
        "comment": "I'm so pumped for the future. Now to not fuck it up haha",
        "label": "POS"
    },
    {
        "comment": "It's really embarrassing.",
        "label": "POS"
    },
    {
        "comment": "What a fuckin bounce",
        "label": "POS"
    },
    {
        "comment": "Puck meets pad pose",
        "label": "POS"
    },
    {
        "comment": "It's there for me on SNP. I'm in Vancouver.",
        "label": "NEU"
    },
    {
        "comment": "I love you Woll",
        "label": "POS"
    },
    {
        "comment": "How is Huberdeau not benched? Just seeing him out there makes me angry.",
        "label": "NEG"
    },
    {
        "comment": "Instead of pulling the goalie they should try pulling the coach.  I actually think these guys might be better with no coaching rn",
        "label": "NEG"
    },
    {
        "comment": "Calgary out shooting us but the Gus Bus is not taking any PassengersEdit: this period",
        "label": "NEU"
    },
    {
        "comment": "Lower body injury !",
        "label": "NEU"
    },
    {
        "comment": "5 fucking minutes!?!?!?!? Game",
        "label": "NEU"
    },
    {
        "comment": "Yes, DSP said his gear didn't make it.",
        "label": "NEU"
    },
    {
        "comment": "Send this team to the sun. How the fuck are they STILL this bad ????",
        "label": "NEG"
    },
    {
        "comment": "Some notes:Hayes is a total locker room savior. You can see how he celebrates harder than everyone else and is always last on the ice high fiving guys. Neighbours is playing feisty, I saw him grind out a good chance, take a late hit by Pietrangelo, then follow him around chirping him (and then Stone) after 🤣I like the bottom line production. I love Parayko contributing. Love the defense guys playing well. Not really happy the top end offense couldn't play off of the absolute platter of a performance Binner gave them",
        "label": "NEU"
    },
    {
        "comment": "#PAPI STRIKES TWICE",
        "label": "NEU"
    },
    {
        "comment": "Where are the clowns saying Wolf wasn't looking good enough??",
        "label": "NEG"
    },
    {
        "comment": "Torts",
        "label": "NEG"
    },
    {
        "comment": "Half assedly watched today's game, missed the third period for the Seattle game. But it for sure feels like we're giving up less odd man rushes/breakaways",
        "label": "NEG"
    },
    {
        "comment": "Big PP time let's tie it up.",
        "label": "POS"
    },
    {
        "comment": "It hasn't been an effective shot in what feels like a decade but I fucking love it when guys just let a clapper rip on the rush",
        "label": "POS"
    },
    {
        "comment": "They're saying Boo-abres.",
        "label": "NEG"
    },
    {
        "comment": "Please score a goal.",
        "label": "POS"
    },
    {
        "comment": "Go Kings Go! For more discussion consider [joining the /r/LosAngelesKings discord as well.](*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/losangeleskings) if you have any questions or concerns.*",
        "label": "POS"
    },
    {
        "comment": "It's not hard to understand why they are so delusional when the league, media and other fanbases have been fluffing them for the last decade",
        "label": "NEU"
    },
    {
        "comment": "HE IS HIM",
        "label": "POS"
    },
    {
        "comment": "Fucking finally",
        "label": "POS"
    },
    {
        "comment": "ROBBED.",
        "label": "POS"
    },
    {
        "comment": "Believe in the crown 👑",
        "label": "POS"
    },
    {
        "comment": "Pierre Houde described it as most spectacular of his career. That's a bit exaggerated I think. I seem to remember one going 12 rounds in Markov / Desharnais era.",
        "label": "POS"
    },
    {
        "comment": "Lots of whistles",
        "label": "NEU"
    },
    {
        "comment": "lol what the hell was Vladar doing there",
        "label": "NEG"
    },
    {
        "comment": "Lmfao now I'm the one crying",
        "label": "NEG"
    },
    {
        "comment": "Am I getting a Holtz jersey?  What do we think folks",
        "label": "NEG"
    },
    {
        "comment": "Sorry. Meant Texier",
        "label": "NEG"
    },
    {
        "comment": "Trocheck is the best shit-stirrer",
        "label": "NEG"
    },
    {
        "comment": "This should create excitement but all I know is that the Flames just lost 2 minutes to score. #deadPP",
        "label": "POS"
    },
    {
        "comment": "I know it's a small sample size but until Dach is back I don't want to see Cole,Suzy, and Slaf broken up!",
        "label": "POS"
    },
    {
        "comment": "And the refs have called another incorrect penalty, as is tradition.",
        "label": "NEG"
    },
    {
        "comment": "That's a way to turn things around boys, good W and strong finish",
        "label": "POS"
    },
    {
        "comment": "We just need a few good ol', meat and potatoes boys from Northern Ontario in our roster.",
        "label": "NEU"
    },
    {
        "comment": "If they didn't make the change after that Panthers game, no way it happens in the month of December!",
        "label": "NEG"
    },
    {
        "comment": "Fuuuuuuuuuuck",
        "label": "NEG"
    },
    {
        "comment": "Jeff Friesen",
        "label": "NEU"
    },
    {
        "comment": "Those boos and chants hoping for a penalty because Gaudreau grabbed Kopi's stick and pulled it towards him are dumb.",
        "label": "NEG"
    },
    {
        "comment": "Love the front row Oilers Suck jersey chirping any Canuck that gets within 5 feet.",
        "label": "POS"
    },
    {
        "comment": "Yup exactly. Lots of doom and gloom in here tonight but that was a solid game. Keep playing that way and success will come (also please fix the damn power play)",
        "label": "POS"
    },
    {
        "comment": "Probably a line change and he wasn't able to get off, it happens but fuck man normally when your teammate has the puck you give him space regardless of who it is lol",
        "label": "NEG"
    },
    {
        "comment": "I hope not, it's my once yearly in-person game",
        "label": "NEG"
    },
    {
        "comment": "WE DID IT EVERYONEWE GOT TO SEE DRIEDGER HUG JOEY AFTER HIS FIRST NHL SHUTOUTAAAAAAAAAAAAA",
        "label": "POS"
    },
    {
        "comment": "Hat tricks for both who says no?",
        "label": "NEG"
    },
    {
        "comment": "I am unable to watch the game, but score seems not good. What does the eye test say?",
        "label": "NEG"
    },
    {
        "comment": "[Why do you think I'm a Coyotes fan😗](",
        "label": "NEU"
    },
    {
        "comment": "God Kadri's a hunk",
        "label": "NEU"
    },
    {
        "comment": "Give wolf the assist you cowards",
        "label": "NEU"
    },
    {
        "comment": "Right shoulder popped, it got pulled two different ways while he was trying to brace himself",
        "label": "NEU"
    },
    {
        "comment": "Fuck my stupid life",
        "label": "NEG"
    },
    {
        "comment": "I want to see Willy go berserk tonight!!!",
        "label": "POS"
    },
    {
        "comment": "This team has no confidence and it shows.",
        "label": "NEG"
    },
    {
        "comment": "Shorty saying one of our player's name and then immediately saying \"missed the net\" gets me every time.",
        "label": "NEU"
    },
    {
        "comment": "That was brilliant 😂",
        "label": "POS"
    },
    {
        "comment": "Man…",
        "label": "NEG"
    },
    {
        "comment": "This is the front end of a back-to-back actually",
        "label": "POS"
    },
    {
        "comment": "Our Stone needs to go tune his brother",
        "label": "NEU"
    },
    {
        "comment": "Man we're just like the cops from Blues Brothers tonight",
        "label": "NEU"
    },
    {
        "comment": "Love to see it",
        "label": "POS"
    },
    {
        "comment": "Win-win for both sides. We'd have done well with Stütztle but whether he'd be a long term great fit for our system is a big if - meanwhile we got bigger, faster Kopi, [who is a Top 10 King of all time].",
        "label": "POS"
    },
    {
        "comment": "I'd rather see hogs continue to develop in the bottom 6 for now.",
        "label": "POS"
    },
    {
        "comment": "You can just grab Boldy by the collar now?",
        "label": "POS"
    },
    {
        "comment": "Your best player should be on the top line, not your hardest, working ones. That's why Jody Shelley was never on the top line.",
        "label": "POS"
    },
    {
        "comment": "Dude works hard every shift, in front of the net and almost got that goal, and was exactly what that Blue Jackets fan said about missing on breakaways but being speedy",
        "label": "POS"
    },
    {
        "comment": "I like how Middsy has like a Canadian southern drawl lol",
        "label": "POS"
    },
    {
        "comment": "It was never a bad signing. He's definitely playing above a 3M value rn tho",
        "label": "NEG"
    },
    {
        "comment": "KAMMPPFF",
        "label": "NEU"
    },
    {
        "comment": "PING",
        "label": "NEU"
    },
    {
        "comment": "THIS KID IS ON FIRE",
        "label": "POS"
    },
    {
        "comment": "HOGLANDER CAP HIT $1.1 MOTHER FUCKERS",
        "label": "NEG"
    },
    {
        "comment": "Oh fucking brutal to let Vlasic get in",
        "label": "NEG"
    },
    {
        "comment": "Cut provorov, dogshit player",
        "label": "NEG"
    },
    {
        "comment": "Defense is trending upwards. Hopefully we can keep it up against the Oilers. It'll be tough on a back to back against a hot Oilers team, so it will be a good test.",
        "label": "POS"
    },
    {
        "comment": "We got a shorty!!!",
        "label": "POS"
    },
    {
        "comment": "I love the chrome helmetsEdit: mah bad",
        "label": "POS"
    },
    {
        "comment": "That hit was 3 business days late bro",
        "label": "NEU"
    },
    {
        "comment": "Loser mentality man, isles fan first leafs second so I'm happy",
        "label": "NEG"
    },
    {
        "comment": "Ovechkin is definitely dealing with something whether if it's physical or mental",
        "label": "NEU"
    },
    {
        "comment": "What a fucking hit",
        "label": "NEG"
    },
    {
        "comment": "I stand corrected.",
        "label": "POS"
    },
    {
        "comment": "Money.",
        "label": "NEU"
    },
    {
        "comment": "We looked drunk tonight",
        "label": "NEG"
    },
    {
        "comment": "that was gorgeous! let's go another 2-0",
        "label": "POS"
    },
    {
        "comment": "The Booing of Kyrou seems a little nuts to me.  I get that people are angry about what he said, but this kind of response is exactly how you destroy the relationship with a player and the city.   Kyrou literally did nothing wrong.  Even Tarasenko never got booed like this.Do people want him to request a trade and put Army in a situation where we get pennies on the dollar, and then he goes somewhere else and dominates year after year?This just seems really unlike us as a city.  Just my $0.02.",
        "label": "NEU"
    },
    {
        "comment": "Thank you Creed.",
        "label": "POS"
    },
    {
        "comment": "Even Caley is regressing, man. Fuck this season.",
        "label": "NEG"
    },
    {
        "comment": "How does that not go in.",
        "label": "NEG"
    },
    {
        "comment": "They look so fresh and clean 😍Just gotta get those in",
        "label": "POS"
    },
    {
        "comment": "They mentioned ice problems early in the first and then didn't really bring it up again. The ice did look a little grippy last night and I noticed pucks were dying quickly. Wonder if that had anything to do with it.",
        "label": "NEU"
    },
    {
        "comment": "Radio said 96mph",
        "label": "NEU"
    },
    {
        "comment": "Ok their faces look so bored on the bench.",
        "label": "NEG"
    },
    {
        "comment": "The acting is subpar, to say the least.",
        "label": "NEG"
    },
    {
        "comment": "It's almost like he actually knows how to make real adjustments",
        "label": "POS"
    },
    {
        "comment": "How in the cinnamon toast fuck does Kelly get a penalty for that?! was he getting into it after the whistle or something? Ain't no way he's at fault for the Larkin hit",
        "label": "NEG"
    },
    {
        "comment": "Trip and an elbow to the back of the head on caufield. Wtf is going on",
        "label": "NEG"
    },
    {
        "comment": "Marner is such a princess. He's pissing me off",
        "label": "POS"
    },
    {
        "comment": "Management pretty much said the playoffs were a coin flip going into this season too. They know this roster isn't \"it\" and has flaws. The blueline isn't good enough, an actual contending team wouldn't have PDG (as cool as it's been for him) in its top 6. That's not exactly a hot take.",
        "label": "NEU"
    },
    {
        "comment": "Once he gets the finishing down he's gonna have some highlight reel goals, that was nasty lol",
        "label": "NEG"
    },
    {
        "comment": "Oh man I thought reino had it",
        "label": "POS"
    },
    {
        "comment": "Big money big money big money 🤞🏻",
        "label": "POS"
    },
    {
        "comment": "Just take hitting out of the game at this point",
        "label": "NEU"
    },
    {
        "comment": "Wins faceoff…immediately skates it offside 🤣",
        "label": "POS"
    },
    {
        "comment": "I agree that stomping a struggling team doesn't mean much, but we have also had some good games against good teams. Lots of work to be done, but the potential is there. I'd wager a second round exit is optimistic for this season, but I think we at least make the playoffs, which would be huge for this group. They still don't really know what they're up against I think, and you kinda have to learn the hard way, especially if you want to be a  consistent contender. I'd honestly rather they get stomped in the first round and realize that they need to step it up, than go on some magical run and come into next season thinking they've got it all figured out",
        "label": "NEU"
    },
    {
        "comment": "\"Blues at full strength, happened rarely in this period\"lmao why are our announcers like this",
        "label": "POS"
    },
    {
        "comment": "That was funny.. lol",
        "label": "POS"
    },
    {
        "comment": "You know, despite Berube and Kyrou having a tense relationship at times, and no matter what you think about Kyrou at the moment, (I for one am disappointed in his comment but won't boo him), Chief still believed in him and wanted the best for him. Knowing the kind of coach Chief is, he still wants to see him be successful and probably hopes the new coach can awaken the kyrou that's worth that contract. I just sincerely hope he knows what it means to wear that blue note. I would like to see him succeed and mature.",
        "label": "NEU"
    },
    {
        "comment": "Boys are lucky to only be down 1. They look lethargic and uninterested.",
        "label": "NEG"
    },
    {
        "comment": "[Chinny 2md Goal](",
        "label": "NEU"
    },
    {
        "comment": "Yeah he didn't deserve a mid-season firing, especially since we're floating around .500. If they wanted him out at the end of the season, fine, but your only cup winning coach in franchise history deserves better.",
        "label": "NEU"
    },
    {
        "comment": "What's our track record with previous talents in the last 10 years?",
        "label": "NEU"
    },
    {
        "comment": "lol me too! the visual in my head was pretty funny",
        "label": "POS"
    },
    {
        "comment": "It's actually making it to the net at least",
        "label": "POS"
    },
    {
        "comment": "Well that's enough of that I guess",
        "label": "POS"
    },
    {
        "comment": "My prophetic vision has increased in definition my friends, I look upon the visage of the duck. The beak begins to part, in the distance I can make out a word “supreme”. Could it be",
        "label": "POS"
    },
    {
        "comment": "Before the kings game a couple weeks ago I said I was going to do 20 push-ups for every goal the blues allow the rest of the year. This shit is NOT FUN.",
        "label": "NEG"
    },
    {
        "comment": "Love me some flower but someone has to go fall on him accidently on purpose. He's been too aggressive and we have to get him off his game somehow.",
        "label": "NEG"
    },
    {
        "comment": "I can't stand watching this team this year.",
        "label": "NEG"
    },
    {
        "comment": "Post game Jake Allen: I shit",
        "label": "NEG"
    },
    {
        "comment": "Myers zadorov pairing is way too clumsy.  I know most of that is myers but still...  split em up",
        "label": "POS"
    },
    {
        "comment": "Fucking Goose",
        "label": "NEG"
    }
]