[
    "Obviously would have liked them to win all four, but 2-2 for the road trip is solid. If they can do that the rest of the way and make the X a fortress, we'll be alright.",
    "Just said to my buddy during the last game I'm glad LaPanta has stopped using “squirt” a million times a game and there he goes, squirting again",
    "That's what I'm hoping",
    "Year three of this group. This group isn't responsible for the first 10 years.",
    "If Panarin completes the hatty I will become pneuma",
    "Fun fact: I bought a Good Eats cookbook from Half priced books yesterday, and it's signed by Alton Brown.",
    "Big comeback late in the 3rd but to fall short 5-3 final.",
    "Hey guys, what'd I miss?",
    "Those Hughes brothers are at it again",
    "Hey its 1-1 you titfuckers",
    "As good as vancouver has been this year, looking at their schedule theyve had a lot of games against the cellar dwellers in their division - anaheim, seattle, and san jose. Hopefully not as good tonight as theyve looked so far this year",
    "Y'all are gonna destroy the crackin, just like last year (thank you for that). 🫂",
    "Every now and then there are just games that get COMPLETELY FUCKED by the refs. This is one of those. Not that we played great, but it was 5 v. 8 tonight, boys.",
    "Lol you are like 6 of the last 10 comments in a live thread",
    "I'm more confident with Jones in net than Samsonov. My God, he is so bad.",
    "I miss the alien version of petey.",
    "I fell asleep during the 3rd 😴",
    "and i have nothing against you either.",
    "They're just not used to that Central Time change, so they're extra tired /s",
    "Worst case go to nhlwebcast . c o m",
    "Just please don't look as shitty as we did Thursday night. &#x200B;Go Preds!!",
    "It's coming back has to",
    "Ya I've been in the room before and they all hate each other and don't even get naked around each other",
    "The game wasn't even over yesterday and there was a season is over thread.Brady is justifiably fired up by a greasy play that could have seriously injured him and people say he shouldn't be captain, we should give it to Chabot instead, because a number of subjective things they don't like about him and subjective definitions of what a captain should do and stand for.Brady is a great captain, including standing up to fans' booing. People forget he's a captain more for his teammates than emotionally-drained fans.",
    "That's probably the best way to put it. I love him, as we all do, which is why it's so painful to watch.",
    "WHAT THE FUCK!",
    "#BUCHY",
    "Everyone calm down…. Take your bipolar meds… You're ok... You're safe…",
    "I prefer when we make the 3rd period comebacks.Good result for tanking at least, lol.",
    "Flop",
    "It's absurd these obviously suspendable things are going unpenalized",
    "we cannot lose to the fucking sharks I swear to god",
    "He's probably getting an MRI back in Toronto today, so hopefully we'll hear in the next day or so.  Fingers crossed for better-than-terrible news.",
    "No better person to score that GWG. Fuck the refs, fuck Hathaway, and most of all FUCK PHILLY",
    "Wait how is that no goal",
    "Benson is something special. Really dont know how the fuck we got him",
    "5D chess by Hughes on that play",
    "Alright friends. I'm gonna have to tap out for the night before the cold meds start to make me hallucinate. Hope everyone has a good rest of their Saturday night and the boys can hold off for a win! 🫡",
    "what is this overtime nonsense i want kraken",
    "yeah, hoping for some new fighting game announcements lol",
    "I hate that we're already at a point in the season where we absolutely need every point we can to try to catch teams in the standings (again).",
    "i was thinking the same. That's like Dion Phaneuf level holy shit",
    "Oh, please God get an empty netter",
    "Damn if this is our first period Im not sure I can handle the second period sens compared to this",
    "We should definitely keep playing Vlasic he's amazing",
    "When a player gets tripped by a ref they should blow the play dead.",
    "Thatcher was definitely motivated for that tonight. 3 shutouts which actually should be a league leading 4 with that sharks goal that shouldn't have counted.",
    "From the people that gave you the “Carey Price is a generational talent” narrative.",
    "There's something hilarious about Specsavers sponsoring play reviews.",
    "#LETS FUCKING GOOOOOOO BIG PP STROMEY BOI FUCKING DRAIN EM BOIS",
    "Not gonna play perfect games all year. Defense been a bit sloppy last couple games but how can you complain?The one thing that keeps showing up is resilience. LGR!",
    "It's like getting a new boss. Got to impress him so you don't get canned. Now if you get a new good boss that can bring energy everyday...",
    "Its just hockey. They will lose good performances too.",
    "\"Should be a good game [vs NSH]\"    LOL",
    "Absolute fact",
    "I meant 2 for boeser, i thought that's what was being said.",
    "What a steal. Goal would have been a cherry on top there.",
    "Hope they keep Desmith in for a few more. Demko needs a solid week to rest.",
    "Meh, it's something for people to channel their frustrations at. I don't really read into it too much, as long as it stays general. It's the people that take a loss like this and then write a five-page screed about how that one shift at 14:28 foretells doom and gloom and the end of society that gets me.",
    "GFG!!",
    "Put oel on the pp1.",
    "Johnny \"Cash\" Marino the way he's walking that line my boy",
    "How is that high stick missed?? Even if you were stuck watching the puck, its literally right in your face ref...jesus",
    "Christopher \"The Penis\" Tanev",
    "Yeah honestly he's kinda stunk in his last handful of starts. Was a bit surprised DeSmith didn't get the nod after his shutout",
    "ANDYYYYYYYYYYYYY",
    "We seem to be semi-awake now",
    "Top Shelf Coleman!Yes he did.",
    "It's 2-0, 10 minutes in and our only shot is by Zach Benson. We need Rob Ray to tell them to get some pucks to the net",
    "And not retrieve*",
    "Aged quickly",
    "Now would be a good game for Andrei Kuzmenko to show up.",
    "Comeon guys u know we were just kidding with the overtime jokes, feel free to win that way just take Boston down",
    "CATHARSIS!",
    "Hell yeah",
    "Who's we?",
    "Jacky with another 3 pt night, and Luke with a top-shelf snipe!",
    "Please, i will give anything to avoid having to watch the snoozenetsov shootout goal again",
    "I LOVEEEE THIS TEAM. Can't say I have said that in years.",
    "Holy shit. I feel like I'm gonna shut down. Like, I just can't.",
    "Chucky just saved the Caps asses there.  Not sure what the Caps were thinking about.",
    "Of course the overturned goal changes the whole energy",
    "Sound guy is unplugging random cables",
    "Positive takeaways: * New 1st line of Hogs-JT-Boes looks absolutely killer especially when JT is throwing his body around, disrupting plays. * Lafferty still looking pretty good, plays a heavy north south game like the coaches wantWould like to see Joshua-Petey-Garland play together. Petey can take a backseat and use his hockey IQ to find open space to tap in rebounds, get open for a shot, etc. Let Garland and Joshua grab the puck during their forecheck",
    "Jesus we still look like we're on the kill.",
    "No",
    "One of the most bullshit goals in history.",
    "Senator shouldn't have jumped into him, he shouldn't have even screened him, and the penalty shouldn't have even been called. Shit hockey all around",
    "Well we ain't winning the cup, that's for sure",
    "I don't feel bad for the team…I feel bad for me 😩😩",
    "God fucking dammit",
    "Soo I just did the math and if Eberle plays every game between now and March 8th he should be getting the silver stick at the home game against the jets on march 8th",
    "HOLY.  SHIT.",
    "Pezz wants to play!",
    "11 a cunt for that cheapshot",
    "Holy shit. Wow. Elite play. Dewar from Hartsy.",
    "Why is it so hard to take shots on a PP?",
    "HERE COMES THE TURBO SHORTY",
    "Why? We have one of the best prospect pools in the league and we are wasting them! At some point we have to do something with these players",
    "Lollllll",
    "Benson is the greatest player to wear the number 9 since Gordie Howe",
    "Well, that's not the outcome any of us expected.",
    "Well at least the Binner and Rouzy commercial will never get old!",
    "Wtf lol",
    "the defence dont seem to trust the forwards... I get why but if im the opposing team I will let the defence shoot",
    "for the final push i would put out these guys: ylonen - suzuki - slaf - armia - gally - kovacevic",
    "Ahh there it is. There's our beloved 2-0 (lord help us).",
    "Lets goo!!!!",
    "I'm seeing them in Nashville this month. If this is the level of effort and execution from them there I'm gonna be really sad my wife wasted her money on that being my birthday present lol.",
    "lol great nasty play, but beer league defense on that one though",
    "Satan sucks",
    "It's your fault if the Flames lose.",
    "What a game",
    "Not sure we're even getting a PP. Looked like Greig was going too",
    "Fuck sakes, that looks bad :/",
    "Kadri is a beauty man.",
    "LWTS GOOOOOO",
    "What kind of defense was thwt",
    "pains me to say it but jack looks so ass",
    "They probably came down to Florida to fish lol. How ironic.",
    "ZARYS PLAYING 1ST LINE",
    "That was not accidental by Necas.",
    "A fucking bench minor? After the knights have 4 straight PP's?  Coincidence?  Fuck these refs. For real.",
    "Ahhh nothing just other fans coming in and dogging on sens fans with insults. Meh whatever big W tonight. Just wish they would pin a comment  “don't go invading other subs” like you did.",
    "Jesus Mikheyev can fly.",
    "Lol absolutely not.",
    "Finally we get a too many men on the ice in our favor 🙌",
    "No way it went in lel",
    "Soft call. Kill this shit.",
    "Horrible defensive game all game leading to a lot of open opportunities for New Jersey which they capitalized on. Devils scored 4 in the first period. Myers doing Myers things. We managed to tie it in the third period being down 5-2 but ultimately lost 6-5 due to another occurrence of a Devils player being wide open in front of Demko. Höglander should stay with the Miller line. That line and the Garland line have been the best tonight. Hög helps create plays and keeps the opponents moving their feet and sometimes forces them out of position. He also tied the game 5-5.",
    "Damn. Would like Akira to come up with the save on that. He's made some good ones this game but he probably wants that one back.",
    "Honestly you felt that goal coming for us. We were really there from the jump. Let's do this boys!",
    "Wolf...BAD DOG!",
    "Give Nils a lifetime contract such a high motor never quit guy",
    "What a stupid penalty to take",
    "Hi bestie <3",
    "Heh, I like Quins, Grampa “if this hockey thing doesn't work out, you can take the fire test” :)",
    "Pregame playlist tonight at the arena has so far included I 2 I from the Goofy Movie and now September. A+ vibes lol",
    "WOOING IS OUR THING GET FUCKED WINGS",
    "Dude, keep Ovi off the ice, don't waste 1,500 on this hot garbage",
    "Sabres playing 3D fucking chess while the Avs were playing checkers all along…  I'll be damned!",
    "Dang swayman slamming that 5 hole closed impressice",
    "Yeah true. As decent a guy as Bruce was he didn't have the edge the team needed. He was a friendly face for players, Tocchet isnt. Why wasn't Tocchet as successful previously? Maybe there wasn't the scope for improvement with players that he's found here. And maybes he's just a cog in the wheel. Seems a big one though.",
    "Ok DJ, this time you can actually say the bounces didn't go our way",
    "They're an American market that's not named Vancouver lol",
    "Number 85 Jake Sandstrom",
    "Honestly shocked it took that long for the penalty to be called, Krug was hanging on for dear life from the blue line lol",
    "Our top lane playing mid AF",
    "WHY DOES HE HAVE TO CALL A PENALTY",
    "Did they go out day drinking today?",
    "Jesus Tampa is still a good team. Wtf is everyone talking about with this 'they're not that good anymore' nonsense...?",
    "The other difference is them being a way better fucking hockey team lol",
    "Never. People will still want him fired after every loss.",
    "Even funnier is that this happened earlier in the season when Brock erased Matthew's hatty of the night with 4 goals.",
    "Nice tackle Willy.",
    "Yeah that's definitely the case. I was kind of joking about the fact that the Stars are a much better road team. Hoping all the away fans will make it feel like a road game so they win",
    "Hayes and Scandella with the heroics. As we all expected.",
    "Wow that stat 7-0 when we're leading after two. Just goes to show how make or break our second periods have been. Let's make it 8",
    "Damn it's intermission already that period flew by",
    "Duke and Hoffman are probably the top of the list when GMs call San Jose this trade deadline. Also Ferraro has been garnering interest, but he isn't a rental for us, just felt like mentioning him since it might be relevant.GMMG might actually want to extend Duke if he is interested in staying longer because he is really embracing his role as a mentor to Eklund and could be useful to continue that when more of our pipeline comes into the lineup next season. But when we acquired him, it was seen as an opportunity to up his value since he had been injury prone the last little while and competitive teams weren't willing to take a chance on him like we could.",
    "He had a rough year last year like literally everyone else on the team. This year he's solid again. At 6.5 mil AAV he's fulfilling that value.And I ain't the one downvoting you bruh.",
    "Why does this team insist on hurting me lol.",
    "Clifton kept that play alive",
    "• Alex Vlasic left the bench midway through the 3rd period.",
    "What is this commentary, they just gonna talk about how we suck?",
    "> Harley is ~~going to be~~ such a boss.",
    "Didn't take Kuzy long to realize he was done talking to Emily Kaplan",
    "Lol @ New Jersey losing 3-1 to San Jose",
    "Fuck Cousins!",
    "Is Otter okay?",
    "If Jamie Benn didn't play in the NHL, he would cheer for the oilers",
    "Did you tell him that?",
    "We win without Sammy in net",
    "I like a little chaos",
    "I hate that ugly fucker",
    "I have turned off more games this season so far than I have in the last 15 years combined. This team makes me so pissed!",
    "U don't have to reply to everything I say lol if u don't like my comments",
    "Juulsen is so bad",
    "Clifton has played a very nice game I think",
    "Congrats to the Vegas Golden Disco Balls",
    "It would look bad for a GM to waive or trade a player just three months after signing them. Also Reaves is \"his guy\" while Lafferty was acquired by Dubas so not \"his guy\".",
    "Can't believe putting Danforth out there to faceoff against Barkov in our defensive zone didn't work.Pascal I know you're smarter than that.",
    "Listen I'm not just blaming him but he hasn't been there like he has in the past. Yea the team has been really bad defensively lately but i just think quick has made those key saves more often this season and he has been peppered as well soo don't act like Igor has been the only victim of bad d or poor puck management. The difference in my opinion from watching Igor since he's been in the league is that he is a head case and gets frazzled too easily. All Carolina had to do that one year was have the crowd chant his name mockingly the whole series and he was done quick is a proven champion and he is playing vezina quality hockey this season. You are adding other factors into this argument that i am not arguing. I'm arguing the quality of the goaltending that i have seen this season and which goalie i think gives this team a better chance.",
    "It only took 3 trippings for one to get called",
    "Pissing off Igor this season a lot already",
    "They're good to look at on the ice. Off the ice they look so weird to wear though",
    "Nearly 20 years of Kopi. We've legit been spoiled",
    "#WE'RE BACK!!!!",
    "At least we haven't given up any stupid penalties this game. That's a plus.",
    "#WHAT IS HAPPENING",
    "some say we may never lose again",
    "Blatant interference to be that open, ridiculous refereeing.",
    "Matty plz take the beer goggles off :/",
    "Gave Kempe an extra 2 because, because.",
    "#THATS A GOAL",
    "So I think Commesso will be good enough for a backup on this team, but he is playing really bad lately. What should this team do for a goalie going forward",
    "Stop turtling please.",
    "Borderline dirty hit",
    "So, what really impresses me with fantilli, is how fucking GOOD he is at backchecking. I dont recall him getting a hooking or high sticking, but he frequently steals the puck or breaks up the play. Gonna be an unreal 2 way center once he fills out the frame",
    "BOOOOOOOOOONE",
    "He quite literally never wins it",
    "The Leafs are far better.",
    "🦦🦦🦦",
    "What happened to Bogo?",
    "Looooooouuuuuu",
    ".920 SV% for Schmid last 5 games, yeah I'm thinking he's back",
    "If everyone wants to start e transferring me I'll hold the funds",
    "He's been solid ever since he's been in Nashville. Juice and Lank have got to be one of the best tandems in the entire league.",
    "Bedard needs to shoot way more and stop trying to pass all the time",
    "Aren't we capable of showing up for both though?",
    "Marcus, go settle your brother down",
    "I want Myers benched. But let's face it, this wasn't a game that was lost by just him. We had a dismal first period and our big players took too long to have an effect or didn't at all.",
    "I swear we never get those crazy bounces like that. Love to see it. The Nemec era has begun",
    "We are so bad in the neutral zone, it's just terrible.",
    "The way I see it, Petey has had issue like this before, more than once. It's always been a confidence problem with him. He gets into a bit of a rut, and then he gets frustrated, starts overthinking the play, trying to force things to happen instead of reading and reacting.Petey's linemates will always live and die by his ability to drive the play, draw defenders to him and then dish to competent finishers. He has the finishers on his line, but he isn't making the smart play when he has the puck, isn't using his speed, or his strength, or his stick.Putting Petey with new linemates won't help becuase the problem is with Petey himself. If he was the finisher on his line, like a Matthews or an Ovechkin, then yes, changing things up and putting him with quick, hard-forechecking wingers might help get him the puck in the right areas to start scoring. But that's not the kind of player Petey is, and that's not the issue that needs fixing with him right now.",
    "Both are very easy if you have the space/resources. They're husbandry requirements are straight forward and easy (hell, the boa even digs temps as low as the 60s) and they not huge.",
    "Yup let's get another goal 💪",
    "Protect Austons dad and Tie Domi at all costs man it makes me so happy seeing how proud they are of their kids. Seeing that was the serotonin boost I needed today",
    "I thought this was a trap game for us… almost was",
    "If I hadn't been up in Mich for a concert this weekend, I would have made the trip. Being a Kings fan in NE Indiana is quasi rough most of the time. I'm just glad I can watch a game at a decent hour.",
    "I'd say what Boston did was more of the retool. While LA never blew up the entire core, they weren't afraid to sell off big pieces and suck for the drafts.",
    "Ya. You know Cheech was somewhere thinking 'don't you guys say it! Don't say it!!'",
    "Giving up the lead is bad but the avs are just visibly so much stronger than other teams we've been playing. I'm happy we're still in the game at this point",
    "Stripper glitter on their uni's is so Vegas",
    "I was just saying we should play it every time he makes a big save! I love you",
    "They've been so clueless about that entire situation. There's a reason why Joseph's been booed tonight and not Kelly..",
    "He was going to bench them all and call up Hartford",
    "And to watch some playoff games!",
    "Naz Reid",
    "Why are they singing a Canadian anthem? The teams are not from Canada, thou",
    "Please keep Fliggy and JD around, Kyle.",
    "Yeah.",
    "Need Stastney or Del Gaizo in that spot.",
    "I love hearing a team has the worst power play percentage in the league after getting scored on by their PP. Feels great.",
    "Every time Dano comments on our inability to get it out I feel that in my fucking soul.",
    "Game thoughts,Singh doesn't know the difference between Elias and Elias.Lindholm is looking alot better the last 4 games.We need a top line winger to play with 28 and 17Zadorov is dead to me. I don't miss #4 on the PP #55 does the trick for me. How does Singh continue to have a job, he is so brutal at play by play.",
    "Oh boy a power play look out",
    "NGL those Liberty pads are fuckin sick.",
    "Another DJ I wouldn't mind seeing fired lol",
    "HOLY SHIT ZAMBONI FOOTAGE",
    "He's playing like he's on a mission",
    "I need to go lie down, that was stressful.",
    "It doesn't really count as a trap game when the other team is just better at hockey... well, outside of goaltending. But we all know what happens now; Raanta will suddenly stop everything.",
    "They seemed like afraid to break out of their zone, it was a bizzare start, but DeSmith was fantastic and we figured it out. Now if we can just get Petey/Kuzy going somehow.",
    "WHL has a scholarship program for the institution of your choice? Hello Harvard.",
    "Last game against the Yotes this season. They're always a thorn in our side, but have managed to go 2-1 against them. Usually our games are entertaining, albeit maddeningly close at times.",
    "Holy fuck we actually scored an EN!?",
    "I sincerely hope by the end of the night, Vegas isn't laughing themselves to the airport thinking \"Damn, it was *that* easy?\"",
    "Remember when everyone was saying how boring we were the first month of the season because we weren't generating a lot of shots and focused more on taking care of our own end of the ice?  Are you happy now?",
    "Does Backlund get paid to miss the net?",
    "What a hustle goal.  Brodz with the hustle play at the line.  Panarin crashing the net.",
    "Max!!! First goal as a Leaf!!!!!!!",
    "Donato tried to hit fleury with one of Malkins old moves there.",
    "Va chier Dubois",
    "I am dead on the inside.",
    "Slaf showing Dahlin and Power who the Alpha first overall is",
    "🫡",
    "That was just dumb Provy",
    "I'm starting to really like Sharangovich. He wasnt really playing well to start, but it seems like he's getting better as the games go on. I also appreciate that he has a wicked shot and isn't afraid to shoot *(unlike our 10 million man)*",
    "Happy cake day!",
    "Can't expect to win with such garbage passing for 60 minutes.",
    "Good grief, but we got the W",
    "Tough loss. See you all next time",
    "This team can't hold a lead and bury a team. Won't win another playoff series until major changes happen. Too soft and nobody fears playing us.",
    "Accountability and Best in Class. The on-ice product is neither and the fans will continue to climb the ladder.  The team is performing poorly.  The coach isn't getting results.  The GM is refusing to take action.  Andlauer, I'm looking at you now…",
    "Methot is my favourite human",
    "Atta boy Eichel",
    "Vosters the ref had his hand in the air for like... Five seconds",
    "Lol Greig will fuck him up",
    "Glad the Leafs didn't win this in a shootout preventing Leafsnet from jerking them while it cuts into the Canucks game.",
    "“Don Granato what do you have to do to get back in this game” … “well you see, I don't know, get pucks on net, I guess”",
    "I want our boys to have an aggressive forecheck for once.",
    "This is why a strong start helps when you have a mediocre follow-through",
    "This sub yesterday:\"Why do we even have Allen, get rid of him, and keep Primeau.\"This sub tonight:\"Waive Primeau, god!\"",
    "Good bot!",
    "FERRARO FUCKING PUSHED HIM YOU EMPTY SKULLED DUMBASSES IN STRIPES",
    "So my ass is in my throat awaiting the 3rd and a chance to snap the losing streak. Maybe if I don't watch that's better ...",
    "HELL YESSSS LEVI THANKS",
    "Boo!",
    "So much fun to watch then play like they can!",
    "The Hockey Guy moves us up to 21st in the power rankings… just imagine if we would have won tonight…",
    "He looks like a new goalie this season. Happy to see it!",
    "Currently 111th in the league for that line, you're right they've been incredible lmao",
    "God bless Suzuki",
    "This is a great game Ottawa Senators against New York Panarins",
    "For the most part, people generally, and sports fans in particular, are nicer in person than online.",
    "Brodin out? Pack it up",
    "They just think it's justified. What clowns.",
    "Boys are gonna be so fired up to play tonight I feel it. GFG",
    "This strata AGM I'm running tonight is gonna be fuckin fastest these people ever had because I don't want to be missing the Lu party.",
    "I love em",
    "That's what I like to see boys! Great passing.",
    "Do the Flames think this is the 3rd period?",
    "LETS GO BUFF-A-LO 👏🏻-👏🏻-👏🏻👏🏻👏🏻",
    "What a goal",
    "holy fuck",
    "I'll always be confident with him. Even if we lose some games, he's still an amazing goalie.",
    "Did Chabot just steal the puck from Joseph after the whistle lol",
    "Kadri redirected it in based on the footage but ok",
    "Claude Giroux is my father",
    "He's been like that all year last year",
    "WEDGEWALL SAYS NOT IN MY SHOOTOUT! SUCK IT YOU PUTIN SHILL.",
    "I'd like more from Dickinson",
    "Ferraro is better than Tomlinson, and it's not even close. I hope he becomes our full time.",
    "The team was trash for 40 mins but Sammy was trash the entire game",
    "The Curse, obviously.",
    "Flower is just being rude at this point.",
    "I really enjoyed it. I thought it was a good retelling of the original story.",
    "THANK YOU VITEK AND NEMEC",
    "I am really confused at Kempe's play in OT.  That decision made no sense.  They had easy possession of the puck and he fired it at an Islanders' stick and gave them a breakaway.  Obviously it's a somewhat unlucky bounce but why would he even do that??",
    "We are as good as we behave in limiting mistakes. Make mistakes = suck. Don't make them = respectable hockey. If our PP showed any sign of life, we'd be dangerous.",
    "It's like watching a terrible car accident. We just can't keep our eyes off of it.",
    "Taking the fattest toke of copium on Huberdeau rn its crazy",
    "The Victor Olofsson experience.",
    "And they say that ice tilt isn't real",
    "Maybe CBJ will take Kuemper too",
    "Great fucking play Allen attaboy. Why the fuck is Monty not playing tonight",
    "Second year in a row we lead the league in back-to-backs, goals that apparently aren't goals, but why would the NHL need to answer for any of that?",
    "Okay, there might be some life!",
    "Hey guys we should trade laine /s",
    "NVM that is some BS - should HAVE BEEN A GOAL",
    "Random thought, how do we think the kid in the stands who was mimicking Kipper is doing these days?",
    "There's been a number of them, but they were well timed at the very least. The transition game has been a lot stronger tonight though.",
    "Jiri heard you guys were talking shit",
    "Zodorov shitting on Scott oak now we won twice tonight",
    "Im convinced Gallant was a conference criminal internally trying to ruin Laf",
    "We keep losing games we can/should win. This time against divisional rivals.We have what, 6 games on hand, and yet we can't win home games.This team has beaten the positivity right out of me.  I'm not content with participation ribbons and mediocrity that this team has been coached to do for 5 years.",
    "so weak",
    "Yeah we getting tossed around",
    "MIRO THE HERO",
    "Just watched the Boeser After Hours and dude is just a saint. Not as relaxed and animated as Tocchet in interviews but seeing him take that sweet girl to prom was very touching. What a dude. I'm team Brock all the way.",
    "Bally cannot afford that kind of technology",
    "You picked a great time to start following the Kings.",
    "LETS FUCKING GO!!!!!",
    "It hurt every time.",
    "#WILLY GO BOOM",
    "Elias stealing Zadorov's game winning goal shows you exactly why he didn't get the “C” over Quinn.",
    "Embarrassment of a game. Coaching should be ashamed. Punted the game for starting a bum in net and wasted every minute Lundell was on the ice.",
    "SIT HIMLET HIM HEALHE'S OBVIOUSLY GOT A TORN ACL AND IF WE PLAY HIM TOMORROW HIS ENTIRE NHL CAREER WILL BE OVERand other such opinions from the professional doctors we've got in this sub.",
    "Not even knowing where to start, because last year it was the curse of the blue line but this year its all games right now. I still think Hakstol should be fired, flat out, and that shouldve been after year 1 but I get giving a chance to an expansion team coach. Flaws? We got tons. It sucks going to these games and consistently losing. Tied for most OTL and just overall terrible puck management. Let's begin!1. Why aren't we shooting the puck? 1st and 3rd period we had, what, 10 shots on goal combined? And 15+ in the 2nd? Why do we do so well on shoot once side in the 2nd? We have so many opportunities to shoot and we wait for the perfect shot. But all of our opponents take shots from everywhere (which is why we get outshot almost every game) and those shots cause ricochets or rebounds for their players to score one. If you have ever played hockey, you know that there's something wrong here with us not shooting.2. Our lines still don't make sense, except penalty kill 1st line. We're out there passing back and forth right in front of our own goalie, not knowing where our teammates are, no hustle, blue line offensive push is awful. If we can't have a good mix of players on the ice, how do we expect to make it past the blue line?3. Outside of Will, Yanni and Tye (sometimes Brandon too), none of our players skate to hit. We lean back, we slow down before a wall, we play the post board shot instead of being aggressive and going for the puck through force. It's sad to watch hits happen on us with no repercussions, even Adam has calmed down compared to his hit opportunities. Don't even get me started on Jamie not being an enforcer at his size...4. Skate... it's simple, that's what they get paid for. Yet we don't - most goals are because there's no defense due to either lack of effort on getting back or slow skating on our part. Sure, you can atteibute some goals to rebounds because our opponents understand that shots from far out equal slchances for rebounds. It's clear we don't understand that part of the game.There's a lot more smaller items that I can gripe about, but these are hockey essentials. Players get hurt and we bring up Firebirds players, but some aren't ready. Evans probably got rocked 5+ times like he was a deer in headlights waiting for it. I get it, 2nd game in the big league can be intimidating but we gotta be more conscious of these things.",
    "Respect to Palat on that shift, he stayed with it and put the work in.",
    "4 days ago lol",
    "Hell of a game. Put last night behind us. Laviolette really has been tremendous for this team. We would've lost 3-0 last year with like 20 shots in goal",
    "We are shit. I'd give Jake the mercy pull. Team is just not in it today.",
    "Thar she blows yet again.",
    "Not sure Guhle should be back out there after that knee to the head, I thought we were gonna be more careful with that stuff this year.",
    "Give Jet the start Sunday. He earned it.",
    "Yeah, not like he would be an upgrade over our current back end at all or anything right?",
    "Armia had about as much interest in scoring on that shootout attempt as girls have interest in talking to me",
    "Binnington should have shot it. r/hockey would melt down",
    "Can the Preds take that last 5 minutes of play and maybe, I don't know... TURN IT INTO 60 FUCKING MINUTES.",
    "Jesus Christ",
    "You telling me those last two goals weren't because he failed to back check and cover his man?",
    "Oh my Jo what a goal!",
    "This is what makes me start to think coaching is the issue. There's so much talent out there but they spend massive amounts of time just passing the puck around the perimeter until they're eventually pressured and cough it up.Feels like every game is lesson from the other team on how to score goals in the NHL, but we're playing a completely different style.",
    "Yeah you gotta pull him",
    "Didn't like the stampede",
    "I'm watching on Ballys.  Sound is messed up.  Are other feeds' sound messed up due to their arenas electrical issues?",
    "If you gave birth, make sure your partner is helping out. If you are said partner, make sure to help out your partner. CBJ hopefully will bring you a win on Tuesday. Those first few weeks can be chaotic, but yall can do it!",
    "just can't get any bounces to go our way",
    "If the refs had to do a post match interview, the #1 question would be \"Why did Sherwood not get an instigator in addition to fighting?\"But there isn't because the refs are allowed to do whatever they want.Re the game, really well done!",
    "We cannot score, if our d-men weren't carrying the offence we'd be dead last.",
    "> I think that we downgraded both offense and defense slightly in offseason.I see this a lot. I'm not buying it.We lost our 4th line. It was a *great* 4th line, but it was still a 4th line. We added some talent in Yamamoto, Shore, and Bellemare that on paper should have easily replaced Geekie, Donato, and Sprong.We lost Soucy, but we signed Dumoulin, who should have been a fine replacement.And looking back at what analysts were writing about the team in September, I can't find *anyone* who was saying that the team looked worse going into this season.I think the narrative that the Kraken downgraded in the offseason and were supposed to regress is a retcon invented by fans who cannot cope with the reality that the team is simply grossly underperforming this year. They find it comforting to imagine that failing was all part of the plan, so we are doing fine.Its an embarrassingly delusional perspective.",
    "Joker had to dangle the ref to get it around and turn the puck over lmao",
    "Good powerplay",
    "Dany Dubé pointed out last month that he's been playing a far more physical game, which is coming at the expense of his shooting.",
    "he's the most likely deadline target given the cap. Only $3m a year and an actual top 6 RW plus another shooter.basically every C/RW option is considerably more expensive in terms of cap or cost to acquire.",
    "Dockers not it imo",
    "The Boston special, I don't care if we become the thing we hate, bring on the endless bullshit that brings us wins inspite of ourselves",
    "Go Knights go!",
    "Leafs had to overcome dog shit goaltending",
    "I wasn't vibing with the TNT crew tonight. I like Kenny Albert and Boucher is one of the better color commentators, but man having Eddie Olczyk back in the booth was not doing it for me. Like too many times they broke away from any game commentary to just dunk on Boucher for a couple minutes. It felt like I was listening to inside jokes that I'm not privy to. At times it felt like I was listening to the Edzo Podcast rather than commentary to an NHL game with his main topic being “Why Geekie is the most certifiably insane mofo to ever play the game”.",
    "I sincerely apologize for my lack of faith. I posted a lot a shit tonight and now I must eat a humble sandwich and pray for forgiveness",
    "He got his goal with them in the third, but I don't think he started there. I thought for sure Kuz would go with Blueger and Garland. That fourth line looks a bit soft without Joshua.",
    "Ottawa are an embarrassment",
    "Alright I can't stress this enough. Fuck the bruins. But I'd be lying if I said I didn't like the gold sparkle in the yellow on the jerseys. Nice detail",
    "I can't believe we let the white Eric Andre score on us",
    "This team wants to play with flair, but they don't bother to make the easy plays, the fundamental plays. They want to improvise jazz, but can't get Mary Had A Little Lamb right half the time. Its infuriating.",
    "I love how aggressive Faber has been offensively this game",
    ">Army had just as much, if not more, to do with that Cup than Berube did.Army built that team, put them in front of Jake Allen and Curtis Johnson, and hired Mike Yeo to ringlead that circus.If Binnington doesn't come up and save him, he likely gets canned in 2019 which, outside of extending our Cup drought, otherwise likely ends up with the team in significantly better position than they are today given that almost every move he's made since that parade has been fucking awful.And it's not like Binnington was the de-facto contingency plan. If Ville Husso is healthy, he comes up and likely puts up a season much like his first professional season in '20-'21 - mediocre. DA got his ass saved by an absolute miracle and has been acting like the smartest man in the room ever since.It would be one thing if we over-committed to the core that brought the Cup here and slowly faded away in the years that followed... you know, like every cup winner in the last decade, but nah - DA decided to speedrun that shit. Ask Hawks, Kings, or Lightning fans if they're upset about seeing their leaders get overpaid to ride out their careers - shit, I'd take that in a heartbeat over watching the first Blues captain to hoist the cup anchor the blue-line for fucking Las Vegas' cup run while we hang out in the basement with the worst defense I've ever seen.",
    "myers wouldve backhanded that puck straight to a canes player somehow",
    "I am a masochist, am I really gonna turn this shit on?",
    "Greaves playing Sweeper Keeper lmao",
    "Pretty pathetic performance. Poor play, pitfalling.",
    "Fuck wild card we C3 boys fr fr",
    "I think all refs have a thing that if there's a defensive zone scramble where a team desperately tries to keep the puck out of their net, they are looking for something to call on the defensive team.",
    "It's not been moving much lately.  😟",
    "Oh boy, this is gonna be an uphill battle.",
    "ridiculous move by Laf with the puck to exit the zone and walk around the D a 1 on 2 out of the NYR D zone turned into a 3 on 1 almost immediately due to that",
    "I don't know what hurts worse, this or my entire body just being chaotically wrecked from work this week",
    "Is it a one and done kinda evening?",
    "good hit by Domi",
    "I'm convinced he's tanking away the extra point everytime, because there's no other explanation every time for his choices lol",
    "Vasy earning his shut out tonight 😮‍💨",
    "I for one love the Nico Grimace",
    "Far too many",
    "Bro where the hell was this team against the sharks 🤦‍♂️",
    "I thought you weren't watching?",
    "Oh a strong forecheck leading to a goal? Who could imagine.",
    "WOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!",
    "WHO ELSE!!!!!",
    "What are these power plays ... !!!",
    "Is Papa Matthews leading the rangers goal chant when the leafs score? lol that's awesome if he is",
    "Wishing all the best for Tarasenko and his family",
    "I have now been to 7 Rangers games and have yet to see them win in person",
    "I think Trouba legit broke the guy last season with that hit.  He hasn't been the same since.",
    "The ending is just as good as watching the sabres play",
    "Weak shots and shots directly into the goalies chest will do that.",
    "Too bad Suter is going to be out for so long. I liked what he brought to the lineup.",
    "Let's guess the 3 stars of tonight's game1: Caufield 2 goals 1 assist2: Josh Anderson 1 goal 2 assist3: Samuel Montembault 35/36 saves",
    "Happy pappi",
    "Struble looking like a real success story so far. Drafted and developed by us, seasoned a bit in the AHL, and now stepping into the big leagues like a pro.",
    "Adadio",
    "What does the sub think about joel edmundson? Please comment below",
    "No kidding eh... are the Kadri haters even watching the same game?",
    "Dewey is back to his emotionless media presence, sigh. It's ok bud, go celebrate your accomplishment.",
    "Benson is my fucking DAWG.",
    "If only we got to shoot on Samsonov",
    "11-0 when leading after 2",
    "Enjoy my friend, should be a good one!",
    "No shit, he has had obe good season in like 15 years",
    "Not again",
    "The Sens always come out flying vs the Leafs.  The Leafs never fail to not give a shit.",
    "yep...they are ostensibly team employees. but for some reason it rubs me the wrong way to have to both watch and then listen. I like Rims and Jody but for some reason it just adds to the frustration.",
    "well, we set one record. fuck the rigged ass refs gifting them shit left and right. at least gavy and lewis are ok and we got a point. time to play quickie tomorrow",
    "We fucking imploded… 4 goals in 1 period",
    "I mean yeah you have to call a penalty there but what positioning is that Montreal player taking? Like he's just staring at the people in the first row when he has the puck",
    "Linesman for the block",
    "Otter is definitely hurt. This season he has not been his normal self. I think that surgery fucked him up",
    "I chalk it up to being from Jersey and also to those three Cup banners. Chicago has banners too but 90s/00s Devils would crunch those teams",
    "Gru has to stop that.",
    "#S!",
    "Hey we got it out of our zoneIt was an icing but it counts rightEdit: Two icings",
    "And yet they keep getting scored on",
    "Ah man, don't think like that",
    "Do I? Maybe I just have higher standards for a 10.5 million \"franchise winger\". Now pointless in the last 4 (lost 3 of those). 3 points in his last 10 games. I mean, at what point do you stop making excuses? \"The little things\" isn't good enough, he's never the difference maker the flames need.",
    "Who coaches the Sens' PP? And why?",
    "Garland always such a shit desturber",
    "This ought to be the incident that gets someone fired in a competent organization that cares about results. Up 3-0, meltdown and lose in overtime. Fans were willing this team to step up to do something and we just kept dumping puck after puck in.I don't even care if it's fair, if Pascal is the sacrificial lamb, fine whatever. Someone needs to be shown the door",
    "Troll",
    "They looked scrambly in the third for a good while but that's credit to Tampa's forecheck",
    "Yeah, nice guy but his time is over. Waive him and if he clears great and if not who cares",
    "battle of who can choke more, theyre gonna bring back ties for this one folks",
    "#MARCHY ON HATTY WATCH",
    "I think we should move jones to winger.  He thinks he's one, just put him there.  He's actually pretty creative.  Fuck it, see if he and Bedard have chemistry.  Nothing to lose.  Our D can't get any worse.  And he'd still be around to mentor our young dmen.",
    "Vegas owns us.",
    "ohhh yeah forgot about that",
    "I just moved to Phoenix....sounds like an early Christmas present to myself 🤔",
    "Hockey announcers always talk about the puck being in the corner, but if you think about it, a rink really doesn't have corners per se.",
    "I saw Doughty bounce off him a couple times while trying to lay the body on Slaf. The kid is a physical specimen and still has the vision/skill to play in the top-6, we've needed players like him and Dach for years now",
    "SCREAMING, CRYING, PERFECT, STORM",
    "That's a 12M$ effort right there if you ask me",
    "I love this version of huberdeau!! LFG FLAMES!!!!",
    "Huby the Goon",
    "8 actually!! Mazel tov!",
    "Goalie is at the hashmarks what is Matheson supposed to do",
    "Ebbs and flows. That's how it goes people. Remember how horrible we felt around February last year with all the OT losses and stuff? Yet we still went to the conference finals. Just breathe and hope things get better. They know they aren't playing great, and they'll do what they can to get better I'm sure.",
    "yeah only two and none against kings till 2024",
    "Panarin always seems to struggle with 4pm games",
    "I've had Sabres fans tell me, straight up, that save percentage is a junk stat when discussing Eric Comrie. Just crunching numbers over here to keep myself busy, if he gets pulled now he would have the lowest save percentage of any goalie to have played at least ten games as a Sabre. Franchise history.He should never have been brought back. Period.",
    "Reffing shitshow aside these past two games, the juice has clearly run out on the road and they've looked pretty poor. Hope Gavy isnt out too long.        Need a big mental reset at home. Some guys have gone missing and they need to step it up.",
    "Hoglander ❤️",
    "I swapped to Hulu because espn's stream has always been absolute dildos",
    "The “Bless your heart cam” is my new favorite.",
    "not even getting a shot on the net lol. It reminds me of when we had a two on none breakaway a few games back and we didn't even hit the net. WTF. Imagine McDrai not getting a shot on net on those opportunities lol",
    "Spencer's white mask is kind of sick.",
    "This team will either win the Stanley Cup or get swept in the first round, there is no in between",
    "Hang in there buddy.   Don't let stupid fuckers ruin your Christmas.  It'll turn around.",
    "We just lose in regulation",
    "I love Hertl, just thought y'all would like to know.",
    "Vegas advantage",
    "Imagine brodzinski becomes a ppg player at the age of 30 haha I'd keep him up and get rid of wheeler eventually",
    "OMG ESA YOU KING!!!!! WHAT 👏 A 👏 GOAL",
    "Damn right",
    "So happy for Boeser this year",
    "Given we call it the deep, I appreciate that CPA is an underground arena. It's the little things.",
    "Man it's crazy how kadri and a couple rookies is so much better than the lindholm line.  If that line got going we would have 3 solid lines",
    "[plz dont b sad :(](",
    "I think that play is ok but he gets skate, not puck, so should it not be tripping? Brady has been super immature this season when it comes to reactions, but he kinda has a case there I think.",
    "Was Shorty crying?",
    "PAIN",
    "Oettinger just isn't seeing pucks like he used to. Old Jake would've stopped that second goal.",
    "They trying to avoid bonus?",
    "Really missing Schwartz tonight.",
    "It's suave, it's creamy, and it's nasty!",
    "Power fucking move by big Q",
    "Our big sniper is back boys.",
    "I'm losing so much money betting my friends every game that this is gonna be the Igor shutout",
    "What is it that Seth Jones does here",
    "GRUUUUuuUUUUuUU",
    "Vintage McCabe, they won't get the instigator because they're the rangers and we would because we're the leafs",
    "JT'S DAD IS SO CUTE😭🥹",
    "way to use your head",
    "Damn that was fucking tough from willy. Tough af. In a little bit of a rut. Still believe in him",
    "Alright, review goes our way!",
    "Good shift by Slaf",
    "YEAHHH BLACKWOOOOD",
    "Typical Detroit class",
    "Seconded",
    "LOL, yeah true",
    "It's gonna be stoppable force meeting moveable object in this 3rd",
    "Being 0-5 against a rival in your last 5 matchups against em is embarrassing.",
    "So the Blues fans boo'd Jordan Kyrou  and  made him cry after he wouldn't comment about Berube being fired.",
    "Did you wake up with your peepee feeling weird?",
    "##**🍠😁**",
    "Vintage Nylander Matthews connection",
    "Love the effort tonight - fighting for the puck is showing in chances I hope they can keep it rolling. Daccord also crushing it!",
    "wedgewall big dicked the fuck out of Ovi. props to him.",
    "Luuuuuuke",
    "Introducing first pair defender, JBD. 😮",
    "I dub their line... FOrNy?",
    "With chaos reigning supreme tonight, I can only imagine what the third period will bring. Watch Vlassic somehow score one",
    "Now let's get to full-time without conceding another. GET THE NEXT GOAL",
    "#FABER SAID GET THE FUCK OUTTA HERE CONNOR",
    "Apparently Igor is starting tonight.  If he loses this game and plays poorly, prepare for everyone in this sub to lose their minds.",
    "To be fair it was quite entertaining.  A tragedy and comedy all in one",
    "can't believe i stayed up to watch that",
    "It's weird  rooting for the patriots while watching the sabres play the bruins.",
    "12 minutes to make history",
    ">Aurora BorealisAt this time of day, at this time of year, in ^^^your part of the country, localized entirely in your area?",
    "I really dislike how we make every team look like playoff contenders",
    "Interference much",
    "MORE BIG PP HAHHAHAHDHDHEYWHSGWYWYEJRJRJRBEB IM FERAL",
    "Trapezoid. Drink! Or don't. Who even cares anymore.",
    "Can't wait to go down 4-0 so we can score 3 in the 3rd to lose",
    "That was the HIMYM of leafs games, great until the ending At least Domi and Matthews broke their drought But man I hate it when they lose to Boston",
    "One of the funnier moments of the season thanks Trocheck😂",
    "Miro....didn't play the 2 on 1 on his side properly...left too much room.",
    "Enjoy the game everyone! GHG!Also whoever designed these ugly Kings helmets should be taken outside and flogged",
    "Demko deserves better tonight. He's been bailing the team out so many times this season. He's having a shaky night, get in there for him!",
    "man i did not miss the whole dump and chase and battle along the boards routine, so uninspired.",
    "lmao im killing myself laughing over here",
    "Deserve the loss tonight.",
    "Kesselring assist as well 👀",
    "He looks like a giant baby",
    "Pretty sure it was. Thought the voice sounded familiar. Now I just need to be visited by the ghost of don Taylor's hair plugs and Xmas will be complete.",
    "They seem just insufferable even just watching on TV lmao",
    "Brock on a 55 goal pace btw",
    "Yep and Igor with 36 saves on 39 shots hahaha",
    "AUSTTTTOONNN",
    "Best Miro has looked in about 10 games, playing with fire tonight",
    "Hey, chief, I know this is probably a super complex concept for you, but it's called a block button. How about you just hit that and save the asinine whining for whoever is unfortunate enough to know you in real life",
    "What time is warm up today?",
    "Ohmygodohmygod",
    "Holy fuck",
    "Watching how that kid plays, we won't need anyone else on the PP. He controls the entire thing.",
    "If I wasn't more sure he'd miss an open net, I would lol",
    "Do we have a picture of this?",
    "* The Red Wings scored once shorthanded and twice on the PP.* Reichel knocked in a PPG off a feed from Bedard.  * The Hawks are 7-for-67 (10.4%) on the PP this season, allowing 4 SHGs.* Kostin received a misconduct for shoving Murphy's face into the ice.* The Hawks couldn't beat Lyon.* Bedard recorded 7 SoG, Phillips 5.",
    "Connor who?  Rossi flexing.",
    "Woll sacrificed himself for this win",
    "Well this one sucked. Cant win them all. Stars played well, Tampa responded really well and at the end of the day we still outscored them 8-5 and we dont have to play them again for the rest of the regular season. GG Tampa. We will recover the Stars will be okay!",
    "Avs and MacKinnon showing why tanking works",
    "100% They were all standing still when the puck just dribbling to the blue line. Vegas took advantage.",
    "Brock BoeserHappy he never got tradedLoves the fansDitched the playsation on the roadRocket Richard inbound",
    "\"DJ, Do you know why you're last in the east?\"  \"Bad bounces I guess.\"",
    "Bob makes $10 Mil a year.",
    "AJ Greer should teach Mang about how to strong on the puck",
    "I hear you, but the advanced metrics don't back that up. He's playing in the bottom 20% of the league for defensemen.",
    "This is going to be a repeat of last night as far as reffing..  we've had one penalty..The refs are waiting for the Wild to do something to warrant a penalty but can't make it seem super obvious..  as long as we keep it clean I bet you they won't call another penalty for the rest of the game for either team.. game management is fucking stupid",
    "Kong?",
    "wee-woo!",
    "How the hell was that not holding?",
    "Bedard!",
    "Pretty sure that was a goal, but I'll take it",
    "fucking unlucky bounces, EVERY DAMN GAME",
    "WOOOOOOOOOO BARBIE PARTY! NEW GAME AGAIN!",
    "The downside of buying a new 4KTV during the Black Friday sales is watching your favourite team lose in high definition.",
    "Fantilli with a couple solid blocks tonight",
    "He had Slaf with him",
    "Jamie Rivers, after a high stick: \"Looks like he thought he got high stuck.\" He also says shit like, \"Up top where they keep the peanut butter.\" What the fuck?Dude, get a real fucking color guy in here. This shit is embarrassing.",
    "Clip their wings!",
    "“how does it feel to not play at all” -interviewer probably",
    "Brutal call",
    "I'll take to my grave that the number one issue standing between the Sens and being a real NHL team is DJ. Guy has to fucking go. It's just pathetic.",
    "Gudbrandson's decision in this loss wins us games and reduces injuries in future games.",
    "The truth is that the Canucks are a middling team at best, and now their true colours are showing.",
    "Yeesh that was some wacky kind of defensive breakdown",
    "#KEEGAN GOALASAR",
    "Wow, Forsberg scored his second PP goal today!",
    "Goose made an actually good defensive play...on the worst forward in the league for the money...but it was still a good defensive play",
    "Tweedle Dee and Panger",
    "Marner has been cooking tonight",
    "In other news, my local AHL team is playing tonight, too. I can watch them for less money, no regional blackouts, no need to fight pirates and VPNs to see it, and i can actually watch professionals play good hockey. Good luck tonight, guys. I'll catch the highlights from the slaughter tomorrow morning.",
    "Team doesnt have a goalie problem, Akira needed the team to start poorly and put the pressure on because be plays best when the lights are brightest.",
    "Crosschecks are fair when Calgary needs comeback got it",
    "I took a nap this afternoon, not because I'm cool and special but because my dumb ass injured leg is draining me (and I had to hobble-chase my idiot dog up a snowy hillside earlier which didn't help) and YALL. I had a dream about Cheddar, aka Jared McCann's corgi. If that isn't a delightfully good omen idk what is. LETS GO TONIIIIIIGHT! Cheddar power!",
    "Our pp has been a little flaccid later",
    "What a road trip of misery that was.So out of the 4 opponents that we played on this trip, only 1 was in a playoff spot and above the .500 mark. We failed to pick up a single point from the other 3.This does not bode well for our playoff hopes, especially if this team keeps failing to play good hockey for a full 60 minutes.",
    "These NHL Network fools are such Homers for the Bs. They immediately argue that it was a penalty for being \"stronger\" before the replay shows. Then they sheepishly say maybe it was a hold, but not really he just pushed him. This is painful.",
    "Please just let it be a leg cramp",
    "Exactly, he didn't see it coming",
    "God damn it",
    "Only bad thing about the game is the return of those godawful “wooos” in the arena.",
    "It's definitely consumed him and Idk where my dad is in it all. But I don't think I'm qualified to get him out of it at this point. Maybe one day I can get him in some kind of therapy.",
    "With tonight's game we are 1/3 of the way through the season and the Canucks are fourth in the league",
    "Chabbbyyy !!! Fuckk",
    "Seth Jones has done a good job defending schieffle this game specifically however I'd love to see him stop going behind the other teams net like a fourth forward.",
    "Honestly losing these games is better than winning them.We show we COULD win, but we don't.  We show there are parts of this team to build around, but also that we aren't a playoff team.The single worst thing that could happen to this team is to stick around till the end of the year and just miss the playoff while not selling of assets.The second worse thing would be getting blown out night after night.Honestly as fans we should cheer for close games, but games we lose, to force this team to sell.But my dog does it suck shit to watch.",
    "You're probably right. We've officially become the biggest whiners about officiating in hockey fandom.",
    "If we get a shutout I nominate \"Get Ready for This\" to be played at T-Mobile Arena by 2 Unlimited.Because this game prepared me for total domination. It also helps me forget UNLV lost today. Spirit fingers, spirit fingers everywhere.",
    "What even the fuck is this",
    "Your team fuckin blows",
    "Idk how the jets havent scored in this period",
    "Leafs are just ensuring their fans who paid good money for a ticket get the most out of it with a full 65mins of hockey…",
    "Proof?",
    "Looks like I missed a good one in the end :(But WOO, happy for VV. Definitely gonna check out a replay when I'm home later",
    "Would it surprise you guys to learn that through 25 games Buffalo is the worst team in the Eastern conference?Buffalo 2.84 GF/GP 3.40 GA/GP = -.56 GF/GPColumbus 2.85 GF/GP 3.35 GA/GP = -.50 GF/GP",
    "That ref is such a dumb cunt to even use that explanation.",
    "\"What the fuck is owen power doing on the shootout this fucking coachi.........oh\"",
    "Fuck the Flames!!! I hope he can be what Ferland was to us in 2015. A pest. An immovable and undeterred pest. And a threat.",
    "Yeah I agree, his presence is beyond what the stat sheet says, same with TJ oshie.",
    "Wake the fuck up guys",
    "As a Red Wings fan, we enjoyed that kid's rendition of the anthem as well.Thanks ESPN for showing it tonight.",
    "Hughes almost magic there haha. Fuck that was a nice play",
    "Obviously it was bad but he's also still probably a better option in that situation than current Vitek. Vitek is already mindfucked and if he would've shit the bed against the sharks that would make things even worse. Schmid has shown he can bounce back from stuff like that much easier. Just my opinion",
    "ROSSIIIII",
    "Ugly",
    "Big Z will carry us to victory.##Extinguish the flames.",
    "NOT TONIGHT !",
    "Hey 98! More hockey players have your mom's tits on their phones than have fucking Uber",
    "There's the Korpisalo I know",
    "I know this roster is hot garbage, this is a rebuild, players need developing, and all that. I'm sure everyone here agrees. Not seeing the team *at the very least* trending a tiny bit in the right direction is what gets everyone pissed off. Be shit, but be a better shit as the season progresses. Don't be a worse shit.",
    "I'm completely against giving a contract to Mantha but the way he and McMichael play together...  I would be okay with a 1 year deal for the same money.",
    "Newfie boy does good! More news at 11.",
    "It's not bad enough to lose to the worst team in the NHL. We're getting absolutely shit on by them",
    "Borque and Stank anyone?",
    "Paul Atreides is just telling Jessica to give him the water.Do I press on with dune, or do I let myself hope and turn the game back on?",
    "Jason marchment has arrived this season.He gets his stick knocked out of his hands. Instead of skating up he stays back to complain. His lack of back check gives up a good chance, but he stayed out of position long enough to be back into position. Scores a critical goal late in the second. Kept it close enough.I can't even remeber his last penalty.",
    "What a beauty, Harls!",
    "PDG still out?",
    "These are the most unbearable commentators",
    "Yes 😂 He can take a break from being king of the desert and lighting up the AHL leaderboard and come here and settle everyone down with his calm, confident poise and excellent rebound control 😂",
    "They really suck at 3v3",
    "Slaf is spending all his luck on boards instead of raking points. Like wtf , does he have magnet on the blade or how does he manage to pull that thing from boards all the time",
    "Ok dilly. Can you not?",
    "Neighbours sure seems to relish the shit-disturber role. Like Perron without the contunual o-zone penalties",
    "Quick or Igor tonight?Also you can bet the house that you'll see a ducks goal from frank vatranoOther than rangers win 5-1",
    "Horrible start.",
    "👊",
    "How the fuck do you have visa problems if you are in the NHL?",
    "Can we just design our entire powerplay around Chinakhov ripping one timers from now on?",
    "Only we can show absolutely no life on a 6 on 4 with less than a minute to go",
    "Seriously, you're going to call that.",
    "We fallin' Backlin 4 Macklin.",
    "Not sure if this is a hot take but I much prefer the building full of the other teams fans than nobody at all",
    "..And i was just beginning to think they were ready to turn a corner",
    "Crazy, who would have thought we were going to get this much production from him.",
    "Yea good shit slaf, be aggressive, that's what u wanna see, love seeing that anger and passion",
    "No you're right. Sure the OT goal was a 2 on 1 but Samsanov is just not good. Period. Everything is a rebound. Every puck towards the net is a circus. Great he makes the odd save but, that's not a cup winning format.",
    "lets go. Gilbert's a dog",
    "Put his entire soul into that shot lmao",
    "For real.",
    "Chabby's back!!!",
    "Perron is getting suspended",
    "The brick wall with a mustache. Finally.",
    "We'd need a sweetener. McDavid as well makes this a bit easier to take.",
    "We must lead the league in shots that go over the net and leave the zone",
    "Looked like Laf blew an assignment and Talbs probably couldve had that",
    "Ping!",
    "The thing is Siegs is a better player than this. Idk what happened",
    "This might just be one of those games where you get beat by a spectacular goalie performance. Plenty of time left. At least we are making Vasy work for it.",
    "Oh we almost had a nice stoner there",
    "Boys have played a pretty complete game tonight. Let's hope they close it out.",
    "Does this mean we somehow get Torts as a head coach? I'd be on board with that.",
    "1, 2, 3, 4, HEYYYYYYYYYYYYYYY CHRIS KREIDER, OOOH AH, I WANNA KNOWWW OH OH OH, IF YOU'LL SCORE A GOAL!!!!",
    "What a pass.",
    "That goal is on Doug",
    "By points % we are which is more important than total points.",
    "They put up one helluva fight in the first two periods. But this was one of those games we were destined to win lol hockey gods said fuck the habs",
    "What? Celebrini and Eiserman are going nuts right now",
    "LETS FUCKING GOOOOOOOOOOOOOOOOOOO",
    "Not Woll!  FFS",
    "Who tf is gonna take him!?",
    "So, I guess the boys were pissed about the Sharks game.",
    "Pack it up, rebuild the entire team, send them all down to the AHL, they are all a disgrace!",
    "If we lose tonight I'm giving up on the season. Columbus is so shit. We have had multiple days off for rest. This is a korpisalo revenge game. If we lose then just throw the towel on the rest of the season.",
    "Okay so... hear me outWe have our mojo...So can Driedgs play on Saturday? Pretty please?? I'm pretty sure this team can support him even if it's a little rocky at first. Please Hak? Please???",
    "Confirmed",
    "What I'm saying is that playing KJ, Fantilli, and Bemstrom more than the 3 guys you called out will lead to worse results than we are getting. I think KJ and Fantilli will be sick one day, but this obsession our fan base has with them needs to stop. They are not better than our veteran players.",
    "PSA: chopping green onion will also make you cry.",
    "Keep waiting.  Laine out.",
    "Your so fucking pathetic, I get a tax break just for hanging out with you.",
    "Perds Moment",
    "Let's go Alexandria Capital-Adjacents!",
    "We all give “constructive criticism”, lol",
    "After winning a cup too, that man deserves it.",
    "Actually, not after tonight he doesn't.  Willy is now the points leader.",
    "I call that the \"Sens special\".",
    "Monkey off his back!",
    "wtf was that?",
    "“The Swedish MeatWALL”",
    "Bro is on pace to decimate his previous point totals, and knocking on the door of 25 goals. Pretty insane.",
    "When is ours",
    "Kaliyev deserves more minutes Down 1, we need someone who can score",
    "I hated the New Jerseys online when their reveal happened. After watching them in game I gotta say they've grown on me.",
    "Carl Weathers is that you?",
    "That is one of the reasons Chucklefuck went to Florida, couldn't handle the heat of a Canadian market. Fans here will hold you to account for shenanigans like that, fans in Florida dgaf.",
    "You forgot 4 unanswered goals!",
    "holy fuckeroni",
    "How did we go from 2-12 shots in the first to 22-23 shots in the 3rd",
    "#COMEBACK BABY!!!!!!!",
    "Same, same. But see you here Friday?",
    "Golly shucks even!",
    "Shades of the bubble playoff series against these guys",
    "Whoever is in charge of this team's conditioning should be fired immediately. Every single night the other team is zooming around while these guys are dragging ass.",
    "Benn has a crush on McDavid",
    "3 straight days of snow removal just in time for the game. Hopefully it's a good one",
    "yeah baby, pad that goal differential!",
    "Barron got hit in the head. Seems to be fine I think",
    "Lol, those dudes in the ref uniforms",
    "When do we start questioning Andlauer and Staios? You can't hide behind “needing consistency” forever.",
    "Great defensive effort from the team after that first goal. And a great effort on the PK. Brock deserves all this success and more, super happy for him. And a great effort from Kuzmenko, great to see.",
    "Ass",
    "There's more comments in here than the /hockey GDT, is this fanbase turning into the Flames who all hide in their own sub?Mixed GDTs are way more fun, give it a try!",
    "don't like that as much",
    "#NEIN NEIN NEIN!!!",
    "Ahhh, missed it then. Watched only part of the second.",
    "Ha I just said this out loud too",
    "So far, so good",
    "Bedard is just nasty…",
    "Hearing Razor talk up Marchment is music to my ears he's becoming one of my favorites this season because he is so much fun to watch.",
    "Meanwhile, they ignore the lack of any Hab showing up for the 3rd period.",
    "Absolute dog shit rebound control from Honda. He can't corral a fucking thing.",
    "Well if you cant beat the other team may as well get a win over the ref.",
    "I'm actually stunned. Wow.",
    "Why does Nylander look like he's never hustling . Whether he's on a roll or not the guy has 0 give a fuck meter",
    "Choke on it debbys",
    "Dude is a trash ass goalie",
    "I am so happy to have been wrong about Rossi's development. He is making such a solid case for our future, long term 1C.",
    "Do you know when he'll be back?",
    "Zadorov doesn't have to be good he just has to be better than Juulsen",
    "Clinical!",
    "f",
    "I can only get it on espn+",
    "he was FUCKING BRUTAl",
    "We are way better with gadjovich and Kulikov in the lineup. Also Lundell is an instant line killer. Putting Tkachuk with him guarantees Tkachuk won't get going",
    "this one needs more upvotes",
    "I was hoping for a Bieksa speech",
    "NHL is allergic to calling penalty shots.",
    "Half this sub wants a 5 plus year rebuild. Shit like this doesn't phase them.",
    "Oilers getting away with murder here",
    "Just as we all expected, up 2 to 0 after 20 minutes.",
    "Shitty 2nd period. Come on guys. GKG",
    "Clearly a goal",
    "I want to agree but he felt invisible when Jack and Nico were out",
    "feel like shesty is starting to try and do way too much w the puck every time he lets up a few",
    "Brady's the only reason we're in this game. Chirping is part of hockey. Thing's definitely are looking good being down 4-2 tho we need a big 3rd.",
    "We have had a shit ton of line combos. Very few have even shown an inkling of life. We have a bunch of guys on this team. That's it",
    "And now the goal has changed to Torp from Colt and Sunny.",
    "Kesselring has been so much better than he was last year",
    "![img](emote|t5_2r10m|16352)![img](emote|t5_2r10m|16352)![img](emote|t5_2r10m|16352)",
    "FUCKING MERRILL",
    "Nice kill there from both shifts",
    "Next time we get shut out I'm checking in ;)",
    "This isn't a serious franchise. Another year wasted without playoffs. What's next? I know I'm getting ahead of myself here, but what happens if we miss the playoffs next year too? When is this rebuild going to be considered a failure?Our owner needs to make changes. We can't afford another \"experiment\" to start next season. Put an intern coach behind the bench and see what you have with this roster. Make a permanent change this off season. Sens played well last night but it's the same story over and over. They need two points, not stick taps.This franchise is edging closer and closer to Buffalo Sabres territory.",
    "I'm liking Kurashevs breakout season a bit to",
    "Omg I'm so jealous! I am at the game too! I wanna meet you lovely humans",
    "Sometimes i miss the super boring defensive days.",
    "Happy for Vladi!!Great to see him get 2!!",
    "I knew it wasnt gonna be easy, too many defensive lapses in this one, hard to be picky when we keep winning but we arent tryna become the oilers here we gotta sharpen up defense. Artemi 4 Hart",
    "Must say Eberle has faded hard for us... big non factor guy",
    "I LOVE him",
    "Zibby looks pissed",
    "Woah Demko lost the net",
    "The worst thing about the Yotes is their social media admin.",
    "I feel like we should just start playing like the flames and spray the net every game. 20-25 shots per game is not going to cut it for us obviously",
    "Samsonov was fucking awful dude, come on. Let's call a spade a spade.",
    "Rossi winning the rookie battle so far this game",
    "Asking the league to...rig it better? for us this time.",
    "Alright, time for some PR work for the sick kids.",
    "we have a lead# we have a lead!!!",
    "Wow those jerseys look nice on ice",
    "the rain came and ended some droughts in habsville",
    "How funny would it be if all 3 stars were the Hughes brothers",
    "It's a great response to all the people on r/dodgers who responded with “at least we've still got the Lakers & Rams” after the Dodgers were eliminated. That shit makes me upset.",
    "These refs are SOFT",
    "S",
    "It takes a very special kind of douche bag to boo a guy that gets his 1000th point.",
    "That was just a terrible misplay from Wedgewood",
    "That's one of things I KNOW is going to happen...we just have to be patient lol.",
    "Bleh",
    "I need Jamie to flatten someone.",
    "...did I just hear 7.99 \"*with ads*\"Noah get the boat",
    "[Discord](",
    "It's just ground hog day. I don't understand why management is letting this season slip away by keeping DJ around.",
    "The scheduling sucks for the Canucks. With a new coach and new system this year, the players don't have time to work on the 'details'. Something Tocchett has been saying over and over again.There's a reason why certain players aren't performing under his system. Namely, look at Kuzmenko.",
    "Sucks that we're gonna have to give up Seamus Casey for some goaltending help but I'd rather not have to watch another 60 games of giving up 4 goals a game",
    "It was weird. He took a puck to the face, then while falling he sticked his teammate in the face too.",
    "The real test. if we can beat down some canucks I'll say we're back!",
    "The issue here, is so is the Kraken. And they have looked remarkably weak tonight.",
    "given you're from jersey we can assume you don't know how to read so whoever is typing your comments for you owes the rest of us an apology",
    "God damn, fuck this game.And fuck that foot he stuck out. Englund...do your thing.",
    "I think Grier will definitely trade the rentals and then we will suck again, but it's nice playing some competitive hockey in the mean time.",
    "Bruno is not immune to dumbass lineup decisions it appears",
    "Zebras are on benzos.",
    "Granato really has a handle on this team doesn't he?",
    "No we would have lost in regulation and gotten no pt.",
    "They absolutely cannot afford a flat period here",
    "It was tied and 3rd goal was under review when I left for work. This team, this fucking team since day fucking one! VEGAS STRONG",
    "Good job Petry!  You fucking idiot! :D",
    "That was a decent look on the PP, need to have a different threat than just Ovie. Backstrom used to be that guy.",
    "why can't we play like this for the full sixty minutes",
    "League wanted the flames to lose so badly lmfao",
    "Booing Andy? Lmao",
    "It was worth it. These jsckoff refs were clearly so bad they'd have been better if they'd been on the take",
    "we're sooooo goooooood",
    "I want every vet except Boone benched and I want every player under 25 in Cleveland called up, idc who you have to sit.",
    "One of those ones where everyone knows it's in, but you can't physically see that's in so it's the call on the ice as it's inconclusive",
    "Connor Bedard really is the only reason to watch these games this season.",
    "No. The over time loss and especially the way they leafed it, ruined it.",
    "\"we have whistles on the play\".. what is the whistle for you idiot commentator???",
    "How is it that tanev doesn't have a scratch on his face?",
    "Yes. CPS will get involved.",
    "I hate watching a team with 0 direction. Ownership just wants to wing it. I'm sick of it",
    "At least five.",
    "Goddamn, I was a huge Raptors fan during the Bosh Era and I totally forgot that he even existed lol",
    "You can literally watch any remaining microgram of confidence leave VV after the last canucks goal. He's a shell of a goalie at this point. Possibly a serviceable AHL veteran backup to a young prospect who needs some good bed-time stories.",
    "Big 2 points against a very good Bruins team. Enjoy it now but also gotta realize you've got a back to back this weekend against two weak teams in Columbus and Anaheim and then a very important division game against the Flyers next week. Need to take this win and keep it rolling. Win the two divisional games and take 4/6 points in the next 3 and I'll be feeing pretty good.",
    "Salt excuse. They beat us fair and square.",
    "The two cup runs we were road warriors, especially the first cup run....Kopi and Drew know a little something about playing some of their best hockey in the opponent's barn! The younger kIngs are following suit!Breaking this NHL road winning streak to open the season sure makes me feel all warm and cozy inside!GKFG!",
    "Stay classy, Islander fans...",
    "The Leafs if being an embarrassment was the NBA Finals:",
    "No wonder we are getting shutout. Have you seen Ryan's brother's mustache?? It has 15 saves already.",
    "just googled this holy shiiiittttt",
    "YAK YAK YAK YAK",
    "Hell of an apple by Pickles tonight. Love to see it",
    "Will someone on the team step up for a few minutes?",
    "How is sportsnet doing a Detroit home game broadcast, by the way?",
    "I'm really scared for a 🦒 🦒 d pairing, honestly, but it's better than what the line-up was 2 days ago. soooooo let's fucking goooooo",
    "Nah he's 1 behind Matthews",
    "Huberdeau keeps sinking do you have to promote someone",
    "Want Englund to send him though the boards.",
    "Team has disappointed me so long even when we're ahead I keep feeling dread we'll fuck it up.  Thanks to Juulsen that almost happened, oof.",
    "Have to score on this 🤞🏻🤞🏻🤞🏻",
    "April 18, 2024?",
    "LOLOLOL \"Fuck are we doing?\"We're gonna have to let Luke go",
    "Fuck fuck fuck.",
    "Then patera with Clutch save to keep score the same",
    "He got his stick knocked out of his hands, but I don't think it would've helped him make the save. I'm glad we didn't challenge",
    "Lindor truffles. Embarrassed to say how many I've eaten recently",
    "Incoming « leafs fan coming in peace » on our sub.",
    "The Joshua Garland bromance 🥹",
    "Tony the Tiger says: grrrrrrreeat!!!",
    "fuck alex pietrangelo",
    "Random aside - but as a Brit watching all these localised ads, it's such an education while confirming all stereotypes. Minnesota has adverts that go hard for competitive fishing, Jesus and DIY stores and Seattle has divorce lawyers for men lol.",
    "We have the pieces, just need to put them together",
    "McCann smash",
    "I sure as shit hope you didn't travel from the north east to do it lmao",
    "Does anyone know if they sell any extra Grateful Dead jerseys after the fact? We couldn't make it tonight, and they are siiiiick.",
    "I was going to say someone needs to clip that with the title \"burns attempts to end tarasenkos career\" or something dumb like that",
    "Holy shit a penalty shot. Don't see those much.Edit: ok Olof. I see you.",
    "I hate how much our commentators mention the sharks last two huge comeback wins",
    "Guys, the leafs are in injury hell right now with a shattered lineup. In the Matthews-Marner-Nylander era, I don't think we have seen an injury situation this bad (some of those years they were almost completely unaffected by injuries).  Yet here we are 2nd in the Atlantic and 3rd in the east right now by points percentage. They are getting it done, finding they way to win.",
    "Slaf goal would make this incredible",
    "Poetry in motion",
    "Quick prosvetov lose your pad again",
    "that was fucking bullshit malkin  was holding his stick",
    "Exactly, Jack just looks more dynamic than Petey and he's at 8 mill. In no way is Pettersson better than Jack; now that is a player that should be getting 12+ mill",
    "They should be fuckin ashamed of themselves .",
    "Yes we do. He's gotta answer for this garbage.",
    "Joey is still fairly young goalie wise but I like the progress he's made. Plus athletic and aggressive are hard to teach.",
    "I am too. Perhaps the fact that he didn't spend even half his NHL career with us is a factor? Idk but I'd love to see him in the rafters",
    "I didn't like them at first but I find they grow on you after a while.",
    "Maybe the Leafs fans on Twitter were right, this game *is* scripted but not the way they thought it was.",
    "GUS BUS",
    "Showing some real urgency out there",
    "What a pass, what a shot!!",
    "Another Quinton Byfield masterclass game? Excellent",
    "I'm in Indy, so I feel you! Made the drive out just for the heck of it!",
    "Leafs lucky to get a point. Cant win many games not starting on time and just trying to go balls out in the 3rd",
    "YOOOO",
    "Clifton stay on your skates pls",
    "Dear god",
    "Any Soderblom apologists still want to argue with me in my DM's?",
    "He was fucking pissed when he got to the bench that last time. What a freaking battler. Dead tired and still makes two critical defensive plays",
    "He's going bar down and she's just going down",
    "Using him in OT was questionable.",
    "Maybe closer than you'd like against the last place team but it's #2 of a back to back with travel against a team that's been playing better as of late. They controlled the play and had an answer to every Shark surge. They got the job done, got the points  and a 1 goal win is the same as a 5 goal win in the standings.",
    "Holy fuck this team is bad",
    "Bruh 4 penalties already?",
    "Icehogs losing 3 0 gulls have scored 10 to 0 against the Hogs in 100 minutes of game time. I need a hug and a beer",
    "Eric Robinson is obviously the key to it all. (I didn't know he existed before yesterday)",
    "Who wants him? Especially for his cap hit? Look at how much trouble Zadorov's ~~2.15m~~ 3.75m AAV caused us, imagine Mange's 5.8m AAV...",
    "The West Coast games on weekdays are tough. My weekdays start at 5 AM. So, staying up until ~1 AM is impossible.",
    "He played that fight perfectly and secured the W pretty much. He's a pussy and he'll get shit but that play by him was smart and goated.",
    "Why is everyone allowed to fuck up our players with minimal penalties?",
    "At least we got a point, but fuck me Sammy…",
    "I feel so bad for the Red Wings",
    "Yea they aren't a playoff team",
    "Jani and Esa the offensive beasts 😤😤",
    "He was born on the 36th?",
    "Beautiful goal.",
    "The pan back to bones while johns still talking 😭",
    "If we get 8 draw points tonight our score would be 9/10/11 and that would be siiickkk",
    "It helps that genuinely every single team in the league has a better coach than we do. Once we get a new coach, I could see a turn around as big as New Jersey from 2021-22 to 2022-23.",
    "I mean I heard that our longest winning streak this season has been 2, which we've done once but I still have faith (depending on how the first 5 minutes go)",
    "Well that was a series of developments",
    "BadCan in shambles /s",
    "Jt and Reilly have been the two best players on the team they need more credit",
    "The fourth line has heard the grumbling about Sprong, Geekie, and Donato and took it personally.",
    "Team has 9 games left in 2023. 5-3-1 is what I want. Something like,Canes - WBolts - OTLCats - LWild - WHawks - WPreds  - WStars - LSharks - WFlyers - Wexcept we all know they're going to screw up one of the easier games on there, so yeah, maybe the Wild is the third L.",
    "Oh baby",
    "It wasn't long ago that he was leading the league in points and he's still tied for 6th in the league but yeah she he's been bad for nearly the whole season sure",
    "ALWAYS BRING YOUR DAD TO GAMES",
    "Fuck, why doesn't McCabe unload that slapper more often???",
    "What the fuck does Pascal fucking tell them before the 3rd because this shit happens every single goddamn time. We fall asleep and just let teams get shots off. STOPPPPPPPPPPPP PLEAAAAAAASSSSEEEEE",
    "priorities:#1: better start",
    "Ya knew if they got one good look it'd be a snipe and in. Be happy for the point - that was majestic.Time for Sammy to enter beach ball protocol",
    "No, he took another job - can't recall if it's coaching or broadcasting.",
    "i remember when he did that years ago against the hurricanes",
    "Bro threw his stick at him",
    "Okay, I missed the first two periods entirely. How did we look?",
    "Holy fuck no trip there??",
    "Well it was a good season... we'll get em next year",
    "LETSFUCKINGGO",
    "You're my Wedgewood wall",
    "uh oh here it comes dot jpeg",
    "Mika is making mistakes on the most routine plays.",
    "If you're actually conflicted; get. the. fuck. out.",
    "Shut the front door.",
    "tyson nash is garb, on par with avs and bruins announcers",
    "A pre pubescent rabbit",
    "Can we have the blue “starting soon” screen back",
    "Win now??Francis says the dumbest things sometimes",
    "I'd love it if we could score again",
    "Salvageable makes it sound like there is no hope… The whole point of a total rebuild is to start from scratch which has been done. Plenty of growth to be had especially in Bedard. Prior to Kane and toews the hawks were far worse than what you see here today as there was no hope to be seen. Prospect pool is deep and there's a lot of cap space to go around. Future is bright",
    "Wearing a Harvard Letterman today in honor of the Ivy League Prodigy.",
    "I fucking hate the games against the Devils. Why do I even bother watching them.",
    "having to do a time sensitive job with 18,000 people looking at you must be hell lmao",
    "holy shit we aren't even halfway through the first",
    "i think buzzed/buzzing should be added to the trapezoid drinking game.",
    "Thomas Harley is a Dallas Star",
    "Who the fuck is Geekie and why do I have to hear his name every 5 mins",
    "An in-game adjustment that doesn't involve promoting offensive juggernaut Barclay Goodrow. What is this sorcery? Not a masterclass tonight, but some real in-game adjustments helped bring the team back in it. The compete including Shesty did the rest. Love this team. Also thrilled for Brodzinski. Talk about a guy who's played well enough to earn an NHL spot the past few seasons only to be pushed out. Instead of sulking he's gone down, captained the pack, helping young kids like cuylle and Othmann develop, and lit up the AHL. Loved seeing him finally put some points up in the NHL as a reward. Really hope he sticks this time. His track record doesn't suggest it, but I think his speed, hustle, and shot are an asset.",
    "I also don't get it and would love to know what he said",
    "Terrible penalty by Dahlin",
    "I really hope Larkin is OK. Detroit fans are heavily smoking that copeium",
    "They didn't follow my plan of a goal once every 4 minutes.Outrageous.",
    "Hanley playing on his off hand hurts him. Well it would hurt anyone.",
    "isn't this 5 straight.",
    "Hughes and Hronek looking kinda iffy lately.  Petey with a fantastic game. When that guy plays with heart there's not a lot of players in this league at his level.Lafferty has been a steal. Guy has been sensational all year. Stealth MVP candidate imoBoeser is almost like a power forward now with how dominant he is on the outside. Watching him transform into an outside force has been a treat. Miller being the superhero he normally is.Hog has been feisty lately. Fighting out there.Joshua I thought had a really strong gameHonestly, kinda liked Myers tonight. And Big Zaddy has really impressed me with his mobility. I liked their pairing a lot.Score doesn't reflect how well we played imo. Great game by the team.",
    "He has that Hagel hustle genetic!",
    "Prolly a",
    "Good to see that we broke the shutout!",
    "I don't drink at all, this current Blackhawks team is awful for my happiness 🙃",
    "Good PP, but just did not get a goal.",
    "Sadly I think it does",
    "Just ... awful",
    "nick and David are tied in my book",
    "Kings can't help but score 4 goals a game.",
    "Richardson really needs to focus Jones' efforts in the areas where he helps.",
    "First goal I understood but that was just…. Yikes",
    "All I want for Christmas is LOUUUU",
    "I'm not superstitious, I'm an adult. Also me thinking that I'm 3-7 at MSG when not wearing a ring and 2-0 while wearing a ring. Do I wear a ring tonight?",
    "They just keep winning. Doomers in shambles",
    "Ok, let's not choke",
    "Nico for Vezina",
    "Ooooh, i like mafia ties. That's fun!",
    "❤️",
    "Am I the only one who heard \"Delaware, New Jersey\"?",
    "Jiri clutches up way to get ur first dub",
    "Yup 40% is REALLY good on the shootout. Goalies have the advantage and I'd guess they stop about 75-80% of the shots too.",
    "Terrible.",
    "Big game for the wild card standings! Let's keep this thing rolling",
    "Ahhh gotcha! Fair. So 29 and up 😂",
    "Gru and Daccord have looked solid this Canada trip. Wish they could have won one of these games.",
    "How is this even a comparison lol, one is an underated GOAT and the other well exists and is a b word.",
    "Carlson looks like Don Rickles and Phil Kessel had a child",
    "Paired with your friendly neighborhood chaos giraffe",
    "Louis Crevier is the man, if you are brave enough!Also pro tip: parlay the first goalscorer with 1-2 more in other games and throw $2 on them all for maximum odds on a shitty bet that you probably wouldn't win one leg of anyways 🤩",
    "I think in order to appease the hockey gods, we should pitch Travis Hamonic into a volcano.Whether it works or not we come out ahead.",
    "Dude is getting absolutely no help. Pretty sure Vronks goal was deflected off an Ottawa defender, they let Boone just post up on front of him (which we should always do on the PP).I can get why he flipped on his team the other night.",
    "I mean, Z did cross check Maroon first",
    "The Soucy effect is noticeable.",
    "The Bratt attack bails out the d let's go",
    "Uh oh power play. Panthers about to commit every infraction in the book now",
    "Wait. Did Zadorov seriously get an empty-netter? that's hysterical.",
    "Fans better boo the fuck out of this team",
    "I like this comment because if you put a comma after the \"No\", the entire meaning changesJust something I noticed",
    "Timmy's lucky that was Brady and not a cane, or he woulda been caught badly there",
    "Shoot the fucking puck Murph",
    "This one's gonna sting.",
    "Santa, for Christmas this year can I get some adjustments from Hakstol for once?",
    "Out of their system? Didn't Sens smoke them Tuesday? I say they have hit a bump in the road. Hopefully they make the correct adjustments but they have played well above what people would've expected by now. They need to tighten up defensively. They were sloppy against Sharks,Sens and now Caps",
    "Dean Evason next Seattle coach confirmed",
    "wut",
    "Fuck yeah! In New York too! Also overtime is literally inevitable with this team lol",
    "With Willem Dafoe and Robert Pattinson? I think it's the bleakest movie I've ever seen in my life.",
    "Eric Robinson era",
    "Looking to sell a pair of seats in the 100s with parking and food voucher for cheap tonight if anyone is interested",
    "If he challenged that, I would have gone and beat him up after the game lol",
    "Meier is a ghost",
    "i never understand how we can look so strong but get nothing done",
    "Holy shit hahahaha. Let's fucking go!",
    "3 points out of 4 in NY is pretty awesome",
    "Thank you sincerely",
    "I'll reserve judgment once the new coach smell is offBut it's nice to see them shooting the puck",
    "Fucking peppering them! LFG",
    "better first periods would help a lot too, but I agree"
]