{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "cardiffnlp/twitter-roberta-base-sentiment-latest",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 40,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 3,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "query",
    "value"
  ],
  "task_type": "SEQ_CLS",
  "use_dora": false,
  "use_rslora": false
}